pyel.org
* todo
** built-in methods
| method           | list? | tuple? | str? | dict? | tests | notes                       |
|------------------+-------+--------+------+-------+-------+-----------------------------|
| append           | X     | -      | -    | -     | X     |                             |
| count            | X     | X      | X    | -     | X     |                             |
| extend           | X     | -      | -    | -     | X     |                             |
| index            | X     | X      | X    | -     | X     |                             |
| insert           | X     | -      | -    | -     | X     |                             |
| pop              | X     | -      | -    | X     | X     |                             |
| remove           | X     | -      | -    | -     | X     |                             |
| reverse          | X     | -      | -    | -     | X     |                             |
| sort             |       | -      | -    | -     |       |                             |
| clear            | -     | -      | -    | X     |       |                             |
| copy             | -     | -      | -    | X     | X     |                             |
| fromkeys         | -     | -      | -    | X     |       |                             |
| get              | -     | -      | -    | X     | X     |                             |
| items            | -     | -      | -    | X     | X     |                             |
| keys             | -     | -      | -    | X     | X     |                             |
| popitem          | -     | -      | -    | X     | X     |                             |
| setdefault       | -     | -      | -    |       |       |                             |
| update           | -     | -      | -    |       |       |                             |
| values           | -     | -      | -    | X     | X     |                             |
| zfill            | -     | -      | X    | -     | X     |                             |
| upper            | -     | -      | X    | X     | X     |                             |
| translate        | -     | -      |      | -     |       |                             |
| title            | -     | -      | X    | -     | X     |                             |
| swapcase         | -     | -      | X    | -     | X     |                             |
| strip            | -     | -      | X    | X     | X     |                             |
| startswith       | -     | -      | X    | -     | X     |                             |
| splitlines       | -     | -      | X    | -     | X     |                             |
| split            | -     | -      | X    | X     | X     |                             |
| rstrip           | -     | -      | X    | -     | X     |                             |
| rsplit           | -     | -      | X    | -     | X     | equivalent to str.split     |
| rpartition       | -     | -      | X    | -     | X     | equivalent to str.partition |
| rjust            | -     | -      | X    | -     | X     |                             |
| rindex           | -     | -      | X    | -     |       |                             |
| rfind            | -     | -      | X    | -     | X     |                             |
| replace          | -     | -      | X    | -     |       |                             |
| partition        | -     | -      | X    | -     | X     |                             |
| lstrip           | -     | -      | X    | -     | X     |                             |
| lower            | -     | -      | X    | X     | X     |                             |
| ljust            | -     | -      | X    | -     | X     |                             |
| join             | -     | -      | X    | -     | X     |                             |
| isupper          | -     | -      | X    | -     | X     |                             |
| istitle          | -     | -      | X    | -     | X     |                             |
| isspace          | -     | -      |      | -     |       |                             |
| isprintable      | -     | -      | X    | -     |       |                             |
| isnumeric        | -     | -      |      | -     |       |                             |
| islower          | -     | -      | X    | -     | X     |                             |
| isidentifier     | -     | -      |      | -     |       |                             |
| isdigit          | -     | -      |      | -     |       |                             |
| isdecimal        | -     | -      |      | -     |       |                             |
| isalpha          | -     | -      | X    | -     | X     |                             |
| isalnum          | -     | -      | X    | -     | X     |                             |
| format-map       | -     | -      |      | -     |       |                             |
| format           | -     | -      |      | -     |       |                             |
| find             | -     | -      | X    | -     | X     |                             |
| expandtabs       | -     | -      |      | -     |       |                             |
| capitalize       | -     | -      |      | -     |       |                             |
| center           | -     | -      |      | -     |       |                             |
| encode           | -     | -      |      | -     |       |                             |
| endswith         | -     | -      |      | -     |       |                             |
| maketrans        | -     | -      |      | -     |       |                             |
| __add__          |       |        |      | -     |       |                             |
| __contains__     |       |        |      |       |       |                             |
| __delitem__      |       | -      | -    |       |       |                             |
| __eq__           |       | -      |      |       |       |                             |
| __ge__           |       | -      |      |       |       |                             |
| __getattribute__ |       |        |      |       |       |                             |
| __getitem__      |       |        |      |       |       |                             |
| __getnewargs__   | -     |        |      | -     |       |                             |
| __hash__         |       |        |      |       |       |                             |
| __gt__           |       |        |      |       |       |                             |
| __iadd__         |       | -      | -    | -     |       |                             |
| __imul__         |       | -      | -    | -     |       |                             |
| __init__         |       |        |      |       |       |                             |
| __iter__         |       |        |      |       |       |                             |
| __le__           |       |        |      |       |       |                             |
| __len__          |       |        |      |       |       |                             |
| __lt__           |       |        |      |       |       |                             |
| __mul__          |       |        |      | -     |       |                             |
| __ne__           |       |        |      |       |       |                             |
| __repr__         |       |        |      |       |       |                             |
| __rmul__         |       |        |      | -     |       |                             |
| __reversed__     |       | -      | -    | -     |       |                             |
| __rmul__         |       |        |      | -     |       |                             |
| __setitem__      |       | -      | -    |       |       |                             |
| __sizeof__       |       |        |      |       |       |                             |

** built-in functions
http://docs.python.org/2/library/functions.html

| function     | status | tests | notes                                    |
|--------------+--------+-------+------------------------------------------|
| abs          | x      | x     |                                          |
| divmod       | x      | x     |                                          |
| input        | x      |       |                                          |
| open         |        |       |                                          |
| staticmethod |        |       |                                          |
| all          |        |       |                                          |
| enumerate    | x      | x     |                                          |
| int          | x      | x     |                                          |
| ord          | x      | x     | strings > 1 char does not raise an error |
| str          | x      | x     |                                          |
| any          |        |       |                                          |
| eval         | x      | x     |                                          |
| isinstance   | x      |       |                                          |
| pow          | -      | x     | assumes numbers                          |
| sum          |        |       |                                          |
| basestring   |        |       |                                          |
| execfile     |        |       |                                          |
| issubclass   |        |       |                                          |
| super        |        |       |                                          |
| bin          | x      | x     |                                          |
| file         |        |       |                                          |
| iter         |        |       |                                          |
| property     |        |       |                                          |
| tuple        | x      | x     |                                          |
| bool         | x      |       |                                          |
| filter       |        |       |                                          |
| len          | x      | x     |                                          |
| range        | x      | x     |                                          |
| type         | x      | x     | non-standard but mostly compatible       |
| bytearray    |        |       |                                          |
| float        | x      | x     |                                          |
| list         | x      | x     |                                          |
| raw_input    |        |       |                                          |
| unichr       |        |       |                                          |
| callable     |        |       |                                          |
| format       |        |       |                                          |
| locals       |        |       |                                          |
| reduce       |        |       |                                          |
| unicode      |        |       |                                          |
| chr          | x      | x     |                                          |
| frozenset    |        |       |                                          |
| long         |        |       |                                          |
| reload       |        |       |                                          |
| vars         |        |       |                                          |
| classmethod  |        |       |                                          |
| getattr      | x      |       |                                          |
| map          | x      |       | ??? really equivalent?                   |
| repr         |        |       |                                          |
| xrange       |        |       |                                          |
| cmp          |        |       |                                          |
| globals      |        |       |                                          |
| max          |        |       |                                          |
| reversed     |        |       |                                          |
| zip          |        |       |                                          |
| compile      |        |       |                                          |
| hasattr      | x      |       |                                          |
| memoryview   |        |       |                                          |
| round        | x      | x     |                                          |
| __import__   |        |       |                                          |
| complex      |        |       |                                          |
| hash         |        |       |                                          |
| min          |        |       |                                          |
| set          |        |       |                                          |
| apply        |        |       |                                          |
| delattr      |        |       |                                          |
| help         |        |       |                                          |
| next         |        |       |                                          |
| setattr      |        |       |                                          |
| buffer       |        |       |                                          |
| dict         | x      | x     |                                          |
| hex          | x      | x     |                                          |
| object       | x      |       |                                          |
| slice        |        |       |                                          |
| coerce       |        |       |                                          |
| dir          |        |       |                                          |
| id           |        |       |                                          |
| oct          |        |       |                                          |
| sorted       |        |       |                                          |
| intern       |        |       |                                          |
| exit         | x      | no    | not of type Quitter, just a function     |

** bugs
*** X break in a while loop 
(cl-prettyprint (pyel "while True:
 if x == 3:
  break"))
(while t
  (if (pyel-== x 3) nil))

*** list augmented assignment
a = [1,2,3]; a += ['hello']
*** X if-else does not work - no else
(pyel "if a:
 b()
else:
 c()")
*** X return in while loop
return in a while loop should always break

def test():
 while True:
  return y
==> (def test nil nil (while t y))
*** X return in an 'if' statement
should remove context of all but last expression
except for the case in which there is only one.
currently:
 does not account for the single expression case

* documentation
TODO: how to export a heading as pdf or into a seporate file?

TODO: update most of this. tranforms have changed
** type switches
 pyel-switch forms are inserted in a backquoted form so an ',' unquote
 may be used. DO NOT UNQUOTE THE ARGUMENTS, they will be replaced later

