pyel.org
** from py ast to e-lisp transform
#+Begin_SRC emacs-lisp
  ;;First, get the python ast:
  (py-ast "(a,b)")
  "Module(body=[Expr(value=Tuple(elts=[Name(id='a', ctx=Load()), Name(id='b', ctx=Load())], ctx=Load()))])
  "
  
  ;;Second create any newly needed python AST interpretor.
  ;; Here we need Tuple(elts,ctx)
  
  def Tuple(elts, ctx):
      return l_str(["tuple ", ll_str(elts), ctx])
  
  ;;Third, define a tranform to convert the function to lisp
  (def-transform tuple pyel ()
    (lambda (elts ctx) ;;Ignoring ctx for now
      (concat "["
              (mapconcat 'transform elts " ")
              "]")))
  
  
  ;;Forth, create tests. Evaluate the expresstion, the test are sent to the kill ring
  (pyel-create-tests 'Tuple
                     "()"
                     "(a, b)"
                     "(a, (b, (c,d)))"
                     "((((((((a))))))))")
#+END_SRC
** ways to define new transforms
TODO:
 how to define a macro transform
TODO: pyel-define-function-translation
*** change a function name
Example:
#+Begin_SRC emacs-lisp
(pyel-translate-function-name 'range 'py-range)
(pyel-translate-function-name 'map 'mapcar)
#+END_SRC
*** change a variable name
Example:
#+Begin_SRC emacs-lisp
(pyel-translate-variable-name 'None 'nil)
#+END_SRC
*** define a general translation
Example:
#+Begin_SRC emacs-lisp
(def-transform assert pyel ()
    (lambda (test msg)
      `(assert ,(transform test) t ,(transform msg))))
#+END_SRC

*** define a method translation
$var replaces var with name of the original var
   (expands to ,var in the macro definition)
 other parameter references are evaluated and assigned to tmp variables
#+Begin_SRC emacs-lisp
(pyel-method-transform append (obj thing)
                  (list _) -> (setq $obj (append obj (list thing)))
                  (_ _)    -> (append obj thing))
#+END_SRC

*** define a function translation
#+Begin_SRC emacs-lisp
  (pyel-func-transform len (thing)
                       (object) -> (__len__ ,thing)
                       (_)      -> (length ,thing))
#+END_SRC
*** type switching transforms
  (pyel-dispatch-func ** (l r) ;;pow
                    (number number) -> (expt l r)
                    (object _ )
                    (_ object) -> (--pow-- l r))

*** declare a name to be a macro
(pyel-declare-macro "save_excursion")
** writing faster code
*** large difference
*** small difference
prevent pyel from converting *varargs to a vector. Instead manipulate it in python as if it were a list instead of a tuple like it normally is.
put the following line in your config:
  (setq pyel-use-list-for-varargs t)
  ==> NO! ALL CHANGES TO CODE TRANSFORMS SHOULD BE INDECATED IN THE PYTHON SOURCE

* headers
** main
#+Begin_SRC emacs-lisp :tangle pyel.el
  ;; This is a tangled file  -- DO NOT EDIT --  Edit in pyel.org
#+END_SRC
** transforms
#+Begin_SRC emacs-lisp :tangle pyel-transforms.el
  ;; This is a tangled file  -- DO NOT EDIT --  Edit in pyel.org
#+END_SRC
** tests
#+Begin_SRC emacs-lisp :tangle pyel-tests.el
  ;; This is a tangled file  -- DO NOT EDIT --  Edit in pyel.org
#+END_SRC
** py-lib
#+Begin_SRC emacs-lisp :tangle py-lib.el
  ;; This is a tangled file  -- DO NOT EDIT --  Edit in pyel.org
#+END_SRC
** python ast
#+Begin_SRC python :tangle py-ast.py
  # This is a tangled file  -- DO NOT EDIT --  Edit in pyel.org
#+END_SRC

* main
header
** require
#+Begin_SRC emacs-lisp :tangle pyel.el
  (add-to-list 'load-path "~/programming/pyel/")
  (add-to-list 'load-path "~/programming/code-transformer/")
  (require 'eieio)
  (require 'cl)
  ;;other requires are at the end
#+END_SRC
