pyel.el

;; This is a tangled file  -- DO NOT EDIT --  Edit in pyel.org

(add-to-list 'load-path "~/programming/pyel/")
(add-to-list 'load-path "~/programming/code-transformer/")
(require 'eieio)
(require 'cl)
;;other requires are at the end
