pyel.org
** main
#+Begin_SRC emacs-lisp :tangle pyel.el
;; This is a tangled file  -- DO NOT HAND-EDIT --
;;PYEL -> translate PYthon to Emacs Lisp
#+END_SRC

main
#+Begin_SRC emacs-lisp :tangle pyel.el
  (defun mpp (code)
    (let ((pp (pp-to-string code)))
      (insert "\n" pp)))
  
  ;;TODO: more robust checking, return type of error as well
  (defun pyel-is-error (code)
    "return the line of the error in CODE, else nil"
    (let ((line))
      (if (string-match "^Traceback" code)
          (with-temp-buffer
            (insert code)
            (goto-char (point-max))
            (if (re-search-backward "line \\([0-9]+\\)")
                (setq line (match-string 1)))))
      ;;TODO: why is this the actual line number...it should be relative the a bunch of code it's appended to ...
      (and line (string-to-number line))))
  
  (defvar pyel-transform-status nil
    "indicate status (success/fail) of last pyel transform
  status types:
  nil for no error
  ('python ast transform error'  <line number>)
  ")
  
  (defvar pyel-error-string "PYEL ERROR"
    "string returned by `pyel' when it failed to transform")
  
  (defun pyel-py-ast-file-name ()
    "return the full file name of py-ast.el"
    (file-path-concat pyel-directory "py-ast.py"))
  
  (defun pyel (python &optional no-line-and-col-nums include-defuns py-ast-only)
    "translate PYTHON into Emacs Lisp.
  PYTHON is a string.
  include line and column nums in output unless NO-LINE-AND-COL-NUMS is non-nil
  If PY-AST-ONLY, return the un-evaled ast.
  If INCLUDE-DEFUNS, include the list of pyel defined functions in the output
    this is ignored if PY-AST-ONLY is non-nil"
    (assert (eq lexical-binding nil) "pyel requires dynamic scoping")
  
    (setq pyel-marked-ast-pieces nil)
    (setq pyel-transform-status nil) ;;so far so good...
  
    (setq pyel-last-python-code python)
  
    (let* (;;Q general way of replacing backslashes?
           (python (replace-regexp-in-string "\"" "\\\\\"" python))
                                          ;(python (replace-regexp-in-string "\n" "\\\\n" python nil :literal))
  
           ;; (pyel "x = 'x\n'")
           (py-ast "")
           (el-code "")
           (current-transform-table (get-transform-table 'pyel))
           (python (with-temp-buffer
                     (insert python)
                     (pyel-preprocess-buffer2)
                     (buffer-string)))
           (pyel-context nil)
           line ret
           )
  
      ;;?? setting the mark?
      (with-temp-buffer
        ;;    (find-file file)
        ;;    (erase-buffer)
        (insert-file-contents-literally (pyel-py-ast-file-name))
        (goto-char (point-max))
        (insert "\n")
        (setq line (line-number-at-pos))
        (insert (format "print(eval(ast.dump(ast.parse(\"\"\"%s\"\"\")%s)))"
                        python
                        (if no-line-and-col-nums "" ",include_attributes=True")))
        (write-region
         nil
         nil
         pyel-tmp-file nil 'silent))
  
      (setq py-ast (shell-command-to-string (format "python3 %s" pyel-tmp-file)))
      (setq _x py-ast)
      (if (setq py-error (pyel-is-error py-ast))
          (progn
            (setq pyel-python-error-line py-error)
            pyel-error-string)
        ;;else: no error
        (if py-ast-only
            py-ast
          ;;      (pyel-do-splices (transform (read py-ast))))))
          ;;read can only return one sexp so we need to put it in a progn or something
          ;;similar
  
          (setq ret (pyel-do-splices (if include-defuns
                                         (list '@ (cons '@ pyel-function-definitions)
                                                  (transform (read (format "(@ %s)" py-ast))))
                                       (transform (read  (format "(@ %s)" py-ast))))))
          ;;TODO: this is a temp solution for convenience
          (mapc 'eval pyel-function-definitions)
          ret
          ))))
  
  (defvar pyel-last-python-code nil
    "last python string `pyel' attempted to transform")
  
  (defun pyel-buffer-to-string (&optional ast-only)
    "transform python in current buffer and return a string"
    ;;THIS DOES NOT RETURN A STRING!
    (pyel (buffer-string) ast-only))
  
  (defvar pyel-pp-function 'pp-to-string
    "function that pretty prints pyel e-lisp code")
  
  (defun pyel-buffer (&optional out-buff)
    "transform python in current buffer and display in OUT-BUFF,
  OUT-BUFF defaults to *pyel-output*"
    (interactive)
    (let ((out (pyel-buffer-to-string)))
      (switch-to-buffer-other-window "*pyel-output*")
      (erase-buffer)
      (insert (funcall 'pyel-pp-function out))
      (emacs-lisp-mode)))
  
  (defun pyel-transform-ast (ast &optional no-splice)
    "transform a python AST to Emacs Lisp, AST must be a string
  AST can be generated by `pyel' with (pyel py-string t)"
    (with-transform-table 'pyel
                          (let ((code (transform (read  (format "(@ %s)" ast)))))
                            (if no-splice
                                code
                              (pyel-do-splices code)))))
  
  (defun pyel-file-ast (file-name)
    "return the ast from .py file FILE-NAME"
    )
  
  (defmacro pyel-with-known-types (known-types &rest code)
    "translate CODE while faking the known types"
    `(flet ((pyel-get-possible-types
             (&rest args)
             (mapcar* (lambda (arg type) (cons arg type))
                      args ,known-types)))
  
       (pyel ,@code)))
  
  (defun py-ast (code &optional pp include-attributes python2)
    "Return the python abstract syntax tree for python CODE
  useing python3 unless PYTHON2 is non-nil"
    (let ((py-ast "")
          (el-code "")
          ret)
  
      (with-temp-buffer
        (insert "import ast" "\n")
        (insert (format "print(ast.dump(ast.parse(\"\"\"%s\"\"\")%s))"
                        code
                        (if include-attributes ",include_attributes=True" "")))
        (write-region nil nil pyel-tmp-file nil 'silent))
  
      (setq ret (shell-command-to-string (format "python%s %s"
                                                 (if python2 "" "3")
                                                 pyel-tmp-file)))
      (if pp
          (mapconcat 'identity (split-string ret ",") ",\n")
        ret)))
  
  ;;'(a (@ b (c)))) => (a b (c))
  ;;'(a (@ b c)))   => (a b c)
  ;;'(@ a b c) => (progn a b c)
  ;;'(@ (a b)) = > (a b)
  ;;'(a (@) b) = > (a b)
  
  (defun pyel-do-splices (code)
    (if (listp code)
        (let (c)
          (if (eq (car code) '@) ;;special case: outer most list
              (if (> (length code) 2)
                  (pyel-do-splices `(progn ,code))
                (pyel-do-splices (cadr code)))
            (let ((ncode nil))
              (while code
                (setq c (pop code))
                (cond ((and (listp c) (not (listp (cdr c)))) ;;cons cell
                       (push (cons (pyel-do-splices (car c))
                                   (pyel-do-splices (cdr c))) ncode))
                      ((listp c)
                       (if (equal (car c) '@)
                           (setq ncode (append (reverse (pyel-do-splices (cdr c)))
                                               ncode))
                         (push (pyel-do-splices c) ncode)))
                      (t (push c ncode))))
              (if (listp ncode) (reverse ncode) ncode))))
      code))
  
  (defun pyel-reload ()
    (interactive)
    (pyel-reset)
    (dolist (f '(pyel
                 pyel-tests
                 pyel-transforms
                 pyel-mode
                 pyel-pp
                 pyel-preprocessor
                 pyel-tests-generated
                 py-lib
                 transformer))
      (setq features (remove f features)))
    (require 'pyel))
  
  (defun pyel-reset()
    "reset internal variables"
    (interactive)
    (setq pyel-method-name-arg-signature (make-hash-table :test 'eq)
          pyel-function-definitions nil
          pyel-defined-functions nil
          pyel-method-transforms nil
          pyel-context nil))
  
  (defvar pyel-method-name-format-string "_%s-method%s"
    "format string for the method transform names
  It must accept two args, the name of the method
  and its arg signature")
  
  (defun pyel-method-transform-name (method-name &optional arglist)
    "Return the name of the temlate that transform the method METHOD-NAME.
      template names are modified to avoid potential conflict with other templates
    the arglist must be placed in a list before passing so that the code can
     tell if the arglist is empty or not provided. 
    ARGLIST is used to generate a name that is unique to that arglist signature"
    (assert (and (listp arglist) (listp (car arglist)))
            "Invalid arglist. Expected a list of a list")
    (let* ((signature (if arglist (pyel-arglist-signature (car arglist)) "_"))
           (name (format pyel-method-name-format-string
                         (symbol-name method-name) signature)))
      (if arglist
          (assert (equal (pyel-extract-arg-descriptor signature)
                         (pyel-arg-descriptor (car arglist)))
                  "Invalid method name"))
      (intern name)))
  
  (defun pyel-func-transform-name (func-name &optional kwarg)
    "like `pyel-method-transform-name' for functions"
    (intern (format "_%s%s-function_"
                    (if kwarg "-kwarg" "")
                    (symbol-name func-name))))
  
  (defmacro push-back (val place)
    "Add VAL to the end of the sequence stored in PLACE. Return the new
  value."
    `(setq ,place (append ,place (list ,val))))
  
  (defun pyel-translate-function-name (name new-name)
    "translate python NAME to e-lisp NEW-NAME"
    (push (list name new-name) pyel-function-name-translations))
  
  (defun pyel-translate-variable-name (name new-name)
    "translate python  NAME to e-lisp NEW-NAME"
    (push (list name new-name) pyel-variable-name-translations))
  
  (defun pyel-not-implemented (message)
    "signify that a feature is not implemented"
    ;;TODO
    (message message) ;;tmp
    )
  
  (defmacro insert-at (list nth value)
    "insert VALUE at NTH index in LIST"
    `(setq ,list (append (subseq ,list 0 ,nth)
                         (list ,value)
                         (subseq ,list  ,nth))))
  
  (defun list-to-vector (list)
    (let ((v (make-vector (length list) nil))
          (i 0))
      (while list
        (aset v i (car list))
        (setq list (cdr list)
              i (1+ i)))
      v))
  
  (defun pyel-replace-in-thing (from to thing)
    "replace character FROM to TO in THING
  THING may be a symbol, string or list"
    (cond
     ;;tmp fix:
     ;;special case for numbers to handle being called
     ;;on the arg list in the def transform
     ;;(numbers are from the default values for kwonlyargs)
     ;;TODO: call _to- only on names, not such large lists
     ((numberp thing) thing)
  
     ((stringp thing)
      (replace-regexp-in-string from to  thing))
     ((symbolp thing)
      (intern (replace-regexp-in-string from to  (symbol-name thing))))
     ((and (listp thing) (listp (cdr thing)))
      (mapcar (lambda (x) (pyel-replace-in-thing from to x)) thing))
     ((listp thing) ;;cons cell
      (cons (pyel-replace-in-thing from to (car thing))
            (pyel-replace-in-thing from to (cdr thing))))
     (t (error "invalid thing"))))
  
  
  (defun _to- (thing)
    (pyel-replace-in-thing "_" "-" thing))
  (defun -to_ (thing)
    (pyel-replace-in-thing "-" "_" thing))
  
  (defun pyel-change-ctx (form ctx)
    "change ctx of form to CTX"
    (let ((type (and (listp form) (car form))))
      (cond ((eq type 'name)
             (list (car form) (cadr form) (list 'quote ctx)))
            ;;TODO: attribute and other forms (if needed)
            (t form))))
  
  (defun pyel-make-ast (type &rest args)
    "Generate pyhon ast.
  This is used when the ast form is needed by a transform that is manually
   called from another transform"
    (flet ((assert_n_args (type expect have)
                          (assert (= expect have)
                                  (format "pyel-make-ast -- ast type '%s'expects %s args. received %s args" type expect have)))
           (correct_ctx (ctx)
                        (if (symbolp ctx)
                            (pyel-make-ast ctx)
                          ctx))
           (correct_to_string (name)
                              (if (stringp name)
                                  name
                                (if (symbolp name)
                                    (symbol-name name)
                                  (error "invalid type for 'name'")))))
  
      ;;TODO: should have seporate functions to check
      ;;      the validity of the ast instead of having
      ;;      the correction functions do it
      (case type
  
        (subscript ;;args: value slice ctx
         (assert_n_args 'subscript 3 (length args))
  
         (let ((ctx (correct_ctx (car (last args)))))
           (list 'subscript (car args) (cadr args) ctx)))
  
        (name ;;args: name ctx
         (assert_n_args 'name 2 (length args))
         (let* ((name (correct_to_string (car args)))
  
                (ctx (correct_ctx (car (last args)))))
  
           (list 'name name ctx)))
        (load
         '(quote load))
        (store
         '(quote store)))))
  
  (defmacro macrop (sym)
    (if (boundp sym)
        (list 'macrop-1 sym)
      `(macrop-1 (quote ,sym))))
  
  (defun macrop-1 (function)
    ;;this is mostly taken from `describe-function-1'
    (let* ((advised (and (symbolp function) (featurep 'advice)
                         (ad-get-advice-info function)))
           ;; If the function is advised, use the symbol that has the
           ;; real definition, if that symbol is already set up.
           (real-function
            (or (and advised
                     (let ((origname (cdr (assq 'origname advised))))
                       (and (fboundp origname) origname)))
                function))
           ;; Get the real definition.
           (def (if (symbolp real-function)
                    (symbol-function real-function)
                  function)))
      (eq (car-safe def) 'macro)))
  
  (defun callable-p (object)
    (if (symbolp object)
        (or (fboundp object)
            (functionp object)) ;;necessary?
      (functionp object)))
  
  (defun pyel-split-list (lst sym)
    "split list LST into two sub-lists at separated by SYM
    The return value is the two sub-lists consed together"
    (let ((current (not sym))
          first)
      
      (while (and (not (eq current sym))
                  lst)
        (setq current (pop lst))
        (push current first)
        )
      
      (cons (reverse (if (eq (car first) sym) (cdr first) first)) lst)))
  
  
  (defun pyel-eval-last-sexp-1-function (eval-last-sexp-arg-internal)
    "Evaluate sexp before point; print value in minibuffer.
  With argument, print output into current buffer.
  
  This function is redefined to print python objects in a
  reasonable manner. The origional definition has been stored
  in `pyel-orig-eval-last-sexp-1'"
    (let ((standard-output (if eval-last-sexp-arg-internal (current-buffer) t))
          (val (eval (eval-sexp-add-defvars (preceding-sexp)) lexical-binding)))
      ;; Setup the lexical environment if lexical-binding is enabled.
      (if (and pyel-object-prettyprint
               (fboundp 'py-object-p)
               (py-object-p val))
          (setq val (pyel-repr val)))
      (eval-last-sexp-print-value val)))
  
  (fset 'pyel-orig-eval-last-sexp-1 'eval-last-sexp-1)
  (fset 'eval-last-sexp-1 'pyel-eval-last-sexp-1-function)
  
  (defvar pyel-object-prettyprint t
    "if non-nil, objects will be printed with their pyel repr value
  during interactive emacs-lisp sessions where possible")
          
  (defun pyel-toggle-object-prettyprint ()
    (interactive)
    (setq pyel-object-prettyprint (not pyel-object-prettyprint)))
  
  (defun pyel-get-generated-function (name)
    "return the generated function/macro definition for NAME"
    (get-matching-item pyel-function-definitions
                       (lambda (x) (eq (cadr x) name))))
  
  (defun pyel-strip-leading-nil (list)
    "remove all nil items from the front of LIST until the first non-nil item"
    (while (and (not (null list))
                (not (car list)))
      (setq list (cdr list)))
    list)
  
  (defun pyel-strip-trailing-nil (list)
    "remove all nil items from the back of LIST until the last non-nil item"
    (setq list (reverse list))
    (while (and (not (null list))
                (not (car list)))
      (setq list (cdr list)))
    (reverse list))
  
  (defun filter (func list)
    (let ((newlist ()))
      (dolist (e list)
        (if (funcall func e)
            (setq newlist (cons e newlist))))
      (reverse newlist)))
#+END_SRC
