pyel.org
** variables
#+Begin_SRC emacs-lisp :tangle pyel.el
  (defvar pyel-directory ""
    "Path to pyel files. must include py-ast.py, pyel.el etc")
  
  (defmacro vfunction-p (f)
    `(and (boundp ',f)
          (functionp ,f)))
  
  (defmacro pyel-empty-list-p (list)
    `(eq ,list 'py-empty-list))
  
  (set (defvar pyel-type-test-funcs nil
         "alist of types used in pyel-call-transform for the switch-type
              and the function used to test for that type")
       '((string stringp)
         (number numberp)
         (integer integerp)
         (int integerp)
         (float floatp)
         (vector vectorp)
         (empty-list pyel-empty-list-p)
         (list listp)
         (cons consp)
         (hash hash-table-p)
         (hash-table hash-table-p)
         (symbol symbolp)
         (array arrayp)
         ;;         (object object-p)
         (class py-class-p)
         (instance py-instance-p)
         (object py-object-p)
         (function functionp)
         (func fboundp)
         (vfunction vfunction-p)
         (vfunc vfunction-p)
         (callable callable-p)))
  
  (defvar pyel-negated-function-tests nil
    "A list of automatically created negated functions from `pyel-type-test-funcs'
    stored here just for convenient inspection")
  
  ;;create negated test functions
  (let (new func fname)
    (setq pyel-negated-function-tests nil)
    (mapc (lambda (x)
            (setq name (cadr x)
                  !name (intern (concat "!" (symbol-name name)))
                  func `(defsubst ,!name (x) (not (,name x))))
            (add-to-list 'pyel-negated-function-tests func)
            (eval func)
            (push (list (intern (concat "!" (symbol-name (car x))))
                        !name)
                  new))
          pyel-type-test-funcs)
    (setq pyel-type-test-funcs (append pyel-type-test-funcs new)))
  
  (defvar pyel-defined-classes nil
    "list of call class names defined by pyel")
  
  (defvar pyel-defined-functions nil
    "list of some functions defined pyel
            used by some templates to determine if a needed function has been defined yet")
  
  (defvar pyel-function-definitions nil
    "used to store function definitions created by pyel, not the user.")
  
  (defvar pyel-replace-args nil
    "if non-nil, pyel-do-call-transform will replace the arg symbols with their
            value, used if the code is to be inlined
            TODO: the option to replace the args should probably be obsoletede")
  
  (defvar pyel-unique-obj-names nil
    "if non-nil, uniquely name object instantces")
  
  (defvar pyel-context-groups nil ;;TODO: still used?
    "groups of contexts that cannot exist at the same time.
          `context-p' will stop at the first one in the list,")
  
  (setq pyel-context-groups
        '((assign-target assign-value)))
  
  (defvar pyel-function-name-translations nil
    "alist of function name translations, python->e-lisp.
      
          Entries in `pyel-function-name-translations' are applied before
          checking for function transforms.
          If a translation len->length is defined then the function transform for
          'len' will not be detected because the name is now 'length'
          ")
  
  (defvar pyel-variable-name-translations nil
    "alist of variable name translations, python->e-lisp.")
  
  (setq pyel-function-name-translations `(
                                          
                                          ))
  ;;TODO: list, vector, etc
  ;;      map?
  
  (setq pyel-variable-name-translations '((True t)
                                          (False nil)
                                          (None nil)))
  
  (defvar pyel-method-transforms nil
    "List of names of methods for which a transform has been defined
          For internal use only--do not modify by hand"
    )
  
  (defvar pyel-func-transforms nil
    "list of function names that have transforms defined for them")
  
  (defvar pyel-func-kwarg-transforms nil
    "list of function names that have kwarg transforms defined for them")
  
  (defconst pyel-nothing '(@)
    "value to return from a function/transform when it should
          not contribute to the output code")
  
  (defconst pyel-python-version "3.2.3"
    "python interpreter version whose ast pyel is written for")
  
  (defvar test-variable-values nil
    "variables values for running tests")
  
  (setq test-variable-values
        '((pyel-defined-classes nil)
          (pyel-function-definitions nil)
          (pyel-defined-functions nil)
          (pyel-obj-counter 0)
          (pyel-unique-obj-names nil)
          (pyel-fully-functional-functions nil)
          ;;(pyel-method-transforms nil)
          ;;(pyel-func-transforms nil)
          (pyel-marker-counter 0)))
  
  (defvar pyel-marker-counter 0)
  
  (defvar pyel-tmp-file  "/tmp/pyel-ast.py"
    "Name of temp file to use for AST generation")
  
  (defvar pyel-interactive nil
    "non-nil during interactive session translation and evaluation")
#+END_SRC
** syntax output variables
variables that effect the form of the output code
#+Begin_SRC emacs-lisp :tangle pyel.el
  (defvar pyel-default--init--method
    "(defmethod --init-- ((self %s))
       \"Default initializer\"
      )"

    "default initializer for pyel objects.")

  (defvar pyel-use-list-for-varargs nil
    "Determines if *varargs will be passed to function as a list or a vector,
    non-nil for list, otherwise vector.
    To be like python (vectors), this should be nil
    To be consistent with Emacs-Lisp (lists), this should be t.
       On the python side, this means that *varargs is a list instead of a tuple")
#+End_SRC
** pyel-block
This will have to be removed after the code is generated
#+Begin_SRC emacs-lisp :tangle pyel.el
  (defmacro pyel-block (&rest code)
    `(progn ,@ code))
#+END_SRC
** context
#+Begin_SRC emacs-lisp :tangle pyel.el
  ;;TODO: this should be generalized and added to the transform code
  (defvar pyel-context nil
    "list of current expansion contexts")
  
  (defmacro using-context (context &rest code)
    `(progn
       (push ',context pyel-context)
       (let (ret)
         (condition-case err
             (setq ret (progn ,@code))
           (error (pop pyel-context)
                  (error (format "using-context: %s" err))))
         (pop pyel-context)
         ret)))
  
  (def-edebug-spec using-context (symbolp &rest form))
  
  (defmacro remove-context (context &rest code)
    "remove CONTEXT and translate CODE, then restore context"
    `(let ((pyel-context (remove ',context pyel-context)))
       ,@code))
  (def-edebug-spec remove-context (symbolp &rest form))
  
  (defmacro context-switch (&rest forms)
    `(cond ,@(mapcar (lambda (x)
                       `(,(let ((context (car x)))
                            (if (eq context t) t
                              `(member ',context pyel-context))) ,@(cdr x)))
                     forms)))
  
  (defun get-context-group (context)
    (let ((groups pyel-context-groups)
          (found nil)
          group)
      (while groups
        (setq group (car groups)
              groups (cdr groups))
        (dolist (g group)
          (when (equal g context)
            (setq found group
                  groups nil))))
      found))
  
  ;; (defun context-p (context)
  ;;   (member context pyel-context))
  (defun context-p (context)
      ;;;;TODO: the extra features that this provides is probably not being used anywere...
    (let ((group (get-context-group context))
          (cont pyel-context)
          (ret nil)
          c)
      (while cont
        (setq c (car cont)
              cont (cdr cont))
        ;;if the context is in a group only return t if it is the first one in pyel-context
        (if (member c group)
            (setq ret (equal c context)
                  cont nil)
          (when (equal c context)
            (setq ret t
                  cont nil))))
      ret))
  
  (defun context-depth (context)
    "get the depth of CONTEXT in `pyel-context'"
    ;;TODO:
    )
#+end_src
