pyel.el

;;this is all temp for testing
(setq known-types '((number object ) (number string)))

;;prevents error: "Wrong type argument: listp, string"
;;TODO: this is a bit of a mess now. types 'func' and 'function' in type
;;transforms result in different tests but func/function still kind of mean the
;;same thing when it comes to python. if func is known type, function should
;;also be know. need some kind of an alias mechanism
(setq known-types
      '((number list vector string object hash function func symbol vfunc class instance)
        (number list vector string object hash function func symbol vfunc class instance)
        (number list vector string object hash function func symbol vfunc class instance)
        (number list vector string object hash function func symbol vfunc class instance)
        (number list vector string object hash function func symbol vfunc class instance)
        (number list vector string object hash function func symbol vfunc class instance)
        (number list vector string object hash function func symbol vfunc class instance)
        (number list vector string object hash function func symbol vfunc class instance)
        (number list vector string object hash function func symbol vfunc class instance)
        (number list vector string object hash function func symbol vfunc class instance)))
(push (list 'known-types known-types) test-variable-values)

(defun pyel-get-possible-types (&rest args)
  "return a list in the form (arg types).
  The car is the argument and the cdr is a list of possible types"

  ;;FOR TESTING
  (let ((types (if (>= (length known-types) (length args))
                   known-types
                 (append known-types '(string number list vector integer float))))
        (args (filter (lambda (x) (not (or (eq x '&optional)
                                           (eq x '&rest)))) args)))

    (mapcar* (lambda (arg type) (cons arg type))
             args types)))
