pyel.org
** type dispatching transforms
#+Begin_SRC emacs-lisp :tangle pyel.el
  (defun pyel-filter-non-args(args)
    "remove '&optional' and '&rest' from ARGS list"
    (filter (lambda (x) (not (or (eq x '&optional)
                                 (eq x '&rest))))
            args))
  
  (defmacro pyel-dispatch-func (name args &rest type-switches)
    "Define a transform that creates a runtime function that
  dispatches on argument type as defined by TYPE-SWITCHES.
  The transform will have the same NAME and ARGS and must be called with a
  function like `call-transform', it will return a call to
  the function it creates.
  After the resulting transform is called, it adds the name of the
  created function in `pyel-defined-functions' and adds the function 
  definition to `pyel-function-definitions'
  
  Use `pyel-func-transform' to define transforms for functions that
  will be automatically called.
  
  NOTE: if the name of the function to be created is already in
   `pyel-defined-functions', the function will not be updated
  "
    ;;temp solution: does not check types etc
    (let* ((striped-args (mapcar 'strip_ args))
           (args-just-vars (pyel-filter-non-args striped-args))
           (rest-arg (if (eq (car (last striped-args 2)) '&rest)
                         (car (last striped-args)) nil)))
  
      `(def-transform ,name pyel ()
         (lambda ,striped-args
           (let ((fsym ',(intern (concat "pyel-" (symbol-name name) "")))
                 (body (pyel-do-call-transform (pyel-get-possible-types
                                                ,@args-just-vars)
                                               ',args
                                               ',type-switches))) 
             (unless (member fsym pyel-defined-functions)
               (push (list 'defmacro fsym ',striped-args
                           body)
                     pyel-function-definitions)
               (push fsym pyel-defined-functions)
               (fset fsym (lambda () nil)))
             (cons fsym ,(if rest-arg
                             `(append (list ,@(subseq args-just-vars 0 -1)) ,rest-arg)
                           (cons 'list args-just-vars))))))))
  
  (defmacro pyel-method-transform (name args &rest type-switches)
    "Defines a transform for methods that dispatches on NAME and ARG length.
  The syntax and the function creation is the same as with `pyel-dispatch-func'.
  These transforms are automatically called for methods during translation time.
  The transform will be dispatched on NAME and the possible number
  of arguments that ARGS allows.
  During translation time, if no transform is found for a method call that
  matches NAME and has the proper arg length then no transform will be called."
    (add-to-list 'pyel-method-transforms name)
  
    ;;temp solution: does not check types etc
    (let* ((striped-args (mapcar 'strip_ args))
           (args-just-vars (pyel-filter-non-args striped-args))
           (rest-arg (if (eq (car (last striped-args 2)) '&rest)
                         (car (last striped-args)) nil))
           (fsym (intern (format "pyel-%s-method%s"
                                 (symbol-name name)
                                 (pyel-arglist-signature args))))
           (transform-name (pyel-method-transform-name name (list args))))
  
      (pyel-add-method-name-sig name args)
      
      `(def-transform ,transform-name pyel ()
         (lambda ,striped-args
           (let ((body (pyel-do-call-transform (pyel-get-possible-types
                                                ,@args-just-vars)
                                               ',args
                                               ',type-switches))) 
  
             (unless (member ',fsym pyel-defined-functions)
               (push (list 'defmacro ',fsym ',striped-args
                           body)
                     pyel-function-definitions)
               (push ',fsym pyel-defined-functions)
               (fset ',fsym (lambda () nil)))
             (cons ',fsym ,(if rest-arg
                               `(append (list ,@(subseq args-just-vars 0 -1)) ,rest-arg)
                             (cons 'list args-just-vars))))))))
  
  (defmacro pyel-func-transform (name args &rest type-switches)
    (add-to-list 'pyel-func-transforms name)
    ;;TODO: should name be modified to avoid conflicts ?
    `(pyel-func-transform-1 ,name ,args nil ,@type-switches))
  
  (defmacro pyel-func-kwarg-transform (name args &rest type-switches)
    (add-to-list 'pyel-func-kwarg-transforms name)
    `(pyel-func-transform-1 ,name ,args t ,@type-switches))
  
  (defmacro pyel-func-transform-1 (name args is-kwarg-transform &rest type-switches)
    "Define a transform for function calls.
  This is just like `pyel-method-transform' except that the
  ARG signature has no effect on the transform dispatch"
    
    (let* ((striped-args (mapcar 'strip_ args))
           (args-just-vars (pyel-filter-non-args striped-args))
           (rest-arg (if (eq (car (last striped-args 2)) '&rest)
                         (car (last striped-args)) nil))
           (fsym (intern (concat "pyel-"
                                 (symbol-name name) "-"
                                 (if is-kwarg-transform "kwarg-" "")
                                 "function"))))
      `(def-transform ,(pyel-func-transform-name name is-kwarg-transform) pyel ()
         (lambda ,striped-args
           (let ((body (pyel-do-call-transform (pyel-get-possible-types
                                                ,@args-just-vars)
                                               ',args
                                               ',type-switches)))
             (unless (member ',fsym pyel-defined-functions)
               (push (list 'defmacro ',fsym ',striped-args
                           body)
                     pyel-function-definitions)
               (push ',fsym pyel-defined-functions)
               (fset ',fsym (lambda () nil)))
             (cons ',fsym ,(if rest-arg
                               `(append (list ,@(subseq args-just-vars 0 -1)) ,rest-arg)
                             (cons 'list args-just-vars))))))))
  
  (defvar pyel-func-transforms2 nil
    "list of functions whose translations are defined
  with the macro `pyel-define-function-translation'")
  
  (defmacro pyel-define-function-translation (name &rest body)
    "BODY will form the body of a function that is called during transform time
  to tranlate a call to NAME, variables 'args' and 'kwargs'  are available at
  this point. 'args' will be a list and 'kwargs will be an alist
  This is called at the same time `pyel-func-transform' would be called"
    (add-to-list 'pyel-func-transforms2 name)
  
    `(def-transform ,(pyel-func-transform-name name) pyel ()
       (lambda (args kwargs)
         ,@body
         )))
  
  ;;TODO: this should be more general to allow for things like subscript to use it
  
  (defmacro pyel-def-funcall (name args &rest type-switches)
    "Define how to call the function NAME.
        NAME is a function that is called differently based on its argument types.
        An attempt will be made to test the least possible number of types.
  
        This defines a transforms in the pyel transform table with NAME and ARGS"
    `(def-transform ,name pyel ()
       (lambda ,args
         (pyel-do-call-transform (pyel-get-possible-types ,@args)
                                 ',args
                                 ',type-switches))))
  
  ;;TODO: rename pyel-def-funcall -> pyel-def-type-transform
  (defmacro pyel-def-type-transform (name args &rest type-switches)
    "Define a transform NAME that produces code based on the types of ARGS
      TYPE-SWITCHES
  
      This defines a transforms in the pyel transform table with NAME and ARGS"
    `(def-transform ,name pyel ()
       (lambda ,args
         (pyel-do-call-transform (pyel-get-possible-types ,@args)
                                 ',args
                                 ',type-switches))))
  
  ;; (defmacro pyel-def-call-func (name args &rest type-switches)
  ;;   "like `pyel-def-call-template' except that it generates a macro that
  ;; is called directly, because of this NAME must be unique"
  ;;   `(defun ,name ,args
  ;;      ;;   (let (,(mapcar (lambda (arg) `(,arg ',arg)) args))
  ;;      (pyel-do-call-transform (pyel-get-possible-types ,@args)
  ;;                              ',args
  ;;                              ',type-switches)))
  
  (defun pyel-expand-type-switch (type-switch)
    "expands the types switch form to a list of cond clauses"
    (flet ((helper (arg form)
                   (let ((type (car form))
                         (varlist (cadr form))
                         mod types ret and-or)
                     (if (consp type)
                         (progn
                           ;;TODO: this can never be 'and'
                           (setq and-or (car type))
                           (dolist (tp (cdr type))
                             (push `((,arg ,tp) ,varlist) ret))
                           `(,and-or ,@(reverse ret)))
                       `((,arg ,type) ,varlist))))
           (expander (type-switch)
  
                     (let ((args (car type-switch))
                           (forms (cdr type-switch))
                           and-or ret inner tmp tests)
                       (if (consp args)
                           (progn
                             (setq and-or (car args)) ;;TODO: verify and/or
                             (if (eq and-or 'and)
                                 (dolist (form forms)
                                   (setq tests nil)
                                   (dolist (arg (cdr args))
                                     (push (car (helper arg form)) tests))
                                   (push `(and ,(reverse tests) ,(cadr form)) ret))
                               ;;else == or
                               (dolist (form forms)
                                 (dolist (arg (cdr args))
                                   (setq tmp (helper arg form))
                                   (if (equal (car tmp) 'or)
                                       (dolist (x (cdr tmp))
                                         (push x ret))
                                     (push (helper arg form) ret))))))
  
                         ;;else single arg
                         (dolist (form forms)
                           (setq tmp (helper args form))
                           (if (equal (car tmp) 'or)
                               (dolist (x (cdr tmp))
                                 (push x ret))
                             (push tmp ret))))
                       (reverse ret))))
      (let ((ret nil))
        (dolist (ts type-switch)
          (dolist (e (expander ts))
            (push e ret)))
        (reverse ret))))
  
  ;;TODO: fix bug with  `pyel-expand-type-switch-2'
  ;;      the arg pattern (x x) should not expand unless
  ;;      x is a possible type of both args
  
  (defun pyel-expand-type-switch-2 (arglist patterns)
    "has output identical to `pyel-expand-type-switch' just translates
        different syntax"
    (let ((group nil)
          (groups nil)
          (ngroups nil)
          (ret nil)
          code)
  
      ;;stage1: collect into groups
      (while patterns
        (setq p (pop patterns))
  
        (if (not (eq p '->))
            (push-back p group)
          (push-back (pop patterns) group)
          (push-back group groups)
          (setq group nil)))
  
      (dolist (g groups)
        (let* ((g (reverse g))
               (code (car g))
               (g (cdr g))
               ;;      (param-types (make-vector (length (car g)) nil))
               type)
  
          (dolist (arg-pattern (reverse g)) ;;for each arg pattern
            (setq group-patterns nil)
            (dotimes (i (length arg-pattern)) ;;for each type or '_
              (setq type (nth i arg-pattern))
              (if  (not (eq type '_))
                  (push `((,(nth i arglist) ,type) ,code) group-patterns)))
            (if (null group-patterns) ;;all types where _
                (setq ret (append ret (list (list t code))))
              (if (= (length group-patterns) 1)
                  (setq ret (append ret (reverse group-patterns)))
                (setq ret (append ret (list (cons 'and
                                                  (list (mapcar 'car
                                                                (reverse group-patterns))
                                                        code))))))))))
      ret))
  
  (defun pyel-remove-nil (list)
    "remove all nil items from LIST"
    (let ((new nil))
      (dolist (e list)
        (when e
          (setq new (cons e new))))
      (reverse new)))
  
  (defun pyel-do-call-transform (possible~types args type-switch)
    "This is responsible for  producing a call to NAME in the most
        efficient way possible with the known types"
  
    ;; the args of the type transform are evaled here so there must
    ;; be no conflicts with the naming of internal variables
    ;; To avoid such conflicts, the let bound variables are all
    ;; defined with a tilde
  
    (let* ((possible~types (let (ret arg)
                             ;;get entries in form (arg . type)
                             (dolist (p-t possible~types)
                               (setq arg (car p-t))
                               (dolist (type (cdr p-t))
                                 (push (cons arg type) ret)))
                             ret))
  
           (args~just~vars (pyel-filter-non-args (mapcar 'strip_ args)))
           (new~args (loop for a in args
                           collect (if (or (eq a '&optional)
                                           (eq a '&rest)
                                           (string-match-p "\\(^_\\)\\(.+\\)"
                                                           (symbol-name a))) nil
                                     (intern (format "__%s__" (symbol-name a))))))
           (arg~replacements4 (let (ar)
                                (mapcar (lambda (x) (if (string-match-p "\\(^_\\)\\(.+\\)"
                                                                        (symbol-name x))
                                                        (push (list (strip_ x) (list '\, (strip_ x))) ar)))
  
                                        args)
                                ar))
           ;;list of symbols to replace
           ;;format: (symbol replace)
           (let~vars (let (lv) (mapcar* (lambda (a b) (if b
                                                          (push (list a b) lv)))
                                        args new~args)
                          lv))
           ;;strip any leading underscores
           (args~ (mapcar (lambda (a)
                            (if (string-match "\\(^_\\)\\(.+\\)" (symbol-name a))
                                (intern (match-string 2 (symbol-name a))) a))
                          args))
  
           ;;the __x__ type replacements interfere with the (\, x) type replacements
           ;;so they must be seporated and done one at a time
           (arg~replacements1 let~vars)
           (arg~replacements2 (mapcar (lambda (x)
                                        (list  (intern (format "$%s" x)) (list '\, x)))
                                      args~just~vars))
           (arg~replacements3 (mapcar (lambda (x)
                                        (list (intern (format "$$%s" x)) (list 'quote (list '\, x))))
                                      args~just~vars))
           (arg~replacements (append arg~replacements1 arg~replacements2))
  
           (arg~quote~replacements (mapcar (lambda (x)
                                             (list x (list '\, x)))
                                           args~just~vars))
           (current~replace~list nil)
           ;; (arg~replacements (append let~vars
           ;;                           (mapcar (lambda (x)
           ;;                                     (list  (intern (format "$%s" x)) (list '\, x)))
           ;;                                   args~)))
  
           (c~ 0)
           valid~ ;;list of valid arg--types
           found~ all~good len~)
  
      ;;collect all the arg-type--code pairs that are valid possibilities,
      ;;that is, members of possible~types.
      ;;This essentially throws out all the arg types that have been ruled out.
      (dolist (t~s (pyel-expand-type-switch-2 args~just~vars type-switch))
        (if (equal (car t~s) 'and)
            (progn (setq all~good t
                         found~ nil)
                   (dolist  (~x (cadr t~s)) ;;for each 'and' member type-switch
                     (dolist (pos~type possible~types) ;;for each arg type
                       (if (and (equal (eval (car ~x)) (car pos~type))
                                (equal (cadr ~x) (cdr pos~type)))
                           (setq found~ t)))
                     (setq all~good (if (and all~good found~) t nil)))
                   (when all~good
                     (push t~s valid~)))
          ;;else
          (if (eq (car t~s) t) ;;when all types are _
              (push t~s valid~)
            ;;otherwise check if the type is one of the valid types
  
            (dolist(pos~type possible~types)
              (when (and (equal (eval (caar t~s)) (car pos~type))
                         (equal (strip$ (cadar t~s)) (cdr pos~type)))
                (push t~s valid~))))));;TODO: break if found?
  
      ;;generate code to call NAME
      ;;if there is 2 posible types, use IF. For more use COND
      (setq len~ (length valid~))
  
      (flet ((replace (code replacements)
                      (let ((ret nil)
                            found)
  
                        (dolist (c code)
                          (setq found nil)
                          (dolist (r replacements)
                            (if (consp c)
                                (setq c (replace c replacements))
                              (if (and (equal c (car r))
                                       (not found))
                                  (progn (push (cadr r) ret)
                                         (setq found t)))))
                          (unless found
                            (push c ret)))
                        (reverse ret)))
  
             (type-tester (x) (cadr (assoc x pyel-type-test-funcs)))
             (and-type-tester (x) (cadr (assoc (car x) pyel-type-test-funcs)))
             (get-replacement (arg) ;;returns arg replacement
                              (cadr (assoc arg current~replace~list)))
             ;;bug fix maybe...
             (get-replacement-OLD (arg) ;;returns arg replacement
                                  (or (cadr (assoc arg arg~replacements))
                                      (cadr (assoc arg arg~replacements4))))
             ;;replaces the vars, one type at a time
             (replace-vars (code)
                           (let* ((current-replace-list arg~replacements1)
                                  (code (replace code arg~replacements1))
                                  (current-replace-list arg~replacements2)
                                  (code (replace code arg~replacements2))
                                  (current-replace-list arg~replacements3))
                             (replace code arg~replacements3)))
             (gen-cond-clause (t-s--c) ;;Type-Switch--Code
                              (if (equal (car t-s--c) 'and)
                                  (progn `((and ,@(mapcar '(lambda (x)
                                                             ;;TODO: test
                                                             `(,(type-tester (cadr x))
                                                               ,(get-replacement-OLD
                                                                 (car x))))
                                                          (cadr t-s--c)))
                                           ,(replace-vars (caddr t-s--c))))
  
                                ;;TODO
                                (progn (if (equal (car t-s--c) t) ;;all types where _
                                           `(t ,(replace-vars (cadr t-s--c)))
                                         (let* ((str (symbol-name (cadar t-s--c)))
                                                (quote-arg-p (string-match-p "\\(^\\$\\)\\(.+\\)"
                                                                             str))
                                                (type (if quote-arg-p (intern (match-string 2 str)) (cadar t-s--c)))
                                                (tester (type-tester type))
                                                (body (replace-vars (cadr t-s--c)))
                                                (arg (get-replacement-OLD (caar t-s--c))))
                                           `((,tester ,(if quote-arg-p (list 'quote (list '\, (caar t-s--c))) arg))
                                             ,body))))))
             (gen-varlist ()
                          (mapcar (lambda (x) `(,(cadr x) ,(list '\, (car x))))
                                  let~vars)))
  
        (cond ((<= len~ 0) "ERROR: no valid type")
              ((= len~ 1)
               (if (eq (caar valid~) 'and)
                   (caddar valid~)
                 ;;there is only one possibility, so replace the args with their quoted counterpart
                 ;;instead of replacing with the let bound vars
                 (list 'backquote (replace (cadar valid~) arg~quote~replacements))))
              ;;?TODO: are there possible problems with evaluating the arguments
              ;;       multiple times? Maybe they should be put in a list
              (t (let* ((clauses (mapcar 'gen-cond-clause valid~))
                        (clauses (if (eq (caar clauses) t)
                                     clauses
                                   (cons
                                    '(t (error "invalid type, expected <TODO>"))
                                    clauses)))
                        (varlist (gen-varlist)))
                   `(backquote ,(if varlist
                                    `(let ,varlist
                                       (cond ,@(reverse clauses)))
                                  `(cond ,@(reverse clauses))))))))))
  
  (defun call-transform (template-name &rest args)
    "expand TEMPLATE-NAME with ARGS in the same way that `transform' would
  if was called as (transform '(template-name args))
  NOTE: this calls `transform' on all ARGS, but not TEMPLATE-NAME"
    (eval `(transform '(,template-name ,@(mapcar 'transform args)))))
  
  (defun strip$ (sym)
    (let ((str (symbol-name sym)))
      (if (string-match "\\(^\\$\\)\\(.+\\)" str)
          (intern (match-string 2 str))
        sym)))
  (defun strip_ (sym)
    (let ((str (symbol-name sym)))
      (if (string-match "\\(^_\\)\\(.+\\)" str)
          (intern (match-string 2 str))
        sym)))
  
  (defun pyel-arg-descriptor (arglist)
    "return the number of values that may be passed to ARGLIST
  If ARGLIST contains &optional or &rest then return a cons of
  the min and max values that may be passed.
  
  This does not check if ARGLIST has a valid form"
  
    (let ((min 0)
          (max 0)
          optional)
      (when arglist
        (if (member '&rest arglist)
            (setq max 'I
                  arglist (subseq arglist 0 -2)))
        (if (member '&optional arglist)
            (setq optional (pyel-split-list arglist '&optional)
                  min (length (car optional)) ;;positional args
                  max (if (eq max 'I) max
                        (+ min (length (cdr optional))))) ;;optional args
          (setq min (length arglist)
                max (if (eq max 'I)
                        max
                      min))))
      (if (or (equal min max)
              (and (= min 0)
                   (eq max 'I)))
          max
        (cons min max))))
  
  (defun pyel-arglist-signature (arglist)
    (let ((num (pyel-arg-descriptor arglist)))
      (format "->%s<-" (if (or (numberp num)
                               (eq num 'I))
                           num
                         (format "%s~%s" (car num) (cdr num))))))
  
  (defun pyel-extract-arg-descriptor (name)
    "extract the arglist descriptor from name"
  
    (assert (stringp name) "Name must be a string")
    (if (symbolp name) (setq name (symbol-name name)))
    (let (min max I?)
      (cond ((string-match "->\\([0-9I]+\\)<-" name)
             (setq min (match-string 1 name)
                   max min))
  
            ((string-match "->\\([0-9]+\\)~\\([0-9I]+\\)<-" name)
             (setq min (match-string 1 name)
                   max (match-string 2 name))))
  
      (if min
          (setq I? (intern max)
                max (if (eq I? 'I) 'I (string-to-number max))
                min (string-to-number min)))
  
      (cond ((null min) nil)
            ((or (equal min max)
                 (and (= min 0)
                      (eq max 'I)))
             max)
            (t (cons min max)))))
  
  (defun pyel-arg-descriptor-to-signature (descriptor)
    (format "->%s<-" (if (or (numberp descriptor)
                             (eq descriptor 'I))
                         descriptor
                       (format "%s~%s" (car descriptor) (cdr descriptor)))))
  
  (defvar pyel-method-name-arg-signature (make-hash-table :test 'eq)
    "mapping of method transform names to a list of argument signatures")
  
  (defun pyel-add-method-name-sig (name args)
    "Add the argument signature of ARGS to NAME in `pyel-method-name-arg-signature'"
    (let* ((signatures (gethash name pyel-method-name-arg-signature)))
      (add-to-list 'signatures (pyel-arg-descriptor args))
      (puthash name signatures pyel-method-name-arg-signature)))
  
  (defun pyel-find-method-transform-name (name num-args)
    "find a matching method transform for NAME with NUM-ARGS
  will return the name of the first match"
    (let ((signatures (gethash name pyel-method-name-arg-signature))
          found min max)
      (if signatures
          (progn (while signatures
                   (setq sig (car signatures)
                         signatures (cdr signatures))
  
                   (if (or (and (numberp sig)
                                (= sig num-args))
  
                           (eq sig 'I)
  
                           (and (consp sig)
                                (setq min (car sig)
                                      max (cdr sig))
                                (and (>= num-args min)
                                     (or (<= num-args max)
                                         (eq max 'I)))))
                       (setq signatures nil
                             found sig)))
                 (if found
                     (intern (format pyel-method-name-format-string
                                     name
                                     (pyel-arg-descriptor-to-signature found)))))
        (error "method transform %s does not exist in the signature table"
               name))))
  
  
#+END_SRC
