pyel.org
*** example usage
(pyel-def-call-func pyel+ (lhs rhs)
		    ((or lsh rhs)
		     (string (concat lhs rhs))
		     (number (+ lhs rhs))
		     (list (append lhs rhs)
			   (vector (ldk lhs rhs)))))


(setq known-types '((string list) (number vector)))

(pyel+ 'a 'b)
==>  (cond
      ((listp a)
       (append a b))
      ((numberp b)
       (+ a b))
      ((stringp a)
       (concat a b))
      (t
       (error "invalid type, expected <TODO>")))


TODO: describe alternative syntax
==> look at the bin-op heading for examples
(pyel-def-funcall * (l r)
                    (number number) ->  (* l r)
                    (object _)
                    (_ object)  -> (--mul-- l r)
                    (_ string)
                    (string _)  -> (pyel-mul-num-str l r))

*** tests
auto generated tests
#+Begin_SRC emacs-lisp :tangle pyel-tests.el
;
#+END_SRC
hand written
#+Begin_SRC emacs-lisp :tangle pyel-tests.el
  (ert-deftest pyel-test-expand-type-switch ()
    (should (equal (pyel-expand-type-switch-2 '(l r)
                                              '((number number) ->  (* l r)
                                                (object _)
                                                (_ object)  -> (--mul-- l r)
                                                (_ string)
                                                (string _)  -> (pyel-mul-num-str l r)))
                   '((and ((l number) (r number)) (* l r)) ((l object) (--mul-- l r)) ((r object) (--mul-- l r)) ((r string) (pyel-mul-num-str l r)) ((l string) (pyel-mul-num-str l r))))))
#+END_SRC

** translation messages
#+Begin_SRC emacs-lisp :tangle pyel.el
(defvar pyel-translation-messages nil
  "collects messages during pyel translations")

(defvar pyel-message-formats '((error "ERROR: %s")
			       (warn "WARNING: %s")
			       (recommend "RECOMMENDATION: %s"))
  "alist of message type and their format strings")

(defun pyel-notify (type msg)
  "add MSG to `pyel-translation-messages', TYPE specifies the format string
in `pyel-message-formats'"
  (push (format (or (cadr (assoc type pyel-message-formats))
		    (format "[%s]: %%s" (upcase (symbol-name type))))
		msg) pyel-translation-messages))

#+END_SRC
** line/column numbers
#+Begin_SRC emacs-lisp :tangle pyel.el
  (defun pyel-skip-whitespace ()
    (skip-chars-forward " \t\n\r"))
  
  (defun char-at-point ()
    (buffer-substring-no-properties (point) (1+ (point))))
  
  (defun read-tree-positions ()
    "Create a tree of buffer positions corresponding to the source tree at the point
  format [start end list-of-sub-trees] list-of-sub-trees is nil for leaves"
    (pyel-skip-whitespace)
    (let ((start (point))
          inner)
      (goto-char (1+ start))
      (setq inner (read-list-positions)) ;;asssumes we start on a list
      (vector start (point) inner)))
  
  (defun read-list-positions ()
    (let (start end elems)
      (condition-case nil
          (while t
            (pyel-skip-whitespace)
            (setq start (point))
            (if (string= (char-at-point) "(")
                (push (get-tree-positions) elems)
              (setq end (scan-sexps start 1))
              (push (vector start end nil) elems)
              (goto-char end)))
        (scan-error (goto-char (1+ start))))
      (reverse elems)))
#+END_SRC
** tests
#+Begin_SRC emacs-lisp :tangle pyel-tests.el
  (ert-deftest pyel-test-do-splices ()
    (should (equal (pyel-do-splices '(a (@ b (c)))) '(a b (c))))
    (should (equal (pyel-do-splices '(a (@ b c)))  '(a b c)))
    (should (equal (pyel-do-splices '(a (@ b (c (@ 2 (n (x 1 (@ 2))) 3 (@ 3) (@ a b (2)))))))
                   '(a b (c 2 (n (x 1 2)) 3 3 a b (2)))))
  
    (should (equal (pyel-do-splices '(@ (a b (@ d (e 2 (@ a b c ))))))
                   '(a b d (e 2 a b c))))
  
    (should (equal (pyel-do-splices '(@ (a b (@ d (e 2 (@ a b c )))) last))
                   '(progn (a b d (e 2 a b c)) last)))
  
    (should (equal (pyel-do-splices '(@)) nil))
    )
#+END_SRC

* python preprocessor
The preprocessor is no longer tangled

(lambda (a b) (print a))
lambda((a,b)
       print(a))

(cond ((> a b) (print a))
      (t (print b)))
cond([a > b, print(a)]
     [true, print(b)])

(py-ast "lambda([a,b],
print(a)) " t)

preprocessor expand separately
  scan for regex
  copy form to seporate file and expand to pyel-ast
    store in hash table with unique ID
  in py-ast replace with variable that matches some regex and contains that id
  in pyel expanstion match names, when match found, transform ast from hash table

* transform
#+Begin_SRC emacs-lisp :tangle pyel-transforms.el
(make-transform-table 'pyel)
#+END_SRC
** tests
* python ast
This is for all non template specific code.
#+Begin_SRC python :tangle py-ast.py
  import ast
  
  #TODO: use *args
  
  def l_str(x):
      return "(" + " ".join(map(str,x)) + ")"
  
  def ll_str(x):
      if x == []:
          return "nil"
      elif type(x) == str:
          return x
      return "(" + " ".join(map(str,x)) + ")"
  #    return " ".join(map(str,x))
  #    return "(list " + " ".join(map(str,x)) + ")"
  # commented out for 'assign'. cause problems elsewhere?
  
  def untuple(x):
      return ll_str(x)
      if x == []:
          return "nil"
      elif type(x) == str:
          return x
  
  def Module(body):
      return "\n".join(body)
  
  def keyword(arg, value, lineno='nil', col_offset='nil'):
      return l_str(["(keyword ", arg, " ", value, lineno, col_offset, ")"])

  def Param():
      return "'param"
  
  def Load():
      return "'load"
  
  def Store():
      return "'store"
  
  def Expr(value, lineno='nil', col_offset='nil'): #?
      return value
  
  def Import(names, lineno=None, col_offset='None'):
      return l_str(["import ",ll_str(names), lineno, col_offset])
  
  def alias(name, asname):
      if asname: asname = "\"" + asname + "\""
      return l_str(["alias ", "\"" + name + "\"", asname or "nil"])
  
  def ImportFrom(module, names, level, lineno=None, col_offset='None'):
      return l_str(["import-from ","\"" + module + "\"", ll_str(names), level, lineno, col_offset])
#+END_SRC

* ---------------------
* ast transforms
** assign
