pyel.el

(defvar pyel-translation-messages nil
  "collects messages during pyel translations")

(defvar pyel-message-formats '((error "ERROR: %s")
                               (warn "WARNING: %s")
                               (recommend "RECOMMENDATION: %s"))
  "alist of message type and their format strings")

(defun pyel-notify (type msg)
  "add MSG to `pyel-translation-messages', TYPE specifies the format string
in `pyel-message-formats'"
  (push (format (or (cadr (assoc type pyel-message-formats))
                    (format "[%s]: %%s" (upcase (symbol-name type))))
                msg) pyel-translation-messages))

(defun pyel-skip-whitespace ()
  (skip-chars-forward " \t\n\r"))

(defun char-at-point ()
  (buffer-substring-no-properties (point) (1+ (point))))

(defun read-tree-positions ()
  "Create a tree of buffer positions corresponding to the source tree at the point
format [start end list-of-sub-trees] list-of-sub-trees is nil for leaves"
  (pyel-skip-whitespace)
  (let ((start (point))
        inner)
    (goto-char (1+ start))
    (setq inner (read-list-positions)) ;;asssumes we start on a list
    (vector start (point) inner)))

(defun read-list-positions ()
  (let (start end elems)
    (condition-case nil
        (while t
          (pyel-skip-whitespace)
          (setq start (point))
          (if (string= (char-at-point) "(")
              (push (get-tree-positions) elems)
            (setq end (scan-sexps start 1))
            (push (vector start end nil) elems)
            (goto-char end)))
      (scan-error (goto-char (1+ start))))
    (reverse elems)))
