pyel.org
*** transform
#+Begin_SRC emacs-lisp :tangle pyel-transforms.el
  ;; should not fset functions because the effect takes place globally
  ;; even when the name being set is let bound.
  (pyel-dispatch-func set (_sym _val)
                      (_ $function) -> (setq $sym $$val)
                      (_ _) -> (setq $sym $val)) ;;TODO: other?
  
  (def-transform assign pyel ()
    (lambda (targ val &optional line col) (py-assign targ val line col)))
  
  ;;TODO: put all setq's in a single form: (setq a 1 b 2) etc
  
  (defun py-assign (targets values &optional line col)
  
    (let ((wrap-values t)
          unpack i)
      ;;make sure targets and lists are both in a list form
      ;;the 'unpack' flag is needed because it leaves no difference
      ;;between a,b=c and a=b=c
      (if (and (listp (car targets))
               (eq (caar targets) 'tuple))
          (progn
  
            (if (eq (car values) 'tuple)
                (progn
  
                  (setq values (cadr values))
                  (setq wrap-values nil))
              (setq unpack t) ;;targets is a tuple and values is not
              ;;(setq values (list values))
              )
  
            (setq targets (cadar targets)))
        )
  
      (when wrap-values
        (setq values (list values)))
  
  
      ;;py-sssign2 does the main transforms
      ;;TODO: check for the special case a,b=b,a and create temp variables
      ;;TODO: check that legnth of the lists are the same
  
      ;;TODO:
      (cond (unpack
             ;;TODO: pyel error unless: (and (> (length targets) 1)  (= (length values) 1)
  
             (let ((code '(@)))
               `(let ((__value__ ,(transform (car values))))
  
                  ,(dotimes (i (length targets) (reverse code))
                   ;;;TODO: will have to help the transform know what type __value__ is
                     (push (py-assign2 (nth i targets)
  
                                       (pyel-make-ast 'subscript '__value__ i 'load))
                           code))
                  )))
  
            ((= (length targets) 1)
             ;;form: a=b
             (py-assign2 (car targets)
                         (car values))) ;;if this is the second call of a "a,b = c" type form, then the ctx of values will be store instead of load which leads to an error
  
            ;;form: a = b = c
            ((and (> (length targets) 1) (= (length values) 1))
             ;; (list '@ (py-assign2 (car (last targets)) (car values))
             ;;          (py-assign  (butlast targets)
             ;;                      (pyel-change-ctx (car (last targets)) 'load))))
             (let ((out (py-assign2 (car (last targets)) (car values))))
               (setq values (car (last targets))
                     targets (butlast targets))
               (while targets
                 (setq out (py-assign2 (car (last targets)) out)
                       targets (butlast targets)))
               out))
  
  
            ;;form: a,b = x,y
            (t (let* ((tmp-vars (loop for i from 1 to (length targets)
                                      collect (intern (format "__%s__" i))))
                      (let-vars (mapcar* (lambda (a b)
                                           (list a (transform b)))
                                         tmp-vars values)))
                 `(let ,let-vars
                    ,(cons '@ (mapcar* 'py-assign2 targets tmp-vars))))))))
  
  ;;DOC: tranforms must be carefull not to transform code multiple times
  
  (defun py-assign2 (target value)
    ;;access line and col values from `py-assign' calling env.
    (let ((ctx (eval (car (last target))))
  
          (assign-value value))
  
      ;;the target code is responsible for providing the correct assign function
      ;;
  
      ;;TODO:     is context-value still used?
      ;; (using-context assign-target
      ;;             (setq t-target (transform target)))
      ;; (using-context assign-value
      ;;             (setq t-value (transform value)))
  
      ;;The target transform is responsible for generating the code
      ;;The value being assigned to the target is available to the
      ;;target transform via the variable assign-value.
      ;;assign-value is untransformed, the target transform must tranform it
  
      ;; (using-context assign-value
      ;;             (setq assign-value (transform value)))
      ;;problem: code was being transformed multiple times
      (setq assign-value value)
      (using-context assign-target
                     (transform target))
      ;;    (list assign-func t-target t-value)
  
      ))
#+END_SRC
*** python ast
#+Begin_SRC python :tangle py-ast.py
  def Assign(targets, value, lineno='nil', col_offset='nil'):
      #    print("targets: ", targets)
      return l_str(["assign ", untuple(targets), value, lineno, col_offset])
#+END_SRC
*** tests
#+Begin_SRC emacs-lisp :tangle pyel-tests.el
  (pyel-create-tests
   assign
   ("a = 1" ("a" 1))
   ("class a: pass
  a.b = 1" ("a.b" 1))
   "a.b = c"
   "a.b.c = 1"
   "a.b = d.c"
   ("a,b = 1,2"
    ("a" 1)
    ("b" 2))
   ("x = [1,0,9]
  f = lambda: 3
  class C: pass
  C.a = 3
  a, C.v, x[2] = C.a,1.1, x[x[1]]"
    ("a" 3)
    ("C.v" 1.1)
    ("x[2]" 1))
  
   ("a = 1
  b = 2
  a,b= b,a"
    ("a" 2)
    ("b" 1))
   ("a = [1,2]
  b = (3,4)
  x,y = a
  xx,yy = b"
    ("x" 1)
    ("y" 2)
    ("xx" 3)
    ("yy" 3))
   ("class C:
   a = [11,22,33]
  x,y,z = C.a"
    ("x" 11)
    ("y" 22)
    ("z" 33))
   ("a = 1
  b = 2
  c = 3
  d = a,b,c"
    ("d" [1 2 3]))
  
   "a,b = a.e.e()"
  
   "a[1:4], b[2], a.c = c"
  
   "a = b = c"
   "a = b = c.e"
   "a = b = c.e()"
   ("class x:
   a = 1
  xx = x()
  l = [1,2,3]
  a = xx.a = l[1] = b = c = 9
  z = l[2] = xx.a"
    ("a" 9)
    ("b" 9)
    ("c" 9)
    ("xx.a" 9)
    ("l[1]" 9)
    ("z" 9)
    ("l[2]" 9))
    )
#+END_SRC
** attribute
*** transform
#+Begin_SRC emacs-lisp :tangle pyel-transforms.el
  (def-transform attribute pyel ()
    (lambda (value attr ctx &optional line col)
      (pyel-attribute value attr ctx line col)))
  
  (defun pyel-attribute (value attr ctx &optional line col)
    (setq ctx (cond ((context-p 'force-load) 'load)
                    ((context-p 'force-store) 'store)
                    (t (eval ctx))))
    (let ((t-value (transform value))
          (attr (read (_to- (transform attr)))))
  
      ;;create slot for this attribute if it does not already exist
      (when (and (context-p 'method-def)
                 (not (assoc attr class-def-slots)))
        (push `(,attr :initarg ,(intern (concat ":"
                                                (symbol-name attr)))
                      :initform nil)
  
              class-def-slots))
      (if (and (context-p 'method-call)
               (not (context-p 'method-call-override)))
          (using-context method-call-override
                         ;;ctx?
                         `(@ call-method ,(transform value) ,attr))
  
        ;; (if (context-p 'assign-target)
        ;;          (setq assign-func 'oset))
  
        ;;check the presumption:
        (when (and (eq ctx 'store)
                   (not (context-p 'assign-target))
                   nil);;for this to work, this function need to set context as well
          (error "`pyel-attribute': Presumption failed: ctx==store but not in assign context"))
        (when (and (eq ctx 'store)
                   (not (boundp 'assign-value)))
          (error "`pyel-attribute': Presumption failed: ctx==store but assign-value is unbound"))
  
        (cond
         ((eq ctx 'store)
          ;;(list 'oset t-value attr (transform assign-value)) ;;assign target
          (list 'setattr t-value attr (transform assign-value)))
         ((eq ctx 'load) ;;assign value
          ;;(list 'oref t-value attr)
          (list 'getattr t-value attr))
         (t "Error in attribute-- invalid ctx"))
        )))
#+END_SRC
*** python ast
#+Begin_SRC python :tangle py-ast.py
  def Attribute(value, attr, ctx, lineno='nil', col_offset='nil'):
      return l_str(["attribute ", value, "\"" + attr + "\"", ctx, lineno, col_offset])
#+END_SRC

*** tests
#+Begin_SRC emacs-lisp :tangle pyel-tests.el
  (pyel-create-tests attribute
                     "a.b"
                     "a.b.c"
                     "a.b.c.e"
                     "a.b()"
                     "a.b.c()"
                     "a.b.c.d()"
                     "a.b.c.d(1,3)"
                     "a.b = 2"
                     "a.b.e = 2"
                     "a.b.c = d.e"
                     "a.b.c = d.e.f"
                     "a.b.c = d.e()"
                     "a.b.c = d.e.f()"
                     "a.b.c = d.e.f(1,3)"
                     "a.b, a.b.c = d.e.f(1,3), e.g.b"
                     "a.b(x.y,y)"
                     "a.b(x.y(g.g()),y.y)")
  
#+END_SRC
** num
