pyel-tests.el

(pyel-create-tests attribute
                   "a.b"
                   "a.b.c"
                   "a.b.c.e"
                   "a.b()"
                   "a.b.c()"
                   "a.b.c.d()"
                   "a.b.c.d(1,3)"
                   "a.b = 2"
                   "a.b.e = 2"
                   "a.b.c = d.e"
                   "a.b.c = d.e.f"
                   "a.b.c = d.e()"
                   "a.b.c = d.e.f()"
                   "a.b.c = d.e.f(1,3)"
                   "a.b, a.b.c = d.e.f(1,3), e.g.b"
                   "a.b(x.y,y)"
                   "a.b(x.y(g.g()),y.y)")

(pyel-create-tests
 num
 ("3" 3)
 ("4.23" 4.23)
 ("3e2" 300.0))
