pyel.org
*** transform
#+Begin_SRC emacs-lisp :tangle pyel-transforms.el
  (def-transform num pyel ()
    (lambda (n &optional line col)
      n 
      ))
#+END_SRC
*** python ast
#+Begin_SRC python :tangle py-ast.py
  def Num(n, lineno='nil', col_offset='nil'):
      return "(num " + str(n) +" " + str(lineno) + " " + str(col_offset) + ")"
#+END_SRC
*** tests
#+Begin_SRC emacs-lisp :tangle pyel-tests.el
  (pyel-create-tests
   num
   ("3" 3)
   ("4.23" 4.23)
   ("3e2" 300.0))
#+END_SRC
** name
*** transform
#+Begin_SRC emacs-lisp :tangle pyel-transforms.el
  (def-transform name pyel ()
    (lambda (id ctx &optional line col)
      (pyel-name id ctx line col)))
  
  (defun pyel-name (id ctx &optional line col)
    (let ((new-id)
          (id (read id))
          piece code)
  
      ;;TODO: id should be string. verify?
      (setq ctx (cond ((context-p 'force-load) 'load)
                      ((context-p 'force-store) 'store)
                      (t (eval ctx))))
  
  
      (if (assoc id pyel-marked-ast-pieces)
          ;;this id is a marker, insert the corresponding macro
          (progn
            (setq piece (assoc id pyel-marked-ast-pieces))
            ;;'piece' has form: (marker macro-name macro-body)
            (using-context macro-call
                           (list (second piece)
                                 (pyel-transform-ast (third piece) :nosplice))))
  
        ;;else: normal name
        (setq id (_to- id))
        (when (and (context-p 'assign-value) ;;checking assumption
                   (not (equal ctx 'load)))
          (error (format "In transform name: context is 'assign-value' but ctx is not 'load'.
            ctx = %s" ctx)))
  
        (when (and (not (context-p 'function-call))
                   (setq new-id (assoc id pyel-variable-name-translations)))
          (setq id (cadr new-id)))
  
        (when (and (eq ctx 'store)
                   (context-p 'function-def)
                   (context-p 'assign-target))
          (add-to-list 'let-arglist id))
  
        (cond
         ((eq ctx 'load) id)
         ((eq ctx 'store)  (if (context-p 'for-loop-target)
                               id
                             (call-transform 'set id assign-value)))
         (t  "<ERROR: name>"))
        )))
#+END_SRC
*** python ast
#+Begin_SRC python :tangle py-ast.py
  def Name(id, ctx, lineno='nil', col_offset='nil'):
      return l_str(["name ", "\"" + id + "\"", ctx, lineno, col_offset])
#+END_SRC
*** tests
#+Begin_SRC emacs-lisp :tangle pyel-tests.el
  (ert-deftest pyel-test-name ()
   (should (eq (pyel "testName") 'testName)))
#+END_SRC
** list
*** transform
#+Begin_SRC emacs-lisp :tangle pyel-transforms.el
  (def-transform list pyel ()
    (lambda (elts ctx &optional line col)
      (pyel-list elts ctx line col)))
  
  (defun pyel-list (elts ctx &optional line col)  ;;IGNORING CTX
    (if (context-p 'macro-call)
        (mapcar 'transform elts)
      (cons 'list (mapcar 'transform elts))))
#+END_SRC
*** python ast
#+Begin_SRC python :tangle py-ast.py
  def List(elts, ctx, lineno='nil', col_offset='nil'):
      return "(list " + ll_str(elts) + " " + ctx + " " + str(lineno) + " " +str(col_offset) +")"
#+END_SRC
*** tests
#+Begin_SRC emacs-lisp :tangle pyel-tests.el
  (pyel-create-tests
   list
   ("[]" nil)
   ("['a',1,2]" '("a" 1 2))
   ("a = [1,2,'b']
  b = [1,[1,'3',a,[],3]]"
    ("a" '(1 2 "b"))
    ("b" '(1 (1 "3" (1 2 "b") nil 3))))
   ("[[[1]]]" '(((1)))))
#+END_SRC
** dict
*** transform
#+Begin_SRC emacs-lisp :tangle pyel-transforms.el
  (defvar pyel-dict-test 'equal "Test function for dictionaries")
  
  (def-transform dict pyel ()
    (lambda (keys values &optional line col)
      (pyel-dict keys values line col)))
  
  (defun pyel-dict (keys values line col) ;;TODO: move to lambda in template and create template vars
    (cons 'py-dict (mapcar* (lambda (key value)
                              (list key value))
                            (mapcar 'transform  keys)
                            (mapcar 'transform  values))))
  
#+END_SRC
*** python ast
#+Begin_SRC python :tangle py-ast.py
  def Dict(keys, values, lineno='nil', col_offset='nil'):
      return "(dict " + ll_str(keys) + " " + ll_str(values) + " " + str(lineno) + " " + str(col_offset) + ")"
#+END_SRC
*** python el lib
#+Begin_SRC emacs-lisp :tangle py-lib.el
  (defmacro py-dict (&rest pairs)
    (if pairs
        `(let ((__h__ (make-hash-table :test ',pyel-dict-test))) ;;default length??
           ,@(mapcar (lambda (pair)
                       `(puthash ,(car pair) ,(cadr pair) __h__))
                     pairs)
           __h__)
      `(make-hash-table :test ',pyel-dict-test)))
#+END_SRC
*** tests
#+Begin_SRC emacs-lisp :tangle pyel-tests.el
  (pyel-create-tests
   dict
   ("a = {'a':2, 'b':4}
  b = {2:a, 'b':4}
  c = {'a':2, 'b':4, 'c' : {'d' : 1,'e': 2,'f':{'g':3}}}
  d = {}"
    ("repr(a)" "{\"a\": 2, \"b\": 4}")
    ("repr(b)" "{2: {\"a\": 2, \"b\": 4}, \"b\": 4}")
    ("repr(c)" "{\"a\": 2, \"b\": 4, \"c\": {\"d\": 1, \"e\": 2, \"f\": {\"g\": 3}}}")
    ("repr(d)" "{}")
  
    ("repr(c['c'])" "{\"d\": 1, \"e\": 2, \"f\": {\"g\": 3}}")
    ("repr(c['c']['f'])" "{\"g\": 3}")
    ("c['c']['f']['g']" 3)))
#+END_SRC

** tuple
*** transform
#+Begin_SRC emacs-lisp :tangle pyel-transforms.el
  (def-transform tuple pyel ()
    (lambda (elts ctx &optional line col) ;;Ignoring ctx for now
      (cons 'vector (mapcar 'transform elts))))
#+END_SRC
*** python ast
#+Begin_SRC python :tangle py-ast.py
  def Tuple(elts, ctx, lineno='nil', col_offset='nil'):
      return l_str(["tuple ", ll_str(elts), ctx, lineno, col_offset])
#+END_SRC
*** tests
#+Begin_SRC emacs-lisp :tangle pyel-tests.el
  (pyel-create-tests Tuple
                     "()"
                     "(a, b)"
                     "(a, (b, (c,d)))"
                     "((((((((a))))))))")
#+END_SRC
** string
*** transform
#+Begin_SRC emacs-lisp :tangle pyel-transforms.el
  (def-transform str pyel ()
    (lambda (s &optional line col)
      ;;    (format "\"%s\"" s)
      s
      ))
#+END_SRC
*** python ast
#+Begin_SRC python :tangle py-ast.py
  def Str(s, lineno='nil', col_offset='nil'):
      return "(str \"" + str(s) +"\"" + " " + str(lineno) + " " + str(col_offset) + ")"
#+END_SRC
*** tests
#+Begin_SRC emacs-lisp :tangle pyel-tests.el
  (pyel-create-tests string
                     "'a'"
                     "x = 'a'"
                     "['a','b']")
#+END_SRC
** comparisons: >, <, ==, !=, <=, >=
*** transform
#+Begin_SRC emacs-lisp :tangle pyel-transforms.el
  (def-transform compare pyel ()
    (lambda (left ops comparators &optional line col)
      ;;what if comparators has multiple items?
      (pyel-compare left ops comparators :outer line col)))
  
  ;;TODO: assign comparators to temp variables to prevent repeated evaluation
  (defun pyel-compare (left ops comparators &optional outer line col)
    ;;if outer is non-nil, then we use 'and' to combine the seporate tests
    (if (> (length ops) 1)
        (list (if outer 'and '@)
              (pyel-compare left (list (car ops)) (list (car comparators)))
              (pyel-compare (car comparators) (cdr ops) (cdr comparators)))
      
      (call-transform (read (car ops)) left (car comparators))))
  
  (pyel-dispatch-func == (l r)
                      (number number) -> (= l r)
                      (string string) -> (string= l r)
                      ;;                       (object _) -> (--eq-- l r)
                      
                      (_ _) -> (equal l r))
  
  (pyel-dispatch-func > (l r)
                      (number number) -> (> l r)
                      ;;TODO: macro for this
                      (string string) -> (pyel-string> l r)
                      (list list) -> (pyel-list-> l r)
                      (object _) -> (call-method l __gt__ r)
                      (vector vector) -> (pyel-vector-> l r)
                      )
  
  ;;TODO: other py types?
  
  ;;::Q does `string<' behave like < for strings in python?
  (pyel-dispatch-func < (l r)
                      (number number) -> (< l r)
                      (string string) -> (string< l r)
                      (list list) -> (pyel-list-< l r)
                      (object _) -> (call-method l __lt__ r)
                      (vector vector) -> (pyel-vector-< l r))
  
  (pyel-dispatch-func >= (l r)
                      (number number) -> (>= l r)
                      (string string) -> (pyel-string>= l r)
                      (list list)     ->  (pyel-list>= l r)
                      (object _) -> (call-method l __ge__ r)
                      (vector vector) -> (pyel-vector->= l r))
  
  (pyel-dispatch-func <= (l r)
                      (number number) -> (<= l r)
                      (string string) -> (pyel-string<= l r)
                      (list list)     -> (pyel-list<= l r)
                      (object _) -> (call-method l __le__ r)
                      (vector vector) -> (pyel-vector-<= l r))
  
  (pyel-dispatch-func != (l r)
                      (number number) -> (pyel-number!= l r)
                      (string string) -> (pyel-string!= l r)
                      (object _) -> (call-method l __ne__ r)
                      (_ _) -> (!equal l r))
  
  ;;this is defined as a transform because `pyel-compare' expects
  ;;all comparison functions to be transforms
  (pyel-dispatch-func is (l r)
                      (_ _) -> (eq l r))
#+END_SRC
