pyel-tests.el

(ert-deftest pyel-test-name ()
 (should (eq (pyel "testName") 'testName)))

(pyel-create-tests
 list
 ("[]" nil)
 ("['a',1,2]" '("a" 1 2))
 ("a = [1,2,'b']
b = [1,[1,'3',a,[],3]]"
  ("a" '(1 2 "b"))
  ("b" '(1 (1 "3" (1 2 "b") nil 3))))
 ("[[[1]]]" '(((1)))))

(pyel-create-tests dict
                   "{'a':2, 'b':4}"
                   "a = {a:2, b:4}"
                   "x = {'a':2, 'b':4, 'c' : {'d' : 1,'e': 2,f:{g:3}}}")

(pyel-create-tests Tuple
                   "()"
                   "(a, b)"
                   "(a, (b, (c,d)))"
                   "((((((((a))))))))")

(pyel-create-tests string
                   "'a'"
                   "x = 'a'"
                   "['a','b']")
