pyel.org
*** python ast
#+Begin_SRC python :tangle py-ast.py
  def Compare (left, ops, comparators, lineno='nil', col_offset='nil'):
        return l_str(["compare ", left, ll_str(ops), ll_str(comparators), lineno, col_offset ])

  def Gt():
        return "\">\""
  def Lt():
        return "\"<\""
  def Eq():
        return "\"==\""
  def NotEq ():
        return "\"!=\""
  def LtE():
        return "\"<=\""
  def GtE():
        return "\">=\""
  def In():
        return "\"in\""
  def NotIn():
        return "\"not-in\""
  def Is():
        return "\"is\""
#+END_SRC
*** python el lib
#+Begin_SRC emacs-lisp :tangle py-lib.el
  (defsubst pyel-string> (a b)
    (and (not (string< a b)) (not (string= a b))))
  
  (defsubst pyel-string<= (a b)
    (or (string< a b) (string= a b)))
  
  (defsubst pyel-string!= (a b)
    (not (string= a b)))
  
  (defsubst pyel-number!= (a b)
    (not (= a b)))
  
  (defun pyel-list-< (a b)
    "a < b"
    (let ((greator nil)
          e1 e2)
      (while (and a b (equal e1 e2))
        (setq e1 (car a)
              e2 (car b)
              a (cdr a)
              b (cdr b)))
      (pyel-< e1 e2)))
  (defun pyel-list-> (a b)
    "a > b"
    (let ((greator nil)
          e1 e2)
      (while (and a b (equal e1 e2))
        (setq e1 (car a)
              e2 (car b)
              a (cdr a)
              b (cdr b)))
      (pyel-> e1 e2)))
  
  (defsubst pyel-list>= (a b)
    (or (equal a b) (pyel-list-> a b)))
  
  (defsubst pyel-list<= (a b)
    (or (equal a b) (pyel-list-< a b)))
  
  (defun pyel-vector-> (a b)
    (let* ((greator nil)
           (len-a (length a))
           (len-b (length b))
           (len (min len-a len-b))
           (i 0)
           e1 e2)
      (while (and (< i len)
                  (equal e1 e2))
        (setq e1 (aref a i)
              e2 (aref b i)
              i (1+ i)))
      (or (pyel-> e1 e2)
          (and (= i len)
               (equal e1 e2)
               (> len-a len-b)))))
  (defun pyel-vector-< (a b)
    (let* ((greator nil)
           (len-a (length a))
           (len-b (length b))
           (len (min len-a len-b))
           (i 0)
           e1 e2)
      (while (and (< i len)
                  (equal e1 e2))
        (setq e1 (aref a i)
              e2 (aref b i)
              i (1+ i)))
      (or (pyel-< e1 e2)
          (and (= i len)
               (equal e1 e2)
               (< len-a len-b)))))
  
  (defsubst pyel-vector-<= (a b)
    (or (equal a b) (pyel-vector-< a b)))
  
  (defsubst pyel-vector->= (a b)
    (or (equal a b) (pyel-vector-> a b)))
  
  (defsubst !equal (a b)
    (not (equal a b)))
#+END_SRC
*** tests
#+Begin_SRC emacs-lisp :tangle pyel-tests.el
  (pyel-create-tests compare
                     "a=='d'"
                     "a==b"
                     "a>=b"
                     "a<=b"
                     "a<b"
                     "a>b"
                     "a!=b"
                     "(a,b) == [c,d]"
                     "[a == 1]"
                     "((a == 1),)"
                     "a<b<c"
                     "a<=b<c<=d"
                     "a.b<=b.c()<c<=3")
#+END_SRC
** if
*** transform
#+Begin_SRC emacs-lisp :tangle pyel-transforms.el
  (def-transform if pyel ()
    (lambda (test body orelse &optional line col)
      (pyel-if test body orelse line col)))
  
  (defun pyel-if (test body orelse &optional line col)
    (let* ((tst (transform test))
           (true-body (if (> (length body) 1)
                          (append (remove-context tail-context
                                                  (mapcar 'transform
                                                          (or (subseq body 0 -1)
                                                              (list (car body)))))
                                  (list (transform (car (last body)))))
                        (mapcar 'transform body)))
           (false-body (if (> (length orelse) 1)
                          (append (remove-context tail-context
                                                  (mapcar 'transform
                                                          (or (subseq body 0 -1)
                                                              (list (car orelse)))))
                                  (list (transform (car (last orelse)))))
                        (mapcar 'transform orelse))) 
           (progn-code (if (> (length true-body) 1)
                           '(@ progn)
                         '@)))
  
      `(if  ,(if (equal tst []) nil tst)
  
           (,progn-code ,@true-body)
         ,@false-body)))
#+END_SRC
*** python ast
#+Begin_SRC python :tangle py-ast.py
  def If (test, body, orelse, lineno='nil', col_offset='nil'):
      return l_str(["if ",test, ll_str(body), ll_str(orelse), lineno, col_offset])
#+END_SRC
*** tests
#+Begin_SRC emacs-lisp :tangle pyel-tests.el
  (pyel-create-tests
   if
   ("if True:
   x = 1
  else:
   x = 2"
    ("x" 1))
   ("if False:
   x = 3
  else:
   x = 4"
    ("x" 4))
   ("if len([1,2,3]) == 3:
   y = 1
   x = 5
  else:
   y = 1
   x = 6"
    ("x" 5))
  
   ("def a():
   if True:
    return 1
   else:
    return 2
  
  def b():
   if True:
    return 1
    x()
   else:
    y()
    return 2
  
  def c():
   if 1 == 2:
    return 1
    x()
   else:
    y()
    return 2
  
  def d():
   if 1 == 2:
    return 4
   else:
    if True:
     return 1.1
     x()
    return 2
  
  def e():
   if 1 == 1:
    if True:
     if [0][0] == 0:
      return 12
     x()
   else:
    y()
    return 2"
    ("a()" 1)
    ("b()" 1)
    ("c()" 2)
    ("c()" 1.1)
    ("e()" 12))
  
   ("def test():
   if 1 == 3:
    return 12
   elif 3 == 5:
    return 123
   elif 2 == 2:
    return 234
   else:
    return 33"
   ("test()" 234)))
  
#+END_SRC
** call
