pyel-transforms.el

(def-transform if pyel ()
  (lambda (test body orelse &optional line col)
    (pyel-if test body orelse line col)))

(defun pyel-if (test body orelse &optional line col)
  (let* ((tst (transform test))
         (true-body (if (> (length body) 1)
                        (append (remove-context tail-context
                                                (mapcar 'transform
                                                        (or (subseq body 0 -1)
                                                            (list (car body)))))
                                (list (transform (car (last body)))))
                      (mapcar 'transform body)))
         (false-body (if (> (length orelse) 1)
                        (append (remove-context tail-context
                                                (mapcar 'transform
                                                        (or (subseq body 0 -1)
                                                            (list (car orelse)))))
                                (list (transform (car (last orelse)))))
                      (mapcar 'transform orelse))) 
         (progn-code (if (> (length true-body) 1)
                         '(@ progn)
                       '@)))

    `(if  ,(if (equal tst []) nil tst)

         (,progn-code ,@true-body)
       ,@false-body)))
