pyel.org
*** transform
#+Begin_SRC emacs-lisp :tangle pyel-transforms.el
  (defvar pyel-obj-counter 0)
  
  (defun pyel-next-obj-name ()
    (if pyel-unique-obj-names
        (format "obj-%d" (setq pyel-obj-counter (1+ pyel-obj-counter)))
      "obj"))
  
  ;; (pyel-dispatch-func fcall (_func &rest args)
  ;;                      ($func _) -> ($func ,@args)
  ;;                      (_ _) -> (funcall $func ,@args))
  
  ;; functions set to variables override those defined with `defun'
  ;; this allows locally defined functions to override their global
  ;; counterparts without defining themselves globally
  (pyel-dispatch-func fcall (_func &rest _args)
                      (vfunc _) -> (funcall $func ,@(pyel-sort-kwargs args))
                      ;;($function _) -> ($func ,@(pyel-sort-kwargs args))
                      (class _) -> (call-method $func --new--
                                                ,@(pyel-sort-kwargs args))
  
                      (instance _) -> (call-method $func --call--
                                                   ,@(pyel-sort-kwargs args))
                      (_ _) -> ($func ,@(pyel-sort-kwargs args))
                      )
  
  (def-transform keyword pyel ()
    (lambda (arg value &optional line col)
      (if (context-p 'keywords-alist)
          (list (_to- arg) (transform value))
        (list '@ (_to- arg)  '= (transform value)))))
  
  (def-transform call pyel ()
    ;;TODO: some cases funcall will need to be used, how to handle that?
    (lambda (func args keywords starargs kwargs &optional line col)
      (pyel-call-transform func args keywords starargs kwargs line col)))
  
  (defun pyel-call-transform (func args keywords starargs kwargs &optional line col)
    (let ((t-func (using-context function-call
                                 (transform func)))
          (keyword-args (using-context keywords-alist
                                       (mapcar (lambda (x) (transform (car x)))
                                               keywords)))
          new-func m-name f-name star-args kw-args)
      ;; (if (member t-func pyel-defined-classes)
      ;;     ;;instantiate an object and call its initializer
      ;;     `(let ((__c (,t-func ,(pyel-next-obj-name))))
      ;;        (--init-- __c ,@(mapcar 'transform args))
      ;;        __c)
      
      (if (eq (car func) 'attribute);;method call
          (if (and (member (setq m-name (read (caddr func)))
                           pyel-method-transforms)
                   (setq m-name (pyel-find-method-transform-name
                                 m-name
                                 (1+ (length args)))));;1+ because args does not include the object
  
              ;;this methods transform is overridden
              (progn
                ;;dynamic scoping saves the day again!
                (setq keyword-args keywords
                      star-args starargs
                      kw-args kwargs)
  
                (eval `(call-transform ',m-name
                                       ',(transform (cadr func))
                                       ,@(mapcar '(lambda (x) `(quote ,x)) args))))
            ;;normal method call
            (remove-context method-call-override
                            (using-context method-call
                                           `(,(transform func) ,@(remove-context method-call
                                                                                 (mapcar 'transform args))))))
  
        (when (setq new-func (assoc t-func pyel-function-name-translations));;function call
          ;;translate name
          (setq t-func (cadr new-func)))
  
        ;;call function transform if one was defined
        (cond ((and keyword-args
                    (member t-func pyel-func-kwarg-transforms))
               ;;transform defined with `pyel-func-kwarg-transform'
               (eval `(call-transform ',(pyel-func-transform-name t-func t)
                                      ',keyword-args
                                      ,@(mapcar '(lambda (x) `(quote ,x)) args))))
              ((member t-func pyel-func-transforms)
               ;;transform defined with `pyel-func-transform'
               (eval `(call-transform ',(pyel-func-transform-name t-func)
                                      ;;',(transform (cadr func))
                                      ,@(mapcar '(lambda (x) `(quote ,x)) args))))
              
  
              ((member t-func pyel-func-transforms2)
               ;;transform defined with `pyel-define-function-translation'
               (eval `(call-transform ',(pyel-func-transform-name t-func)
                                      ;;,(mapcar '(lambda (x) `(quote ,x)) args)
                                      (mapcar 'transform args)
                                      keyword-args)))
  
               ;;normal function call
               ;;`(,t-func ,@(mapcar 'transform args))
               ;;TODO: this is dumb, convert `call-transform' to a macro?
               (t (eval `(call-transform 'fcall ,@(cons 't-func
                                                        (mapcar (lambda (x)
                                                                  `(quote ,x))
                                                                (append args
                                                                        (mapcar 'car
                                                                                keywords))
                                                                )))))))))
#+END_SRC
*** python ast
#+Begin_SRC python :tangle py-ast.py
  def Call(func, args, keywords, starargs, kwargs, lineno='nil', col_offset='nil'):
      return l_str(["call ", func, ll_str(args), ll_str(keywords), starargs or "nil" , kwargs or "nil", lineno, col_offset])
#+END_SRC
*** tests
#+Begin_SRC emacs-lisp :tangle pyel-tests.el
  (pyel-create-tests call
                     "aa()"
                     "aa(b,c(1,2))"
                     ;;"aa()()" does not work yet
                     "aa=b()"
                     ;;"aa.b()"
                     ;;"[aa.b()==4]"
                     "aa(3,b(c(),[2,(2,3)]))"
                     "aa.b()"
                     "aa.b(1,2)"
                     "aa.b(1,a.b(1,2,3))"

                     "a.b().c()"
                     "a.b().c().d()"
                     "a.b(x.y().e()).c()"

                     )
#+END_SRC
** while loop
