pyel-tests.el

(pyel-create-tests call
                   "aa()"
                   "aa(b,c(1,2))"
                   ;;"aa()()" does not work yet
                   "aa=b()"
                   ;;"aa.b()"
                   ;;"[aa.b()==4]"
                   "aa(3,b(c(),[2,(2,3)]))"
                   "aa.b()"
                   "aa.b(1,2)"
                   "aa.b(1,a.b(1,2,3))"

                   "a.b().c()"
                   "a.b().c().d()"
                   "a.b(x.y().e()).c()"

                   )

(pyel-create-tests 
 while
 ("x = 1
a = 0
while x < 10:
 a += x
 x += 1"
  ("a" 45))
