pyel.org
*** transform
#+Begin_SRC emacs-lisp :tangle pyel-transforms.el
  (def-transform while pyel ()
    (lambda (test body orelse &optional line col)
      (pyel-while test body orelse line col)))
  
  ;;doc: context macro-call
  (defun pyel-while (test body orelse &optional line col)
    ;;pyel-while is special. it gets to handle the macro definitions
    (let* ((tst (transform test))
           (else (mapcar 'transform orelse))
           break-code
           continue-code
           macro-name
           t-body
           t-last
           break-code
           continue-code
           wile
           ;;inter-transform variables
           continue-while
           break-while )
  
      (if (and (symbolp tst)
               (string-match (format "^%s\\([A-Za-z0-9_]+\\)$" pyel-py-macro-prefix)
                             (symbol-name tst)))
          (using-context
           macro-call
           ;;expand as a macro call
           `(,(intern (replace-regexp-in-string "_" "-"
                                                (match-string 1 (symbol-name tst))))
             ;;TODO: if macro name is an alias, replace with actual
             ,@(mapcar 'transform body)))
  
        ;;expand as a normal while loop
        (using-context
         while
  
         (setq code (remove-context tail-context (mapcar 'transform body))
               ;;^ no tail calls from while loop
                ;; t-body (remove-context tail-context
                ;;                        (mapcar 'transform (subseq body 0 -1)))
                ;; t-last (transform (car (last body)))
                ;; code (append t-body (list t-last))
  
  
               break-code (if break-while '(catch '__break__)
                            pyel-nothing)
               continue-code (if continue-while '(catch '__continue__)
                               pyel-nothing)
               wile `(,@break-code
                      (while
                          ,(if (equal tst []) nil tst)
                        (,@continue-code
                         ,@code)))))
        (if else
            `(@ ,wile ,@else)
          wile))))
#+END_SRC
*** python ast
#+Begin_SRC python :tangle py-ast.py
  def While(test, body, orelse, lineno='nil', col_offset='nil'):
      return l_str(["while ", test, ll_str(body), ll_str(orelse), lineno, col_offset])
#+END_SRC
*** tests
#+Begin_SRC emacs-lisp :tangle pyel-tests.el
  (pyel-create-tests 
   while
   ("x = 1
  a = 0
  while x < 10:
   a += x
   x += 1"
    ("a" 45))
  
   ;;return from tail context
   ("def f():
   x = 1;
   while x < 10:
    return x
    x+=1
   return x
  
  def g():
   x = 1;
   while x < 10:
    x+=1
    return x
   return x"
    ("f()" 1)
    ("g()" 2))
  
   ;;break
   ("x = 1
  while x < 10:
   if x == 3:
    break
   x+=1"
    ("x" 3))
  
   ;;continue
   ("x = 0
  a=0
  while x < 10:
   x+=1
   if x%2 == 0:
    continue
   a+=1"
    ("a" 5)))
#+END_SRC
** arguments
*** transform
#+Begin_SRC emacs-lisp :tangle pyel-transforms.el
  (def-transform arguments pyel ()
    (lambda (args vararg varargannotation kwonlyargs kwarg kwargannotation
                  defaults kw_defaults)
      (pyel-arguments args vararg varargannotation kwonlyargs kwarg kwargannotation
                      defaults kw_defaults)))
  
  (defun pyel-arguments (args vararg varargannotation
                              kwonlyargs kwarg kwargannotation
                              defaults kw_defaults)
    ;;TODO: other args
  
    (let* ((args (mapcar 'transform args))
           (defaults (mapcar 'transform defaults)))
  
      ;;&optional
      (when defaults
        (setq defaults (mapcar* (lambda (arg default)
                                  (setq arg (_to- arg))
                                  (cons arg default))
                                (reverse args) (reverse defaults)))
          (setq args (append (subseq args 0 (- (length args) (length defaults)))
                             '(&optional)
                             defaults)))
  
      ;;&rest
      (when vararg
        (setq args (append args (list '&rest vararg)))
        (when (and (not pyel-use-list-for-varargs)
                   (context-p 'function-def))
          (push `(setq, vararg (list-to-vector ,vararg)) assign-defaults)))
  
      ;;&kwonly
      (when kwonlyargs
        (setq args (append args (cons '&kwonly
                                      (mapcar* 'cons
                                               (mapcar 'transform kwonlyargs)
                                               (mapcar 'transform kw_defaults))))))
                                      
      ;;&kwarg
      (when kwarg
        (setq args (append args (list '&kwarg kwarg))))
  
      args))
#+END_SRC
*** python ast
#+Begin_SRC python :tangle py-ast.py
  def arguments(args=None, vararg=None, varargannotation=None, kwonlyargs=None,
                kwarg=None, kwargannotation=None,defaults=None, kw_defaults=None):
      return ll_str(["(arguments ",
                     ll_str(args) or "nil",
                     vararg or "nil",
                     varargannotation or "nil",
                     ll_str(kwonlyargs) if kwonlyargs else "nil",
                     kwarg or "nil",
                     kwargannotation or "nil",
                     ll_str(defaults) or "nil",
                     ll_str(kw_defaults) if kw_defaults else "nil", ")"])
      #return l_str(["_arguments ",ll_str(args) or "nil",vararg or "nil",varargannotation or "nil", kwonlyargs or "nil", kwarg or "nil", kwargannotation or "nil", defaults or "nil", kw_defaults or "nil"])
#+END_SRC
*** tests
#+Begin_SRC emacs-lisp :tangle pyel-tests.el
  (ert-deftest pyel-test-arguments ()
    (with-transform-table 'pyel
                          (and
                           (should (equal (transform '(arguments ((arg "b" nil)
                                                                  (arg "c" nil)) nil nil nil nil nil nil nil))
  
                                          '(b c)))
                           ;;other tests here
                           )))
#+END_SRC
** function def
includes 'arg' transformation
*** python ast expansion example
"def a(b,c):
  print('ok')
  return c+a"

FunctionDef(name='a',
	    args=arguments(args=[arg(arg='b', annotation=None), arg(arg='c', annotation=None)],
				vararg=None,
				varargannotation=None,
				kwonlyargs=[],
				kwarg=None,
				kwargannotation=None,
				defaults=[],
				kw_defaults=[]),

	    body=[Expr(value=Call(func=Name(id='print', ctx=Load()), args=[Str(s='ok')], keywords=[], starargs=None, kwargs=None)), Return(value=BinOp(left=Name(id='c', ctx=Load()), op=Add(), right=Name(id='a', ctx=Load())))],

	    decorator_list=[],
	    returns=None)

