pyel-transforms.el

(def-transform while pyel ()
  (lambda (test body orelse &optional line col)
    (pyel-while test body orelse line col)))

;;doc: context macro-call
(defun pyel-while (test body orelse &optional line col)
  ;;pyel-while is special. it gets to handle the macro definitions
  (let* ((tst (transform test))
         (else (mapcar 'transform orelse))
         break-code
         continue-code
         macro-name
         t-body
         t-last
         break-code
         continue-code
         wile
         ;;inter-transform variables
         continue-while
         break-while )

    (if (and (symbolp tst)
             (string-match (format "^%s\\([A-Za-z0-9_]+\\)$" pyel-py-macro-prefix)
                           (symbol-name tst)))
        (using-context
         macro-call
         ;;expand as a macro call
         `(,(intern (replace-regexp-in-string "_" "-"
                                              (match-string 1 (symbol-name tst))))
           ;;TODO: if macro name is an alias, replace with actual
           ,@(mapcar 'transform body)))

      ;;expand as a normal while loop
      (using-context
       while

       (setq code (remove-context tail-context (mapcar 'transform body))
             ;;^ no tail calls from while loop
              ;; t-body (remove-context tail-context
              ;;                        (mapcar 'transform (subseq body 0 -1)))
              ;; t-last (transform (car (last body)))
              ;; code (append t-body (list t-last))


             break-code (if break-while '(catch '__break__)
                          pyel-nothing)
             continue-code (if continue-while '(catch '__continue__)
                             pyel-nothing)
             wile `(,@break-code
                    (while
                        ,(if (equal tst []) nil tst)
                      (,@continue-code
                       ,@code)))))
      (if else
          `(@ ,wile ,@else)
        wile))))

(def-transform arguments pyel ()
  (lambda (args vararg varargannotation kwonlyargs kwarg kwargannotation
                defaults kw_defaults)
    (pyel-arguments args vararg varargannotation kwonlyargs kwarg kwargannotation
                    defaults kw_defaults)))

(defun pyel-arguments (args vararg varargannotation
                            kwonlyargs kwarg kwargannotation
                            defaults kw_defaults)
  ;;TODO: other args

  (let* ((args (mapcar 'transform args))
         (defaults (mapcar 'transform defaults)))

    ;;&optional
    (when defaults
      (setq defaults (mapcar* (lambda (arg default)
                                (setq arg (_to- arg))
                                (cons arg default))
                              (reverse args) (reverse defaults)))
        (setq args (append (subseq args 0 (- (length args) (length defaults)))
                           '(&optional)
                           defaults)))

    ;;&rest
    (when vararg
      (setq args (append args (list '&rest vararg)))
      (when (and (not pyel-use-list-for-varargs)
                 (context-p 'function-def))
        (push `(setq, vararg (list-to-vector ,vararg)) assign-defaults)))

    ;;&kwonly
    (when kwonlyargs
      (setq args (append args (cons '&kwonly
                                    (mapcar* 'cons
                                             (mapcar 'transform kwonlyargs)
                                             (mapcar 'transform kw_defaults))))))
                                    
    ;;&kwarg
    (when kwarg
      (setq args (append args (list '&kwarg kwarg))))

    args))
