pyel.org
*** transform
#+Begin_SRC emacs-lisp :tangle pyel-transforms.el
  (def-transform arg pyel ()
    (lambda (arg annotation) ;;Ignoring annotation
      (read arg)))
  
  (def-transform def pyel ()
    (lambda (name args body decoratorlist returns &optional line col)
      (pyel-def name args body decoratorlist returns line col)))
  
  (defun transform-last-with-context (context code)
    ;;TODO: this does not work: fix and replace code in `pyel-def
    (let*  ((last-line (using-context context
                                      (transform (car (last code)))))
            (first (mapcar 'transform (subseq code 0 (1- (length code))))))
      (append first (list last-line))))
  
  (defun pyel-def (name args body decoratorlist returns &optional line col)
    (let ((name (read (_to- name))))
  
      (when (context-p 'function-def)
        (push name let-arglist)) ;;do this before the let-arglists gets overridden for this transform
  
      (let* ((func 'def)
             t-body
             arglist
             first
             last-line
  
             ;;trans-template vars
             (assign-defaults (list pyel-nothing));;holds assignment code set by the arguments transform
             return-middle
             let-arglist
             global-vars
             docstring
             interactive
  
                ;;;
             (ret pyel-nothing)
             (args (_to- (using-context function-def (transform (car args)))))
             (inner-defun (context-p 'function-def))
             (orig-name name)
             (decorators (mapcar 'transform decoratorlist))
             setq-code
             )
  
        (when (or (context-p 'lambda-def)
                  (and inner-defun
                       (not (member '&kwarg args))))
  
          (setq decorators (cons 'pyel-lambda decorators)
                name nil))
  
        (using-context
         function-def
         (cond
  
          ;; ((context-p 'class-def) (using-context method-def
          ;;                           (setq last-line (using-context tail-context
          ;;                                                          (transform (car (last body))))
          ;;                                 first (mapcar 'transform (subseq body 0 (1- (length body))))
          ;;                                 t-body (append first (list last-line)))
  
          ;;                           ;;TODO: let-arlist for methods like
          ;;                           ;;      and *args ...
          ;;                           (push `(defmethod ,name
          ;;                                    ((,(car args) ,class-def-name)
          ;;                                     ,@(cdr args))
  
          ;;                                    ,@t-body)
          ;;                                 class-def-methods)))
  
          (t (setq last-line (using-context tail-context
                                            (transform (car (last body))))
                   first (subseq body 0 (1- (length body)))
                   first (if first
                             (mapcar 'transform first)
                           nil)
                   t-body (append first (list last-line)))
  
             ;;(setq t-body (transform-last-with-context
             ;;                'tail-context body))
  
             ;;remove variables from the let arglist that have been declared global
             (setq let-arglist (let (arglist) (mapcar (lambda (x)
                                                        (unless (or (member x global-vars)
                                                                    (member x args))
                                                          (push x arglist)))
                                                      let-arglist)
                                    arglist))
             ;;      ?remove variables that are defined in emacs?
  
             (setq docstring
                   (if (stringp (car t-body))
                       (pop t-body)
                     pyel-nothing))
  
             (setq ret (if return-middle '(catch '__return__)
                         '(@)))
  
             (if let-arglist
                 (setq let-arglist (list '@ 'let let-arglist))
               (setq let-arglist '@))
  
             (if inner-defun
                 (progn
                   (if (and (member '&kwarg args)
                            (not (member 'pyel-lambda decorators)))
                       (setq decorators
                             (cons 'pyel-lambda decorators)))
                   (setq setq-code (list '@ 'setq orig-name)))
               (setq setq-code '@))
  
             (if interactive
                 (push 'interactive decorators))
  
             `(,setq-code (,func ,name ,args ,decorators
                                 ,docstring
                                 ,@assign-defaults
                                 (,let-arglist
                                  (,@ret
                                   ,@t-body
                                   ))))
             ))))))
  
  (defun pyel-sort-kwargs (args)
    "Organize args in the format required by functions that accept keyword args
  Returns a list whose first element has an alist containing the keyword args
  in the cdr and ':kwargs' in the car position.
  and whose second element is a list of all non-keyword args
  Recognizes keyword args in the form 'arg = value'."
    ;;for use in the 'fcall' transform
    (if (member '= args)
        (let ((current args)
              kwargs
              normal)
          (when (eq (car current) '=) (error "invalid keyword arg syntax"))
          (while current
            (if (eq (car current) '=)
                (progn
                  (when (null (cdr current)) (error "invalid keyword arg syntax"))
                  (push (cons (pop normal) (cadr current)) kwargs)
                  (setq current (cddr current)))
              (push (car current) normal)
              (setq current (cdr current))))
          (list (list 'quote (cons :kwargs kwargs)) (list 'quote (reverse normal))))
      args))
#+END_SRC
