pyel.org
*** tests
#+Begin_SRC emacs-lisp :tangle pyel-tests.el
  (pyel-create-tests
   def
   ("def a():
    return 0
  
  def b(a):
   return a
  
  def c(a,b,c):
   return a+b+c
  
  def d(a):
   if True:
    return a
   return 5
   somethingelse()
  
  def e(a=1.1):
   return a
  def f(*a):
   return a
  "
    ("a()" 0)
    ("b(1)" 1)
    ("c(1,2,3)" 6)
    ("d(2)" 2)
    ("e()" 1.1)
    ("e(22)" 22)
    ("f(1,3,5,6,8)" [1, 3, 5, 6, 8]))
   
   ;;test interactively
   ("def a():
   'docstring'
   interactive()
   x = 1
   return 'hi'
  
  def b():
   return 2"
    ("commandp(quote(a))" t)
    ("commandp(quote(b))" nil)))
  
  (pyel-create-tests
   function-arguments
   ("def func(__a,__b,c=1,d='two',*rest,**kwargs):
   return [__a,__b,c,d,rest,kwargs]"
    ("repr(func(1,2))"
     "[1, 2, 1, \"two\", [], {}]")
    ("repr(func(1,2,3))"
     "[1, 2, 3, \"two\", [], {}]")
    ("repr(func(1,2,3,4))"
     "[1, 2, 3, 4, [], {}]")
    ("repr(func(1,2,3,4,5))"
     "[1, 2, 3, 4, [5], {}]")
    ("repr(func(1,2,3,4,5,6))"
     "[1, 2, 3, 4, [5, 6], {}]")
    ("repr(func(1,2,3,4,5,6,x = 's'))"
     "[1, 2, 3, 4, [5, 6], {x: \"s\"}]")
    ("repr(func(1,2,3,4,5,6,x = 's',y = 23))"
     "[1, 2, 3, 4, [5, 6], {y: 23, x: \"s\"}]")
    ("repr(func(x = 's',__b = 324,__a = 'n',))"
     "[\"n\", 324, 1, \"two\", [], {x: \"s\"}]")
    ("repr(func(x = 's',__b = 324,__a = 'n',d = 2))"
     "[\"n\", 324, 1, 2, [], {x: \"s\"}]"))
   ;;tests with kwonlyargs
   ("def test(a, *b, c=1, d, **e):
   return [a, b, c, d, e]"
    ("repr(test('x',1,2,3,_d=1.1,_xx=2.2,_yy=3.3))"
     "[\"x\", [1, 2, 3], 1, nil, {-yy: 3.3, -xx: 2.2, -d: 1.1}]")
  
    ("repr(test('x',d=1.1))"
     "[\"x\", nil, 1, 1.1, {}]")
  
    ("repr(test('x'))"
     "[\"x\", nil, 1, nil, {}]")
  
    ("repr(test(d=1,c=2,a='x',e=4))"
     "[\"x\", (), 2, 1, {e: 4}]")
  
    ("repr(test(1,2,3,4,5,6))"
     "[1, (2, 3, 4, 5, 6), 1, nil, {}]"))
  
   ("def test(a,b):
       return [a,b]"
    ("test(1,2)" '(1 2))
    ("test(b=4,a='s')" '("s" 4)))
  
   ;;check that default values for optional args get set with or without kwargs
   ("def test(a,b,c,d=1,dd=2,ddd=4,*restst, x=1,xx=32,xxx=43,**kwargs_):
   return [a,b,c,d,dd,ddd,restst,x,xx,xxx,kwargs_]"
    ("repr(test(1,2,3,999,888,777,1,2,3,43,4,5,x=3))"
     "[1, 2, 3, 999, 888, 777, [1, 2, 3, 43, 4, 5], 3, 32, 43, {}]")
    ("repr(test(1,2,3,999,888,777,1,2,3,43,4,5))"
     "[1, 2, 3, 999, 888, 777, [1, 2, 3, 43, 4, 5], 1, 32, 43, {}]"))
   )
  
  (ert-deftest pyel-test-sort-kwargs ()
    (equal (pyel-sort-kwargs '(a b = 1 5 12 x = 1 3))
           '((a 5 12 3) ((x . 1) (b . 1))))
    (equal (pyel-sort-kwargs '(b = 1 x = 1))
           '(nil ((x . 1) (b . 1))))
    (equal (pyel-sort-kwargs '(b = 1))
           '(nil ((b . 1))))
    (equal (pyel-sort-kwargs '(a b c d))
           '((a b c d) nil))
    (equal (pyel-sort-kwargs '(a b = (b 1 2) 5 12 x = 1 (+ 1 3 ) y = "s"))
           '((a 5 12 (+ 1 3)) ((y . "s") (x . 1) (b b 1 2)))))
#+END_SRC
** bin-op, +, -, *, /, **, |, &
::Q can an overloaded + operator obj be used like:  3+obj
    these transforms assume you can
TODO: FIX: most of these are wrong.
      if one arg is a number, then the other may still be an object
overloadable operators: http://rgruet.free.fr/PQR26/PQR2.6.html#SpecialMethods

emacs bitwise operators: http://www.gnu.org/software/emacs/manual/html_node/elisp/Bitwise-Operations.html

*** transform
TODO: tests!
#+Begin_SRC emacs-lisp :tangle pyel-transforms.el
  (def-transform bin-op pyel ()
    (lambda (left op right &optional line col)
      (call-transform op left right)))
  
  (pyel-dispatch-func * (l r)
                      (object _)  -> (call-method l --mul-- r)
                      (string _)
                      (_ string)  -> (pyel-mul-num-str l r)
                      (_ _)       -> (* l r))
  
  (pyel-dispatch-func + (lhs rhs)
                      (number _) -> (+ lhs rhs)
                      (string _) -> (concat lhs rhs)
                      (list _)   -> (append lhs rhs)
                      (object _) -> (call-method lhs --add-- rhs)
                      (_ number)  -> (+ lhs rhs)
                      (vector _)
                      (_ vector)  -> (vconcat lhs rhs)
                      (_ string) -> (concat lhs rhs)
                      (_ list)   -> (append lhs rhs))
  
  (pyel-dispatch-func - (l r)
                      (number _) -> (- l r)
                      (object _) -> (call-method l --sub-- r)
                      (_ number) -> (- l r))
  
  (pyel-dispatch-func ** (l r) ;;pow
                      (number _) -> (expt l r)
                      (object _) -> (call-method l --pow-- r)
                      (_ number) -> (expt l r))
  
  (pyel-dispatch-func / (l r)
                      (number _) -> (pyel-div l r)
                      (object _) -> (call-method l --truediv-- r)
                      (_ number) -> (pyel-div l r))
  
  (pyel-dispatch-func // (l r) ;;floored (normal) division
                      (number _) -> (/ l r)
                      (object _) -> (call-method l --floordiv-- r)
                      (_ number) -> (/ l r))
  
  (pyel-dispatch-func ^ (l r) ;;bit xor
                      (number _) -> (logxor l r)
                      (object _) -> (call-method l --xor-- r)
                      (_ number) -> (logxor l r))
  
  (pyel-dispatch-func & (l r) ;;bit and
                      (number _) -> (logand l r)
                      (object _) -> (call-method l --and-- r)
                      (_ number) -> (logand l r))
  
  (pyel-dispatch-func | (l r) ;;bit or
                      (number _) -> (logior l r)
                      (object _) -> (call-method l --or-- r)
                      (_ number) -> (logior l r))
  
  (pyel-dispatch-func % (l r)
                      (number _) -> (% l r)
                      (object _) -> (call-method l --mod-- r))
  
  
#+END_SRC
*** python ast
#+Begin_SRC python :tangle py-ast.py
  def BinOp(left, op, right, lineno='nil', col_offset='nil'):
      return l_str(["bin-op ", left, op, right, lineno, col_offset])

  def Add():
      return "+"
  def Mult():
      return "*"
  def Sub():
      return "-"
  def Div():
      return "/"
  def FloorDiv():
      return "//"
  def Pow():
      return "**"
  def BitXor():
      return "^"
  def BitOr():
      return "|"
  def BitAnd():
      return "&"
  def Mod():
      return "%"
#+END_SRC
*** python el lib
#+Begin_SRC emacs-lisp :tangle py-lib.el
  (defun pyel-mul-num-str (left right)
    (let ((c 0)
          (ret "")
          num str)
      (if (numberp left)
          (setq num left
                str right)
        (setq num right
              str left))
      (while (< c num)
        (setq ret (concat ret str)
              c (1+ c)))
      ret))
  
  (defmacro pyel-div (l r)
    (cond ((or (floatp l)
               (floatp r))
           `(/ ,l ,r))
          ((integerp l)
           `(/ ,(* 1.0 l) ,r))
          ((integerp r)
           `(/ ,l ,(* 1.0 r)))
          (t `(/ (* ,l 1.0) ,r))))
#+END_SRC
*** tests TODO
#+Begin_SRC emacs-lisp :tangle pyel-tests.el
  (pyel-create-tests
   add-op
   ("1 + 2" 3)
   ("'a' + 'b'" "ab")
   ("n1 = 2
  n2 = 5
  s1 = 'asd'
  s2 = 'df'
  l1 = [1]
  l2 = [3,'a']
  v1 = (1,2)
  v2 = (3,)"
    ("n1 + n2" 10)
    ("s1 + s2" "asddf")
    ("l1 + l2" '(1 3 "a"))
    ("v1 + v2" [1 2 3]))
   
   ("class test:
   def __init__(self, n):
    message('init')
    self.n = n*2
   def __add__(self, o):
    message('adding')
    return self.n + o.n
  x = test(5)
  y = test(2)"
    ("x + y" 14)))
  
  (pyel-create-tests
   sub-op
   ("3 - 2" 1)
   ("n1 = 5
  n2 = 3"
    ("n1 - n2" 2)))
  
  (pyel-create-tests
   mult-op
   ("3 * 4" 12)
   ("'a' * 3" "aaa")
   ("4*'b'" "bbbb")
   ("n1 = 2
  n2 = 4
  s = 's'"
    ("n1 * n2" 8)
    ("s * n1" "ss")
    ("n1 * s" "ss"))
   )
  
  (pyel-create-tests
   pow-op
   ("3 ** 4" 81)
   ("n1 = 2
  n2 = 4"
    ("n1 ** n2" 16)))
  
  (pyel-create-tests
   div-op
   ("9 / 4" 2.25)
   ("9 // 4" 2)
   ("a = 9
  b = 4"
    ("a / b" 2.25)
    ("a // b" 2))
   )
  
  (pyel-create-tests
   bin-ops
   ("3 & 5" 0)
   ("3 | 5" 7)
   ("3 ^ 5" 6)
   ("a = 3
  b = 5"
    ("a & b" 0)
    ("a | b" 7)
    ("a ^ b" 6)))
  
  (pyel-create-tests
   mod-op
   ("5 % 3" 2)
   ("a = 3
  b = 5"
    ("b % a" 2)))
#+END_SRC
** subscript,index,slice
