pyel-tests.el
 
 ;;test interactively
 ("def a():
 'docstring'
 interactive()
 x = 1
 return 'hi'

def b():
 return 2"
  ("commandp(quote(a))" t)
  ("commandp(quote(b))" nil)))

(pyel-create-tests
 function-arguments
 ("def func(__a,__b,c=1,d='two',*rest,**kwargs):
 return [__a,__b,c,d,rest,kwargs]"
  ("repr(func(1,2))"
   "[1, 2, 1, \"two\", [], {}]")
  ("repr(func(1,2,3))"
   "[1, 2, 3, \"two\", [], {}]")
  ("repr(func(1,2,3,4))"
   "[1, 2, 3, 4, [], {}]")
  ("repr(func(1,2,3,4,5))"
   "[1, 2, 3, 4, [5], {}]")
  ("repr(func(1,2,3,4,5,6))"
   "[1, 2, 3, 4, [5, 6], {}]")
  ("repr(func(1,2,3,4,5,6,x = 's'))"
   "[1, 2, 3, 4, [5, 6], {x: \"s\"}]")
  ("repr(func(1,2,3,4,5,6,x = 's',y = 23))"
   "[1, 2, 3, 4, [5, 6], {y: 23, x: \"s\"}]")
  ("repr(func(x = 's',__b = 324,__a = 'n',))"
   "[\"n\", 324, 1, \"two\", [], {x: \"s\"}]")
  ("repr(func(x = 's',__b = 324,__a = 'n',d = 2))"
   "[\"n\", 324, 1, 2, [], {x: \"s\"}]"))
 ;;tests with kwonlyargs
 ("def test(a, *b, c=1, d, **e):
 return [a, b, c, d, e]"
  ("repr(test('x',1,2,3,_d=1.1,_xx=2.2,_yy=3.3))"
   "[\"x\", [1, 2, 3], 1, nil, {-yy: 3.3, -xx: 2.2, -d: 1.1}]")

  ("repr(test('x',d=1.1))"
   "[\"x\", nil, 1, 1.1, {}]")

  ("repr(test('x'))"
   "[\"x\", nil, 1, nil, {}]")

  ("repr(test(d=1,c=2,a='x',e=4))"
   "[\"x\", (), 2, 1, {e: 4}]")

  ("repr(test(1,2,3,4,5,6))"
   "[1, (2, 3, 4, 5, 6), 1, nil, {}]"))

 ("def test(a,b):
     return [a,b]"
  ("test(1,2)" '(1 2))
  ("test(b=4,a='s')" '("s" 4)))

 ;;check that default values for optional args get set with or without kwargs
 ("def test(a,b,c,d=1,dd=2,ddd=4,*restst, x=1,xx=32,xxx=43,**kwargs_):
 return [a,b,c,d,dd,ddd,restst,x,xx,xxx,kwargs_]"
  ("repr(test(1,2,3,999,888,777,1,2,3,43,4,5,x=3))"
   "[1, 2, 3, 999, 888, 777, [1, 2, 3, 43, 4, 5], 3, 32, 43, {}]")
  ("repr(test(1,2,3,999,888,777,1,2,3,43,4,5))"
   "[1, 2, 3, 999, 888, 777, [1, 2, 3, 43, 4, 5], 1, 32, 43, {}]"))
 )

(ert-deftest pyel-test-sort-kwargs ()
  (equal (pyel-sort-kwargs '(a b = 1 5 12 x = 1 3))
         '((a 5 12 3) ((x . 1) (b . 1))))
  (equal (pyel-sort-kwargs '(b = 1 x = 1))
         '(nil ((x . 1) (b . 1))))
  (equal (pyel-sort-kwargs '(b = 1))
         '(nil ((b . 1))))
  (equal (pyel-sort-kwargs '(a b c d))
         '((a b c d) nil))
  (equal (pyel-sort-kwargs '(a b = (b 1 2) 5 12 x = 1 (+ 1 3 ) y = "s"))
         '((a 5 12 (+ 1 3)) ((y . "s") (x . 1) (b b 1 2)))))

(pyel-create-tests
 add-op
 ("1 + 2" 3)
 ("'a' + 'b'" "ab")
 ("n1 = 2
n2 = 5
s1 = 'asd'
s2 = 'df'
l1 = [1]
l2 = [3,'a']
v1 = (1,2)
v2 = (3,)"
  ("n1 + n2" 10)
  ("s1 + s2" "asddf")
  ("l1 + l2" '(1 3 "a"))
  ("v1 + v2" [1 2 3]))
 
 ("class test:
 def __init__(self, n):
  message('init')
  self.n = n*2
 def __add__(self, o):
  message('adding')
  return self.n + o.n
x = test(5)
y = test(2)"
  ("x + y" 14)))

(pyel-create-tests
 sub-op
 ("3 - 2" 1)
 ("n1 = 5
n2 = 3"
  ("n1 - n2" 2)))

(pyel-create-tests
 mult-op
 ("3 * 4" 12)
 ("'a' * 3" "aaa")
 ("4*'b'" "bbbb")
 ("n1 = 2
n2 = 4
s = 's'"
  ("n1 * n2" 8)
  ("s * n1" "ss")
  ("n1 * s" "ss"))
 )

(pyel-create-tests
 pow-op
 ("3 ** 4" 81)
 ("n1 = 2
n2 = 4"
  ("n1 ** n2" 16)))

(pyel-create-tests
 div-op
 ("9 / 4" 2.25)
 ("9 // 4" 2)
 ("a = 9
b = 4"
  ("a / b" 2.25)
  ("a // b" 2))
 )

(pyel-create-tests
 bin-ops
 ("3 & 5" 0)
 ("3 | 5" 7)
 ("3 ^ 5" 6)
 ("a = 3
b = 5"
  ("a & b" 0)
  ("a | b" 7)
  ("a ^ b" 6)))

(pyel-create-tests
 mod-op
 ("5 % 3" 2)
 ("a = 3
b = 5"
  ("b % a" 2)))

(pyel-create-tests
subscript
 ;;load index====
 ;;string
 "a = '1X23'
assert a[1] == 'X'"
 ;;list
 "a = [1,2,3,4]
assert a[1] == 2"
 ;;vector
 "a = (1,2,3,4)
assert a[1] == 2"
 ;;object
 "class a:
