pyel.org
*** transform
#+Begin_SRC emacs-lisp :tangle pyel-transforms.el
  (defclass PySlice nil ;;TODO: name?
    ((start :initarg :start)
     (end :initarg :end)
     (step :initarg :step)))
  
  (def-transform index pyel ()
    (lambda (value &optional line col)
      (transform value)))
  
  (def-transform slice pyel ()
    (lambda (lower upper step)
      (PySlice "slice"
               :start (transform lower)
               :end (transform upper)
               :step (transform step))))
  
  (def-transform subscript pyel ()
    (lambda (value slice ctx &optional line col)
      (pyel-subscript value slice ctx line col)))
  
  (pyel-dispatch-func subscript-load-index (name value)
                      (list _) -> (nth value name)
                      (object _) -> (--getitem-- name value)
                      (vector _) -> (aref name value)
                      (string _) -> (char-to-string (aref name value))
                      (hash _) -> (gethash value name))
  
  (pyel-dispatch-func subscript-load-slice (name start end step)
                      (object _ _ _) -> (--getitem-- name (PySlice "slice"
                                                                   :start start
                                                                   :end  end
                                                                   :step  step))
                      ;;TODO implement step
                      (_ _ _ _) -> (subseq name start end))
  
  (pyel-dispatch-func subscript-store-slice (name start end step assign)
                      (object _ _ _) -> (--setitem-- name
                                                     (PySlice "slice"
                                                              :start start
                                                              :end  end
                                                              :step  step)
                                                     assign)
  
                      ;;TODO implement step
                      (_ _ _ _) -> (setf (subseq name start end) assign))
  
  (pyel-dispatch-func subscript-store-index (name value assign)
                      (list _) -> (setf (nth value name) assign)
                      (object _) -> (--setitem-- name value assign)
                      (vector _) -> (setf (aref name value) assign)
                      (hash _) -> (puthash value assign name))
  ;;                  (string _) -> not supported in python
  
  (defun pyel-subscript (value slice ctx &optional line col)
    (let* (;(value (transform value))
           (slice (transform slice))
           (ctx (cond ((context-p 'force-load) 'load)
                      ((context-p 'force-store) 'store)
                      (t (eval ctx))))
           start stop step)
  
      (when (object-p slice)
        (setq start (oref slice start)
              stop (oref slice end)
              step (oref slice step)))
      (if (eq ctx 'load)
          (if (object-p slice)
              (call-transform 'subscript-load-slice value start stop step) ;;load slice
            (call-transform 'subscript-load-index value slice)) ;;load index
        ;;else: store
        (if (object-p slice)
            (call-transform 'subscript-store-slice value start stop step assign-value)
          (call-transform 'subscript-store-index value slice assign-value)) ;;load index
  
        ;;      (test value start stop step assign-value)
        )))
#+END_SRC
*** python ast
#+Begin_SRC python :tangle py-ast.py
  def Slice(lower, upper, step):
      step = step or "nil"
      lower = lower or 0
      upper = upper or "nil"
      return l_str(["slice", lower, upper, step])

  def Index(value, lineno='nil', col_offset='nil'):
      return "(index " + value + " " + str(lineno) + " " + str(col_offset) + ")"

  def Subscript(value, slice, ctx, lineno='nil', col_offset='nil'):
      return ll_str(["subscript", value, slice, ctx, lineno, col_offset])
#+END_SRC
*** python el lib
#+Begin_SRC emacs-lisp :tangle py-lib.el

#+END_SRC
*** tests
#+Begin_SRC emacs-lisp :tangle pyel-tests.el
  (pyel-create-tests
  subscript
   ;;load index====
   ;;string
   "a = '1X23'
  assert a[1] == 'X'"
   ;;list
   "a = [1,2,3,4]
  assert a[1] == 2"
   ;;vector
   "a = (1,2,3,4)
  assert a[1] == 2"
   ;;object
   "class a:
   def __getitem__ (self, value):
    return value + 4
  x = a()
  assert x[1] == 5"
   ;;=load slice====
   ;;vector
   "a = (1,2,3,4,5)
  assert a[1:4] == (2,3,4)
  assert a[:4] == (1,2,3,4)
  assert a[2:] == (3,4,5)
  assert a[:] == (1,2,3,4,5)"
   ;;list
   "a = [1,2,3,4,5]
  assert a[1:4] == [2,3,4]
  assert a[:4] == [1,2,3,4]
  assert a[2:] == [3,4,5]
  assert a[:] == [1,2,3,4,5]"
   ;;strings
   "a = '012345678'
  assert a[1:4] == '123'
  assert a[:4] == '0123'
  assert a[2:] == '2345678'
  assert a[:] == '012345678'"
   ;;object
   "class a:
   def __getitem__ (self, value):
    return value.start + value.end
  x = a()
  assert x[1:2] == 3
  assert x[5:7] == 12"

   ;;store index
   ;; list
   "def __add(a,b):
   return a+b
  a = [1,2,3,4]
  a[0] = __add(a[1],a[2])
  assert a[0] == 5
  a[2] = 'str'
  assert a[2] == 'str'"
   ;;vector
   "a = (1,2,3,4)
  a[0] = a[1] + a[2]
  assert aa[0] == 5
  a[2] = 'str'
  assert a[2] == 'str'"
   ;;object
   "class a:
   def __setitem__ (self, index, value):
    self.index = index
    self.value = value
  x = a()
  x[3] = 5
  assert x.index == 3
  assert x.value == 5"

   ;;store slice
   ;;list
   "a = [1,2,3,4,5,6]
  a[1:4] = [5,4,'f']
  assert a == [1,5,4,'f',5,6]
  a[:3] = ['a',4,2.2]
  assert a == ['a',4,2.2,'f',5,6]
  a[3:] = [3,3]
  assert a == ['a', 4, 2.2, 3, 3, 6]#TODO: should == ['a', 4, 2.2, 3, 3]"
   ;;vector
   "a = (1,2,3,4,5,6)
  a[1:4] = (5,4,'f')
  assert a == (1,5,4,'f',5,6)
  a[:3] = ('a',4,2.2)
  assert a == ('a',4,2.2,'f',5,6)
  a[3:] = (3,3)
  assert a == ('a', 4, 2.2, 3, 3, 6)#TODO: should == ('a', 4, 2.2, 3, 3)"
   ;;string
   "a = '123456'
  a[1:4] = '54f'
  assert a == '154f56'
  a[:3] = 'a42'
  assert a == 'a42f56'
  a[3:] = '33'
  assert a == 'a42336'#TODO: should == 'a4233'"
   ;;object
   "class a:
   def __setitem__ (self, index, value):
    self.start = index.start
    self.end = index.end
    self.step = index.step
    self.value = value
  x = a()
  x[2:3] = [1,2,3]
  assert x.start == 2
  assert x.end == 3
  assert x.value == [1,2,3]"

  "a[2] += 3"
  "a[2] += b[3]"

  "[2,3,3][2]"
  "assert [1,2,(3,2,8)][2][2] == 8"
   )
#+END_SRC

** class
*** transform
#+Begin_SRC emacs-lisp :tangle pyel-transforms.el
  (def-transform classdef pyel ()
    (lambda (name bases keywords starargs kwargs
                  body decorator_list &optional line col)
      (pyel-defclass name bases keywords starargs kwargs
                     body decorator_list line col)))
  
  (defun pyel-defclass (name bases keywords starargs kwargs
                             body decorator_list &optional line col)
    (let ((class-def-methods nil) ;; list of methods that are part of this class
          (class-def-slots nil) ;;list of slots that are part of this class
          (class-def-name (transform name))
          (t-bases (mapcar 'transform bases)))
      ;;transform body with the class-def context, the transformed code
      ;;will store its methods and slots in class-def-methods and class-def-slots
      ;;respectively.
      (when (context-p 'function-def)
        (push name let-arglist)
        (push '__defined-in-function-body t-bases))
      (remove-context
       function-def
       (using-context class-def
                      (add-to-list 'pyel-defined-classes name)
                      `(define-class ,name ,t-bases
                         ,@(mapcar 'transform body)
                         )))))
#+END_SRC
*** python ast
#+Begin_SRC python :tangle py-ast.py
  def ClassDef (name, bases, keywords, starargs, kwargs, body, decorator_list, lineno='nil', col_offset='nil'):
    return ll_str(["classdef",
                   name,
                   ll_str(bases),
                   ll_str(keywords),
                   starargs or "nil",
                   kwargs or "nil",
                   ll_str(body),
                   ll_str(decorator_list),
                   lineno, col_offset])
#+END_SRC
*** python el lib
#+Begin_SRC emacs-lisp :tangle py-lib.el

#+END_SRC
