pyel-transforms.el

(defclass PySlice nil ;;TODO: name?
  ((start :initarg :start)
   (end :initarg :end)
   (step :initarg :step)))

(def-transform index pyel ()
  (lambda (value &optional line col)
    (transform value)))

(def-transform slice pyel ()
  (lambda (lower upper step)
    (PySlice "slice"
             :start (transform lower)
             :end (transform upper)
             :step (transform step))))

(def-transform subscript pyel ()
  (lambda (value slice ctx &optional line col)
    (pyel-subscript value slice ctx line col)))

(pyel-dispatch-func subscript-load-index (name value)
                    (list _) -> (nth value name)
                    (object _) -> (--getitem-- name value)
                    (vector _) -> (aref name value)
                    (string _) -> (char-to-string (aref name value))
                    (hash _) -> (gethash value name))

(pyel-dispatch-func subscript-load-slice (name start end step)
                    (object _ _ _) -> (--getitem-- name (PySlice "slice"
                                                                 :start start
                                                                 :end  end
                                                                 :step  step))
                    ;;TODO implement step
                    (_ _ _ _) -> (subseq name start end))

(pyel-dispatch-func subscript-store-slice (name start end step assign)
                    (object _ _ _) -> (--setitem-- name
                                                   (PySlice "slice"
                                                            :start start
                                                            :end  end
                                                            :step  step)
                                                   assign)

                    ;;TODO implement step
                    (_ _ _ _) -> (setf (subseq name start end) assign))

(pyel-dispatch-func subscript-store-index (name value assign)
                    (list _) -> (setf (nth value name) assign)
                    (object _) -> (--setitem-- name value assign)
                    (vector _) -> (setf (aref name value) assign)
                    (hash _) -> (puthash value assign name))
;;                  (string _) -> not supported in python

(defun pyel-subscript (value slice ctx &optional line col)
  (let* (;(value (transform value))
         (slice (transform slice))
         (ctx (cond ((context-p 'force-load) 'load)
                    ((context-p 'force-store) 'store)
                    (t (eval ctx))))
         start stop step)

    (when (object-p slice)
      (setq start (oref slice start)
            stop (oref slice end)
            step (oref slice step)))
    (if (eq ctx 'load)
        (if (object-p slice)
            (call-transform 'subscript-load-slice value start stop step) ;;load slice
          (call-transform 'subscript-load-index value slice)) ;;load index
      ;;else: store
      (if (object-p slice)
          (call-transform 'subscript-store-slice value start stop step assign-value)
        (call-transform 'subscript-store-index value slice assign-value)) ;;load index

      ;;      (test value start stop step assign-value)
      )))

(def-transform classdef pyel ()
  (lambda (name bases keywords starargs kwargs
                body decorator_list &optional line col)
    (pyel-defclass name bases keywords starargs kwargs
                   body decorator_list line col)))

(defun pyel-defclass (name bases keywords starargs kwargs
                           body decorator_list &optional line col)
  (let ((class-def-methods nil) ;; list of methods that are part of this class
        (class-def-slots nil) ;;list of slots that are part of this class
        (class-def-name (transform name))
        (t-bases (mapcar 'transform bases)))
    ;;transform body with the class-def context, the transformed code
    ;;will store its methods and slots in class-def-methods and class-def-slots
    ;;respectively.
    (when (context-p 'function-def)
      (push name let-arglist)
      (push '__defined-in-function-body t-bases))
    (remove-context
     function-def
     (using-context class-def
                    (add-to-list 'pyel-defined-classes name)
                    `(define-class ,name ,t-bases
                       ,@(mapcar 'transform body)
                       )))))

(def-transform assert pyel ()
