pyel.org
*** tests
#+Begin_SRC emacs-lisp :tangle pyel-tests.el
  (pyel-create-tests
   objects
   ("class tclass():
   '''a test class'''
   cvar = 12
   def __init__(self, x):
    self.a = x + 10
   def get(self):
    return self.a
   def set(self,n):
    self.a = n
  x = tclass(4)"
    ("tclass.__name__" "tclass")
    ("tclass.get" (lambda (self) (getattr self a)))
    ("tclass.set" (lambda (self n) (setattr self a n)))
    ("tclass.cvar" 12)
    ("tclass.v = 'hi'" ("tclass.v" "hi"))
    ("tclass.set(tclass, 23)" ("tclass.a" 23))
    ("tclass.set(tclass, 19)" ("tclass.get(tclass)" 19))
    ("tclass.add5 = lambda self: self.cvar + 5" ("tclass.add5" (lambda (self) nil (pyel-+ (getattr self cvar) 5))))
    ("repr(x)" "<class 'object'>")
    ("x.__class__ == tclass" t)
    ("x.__class__.__name__" "tclass")
    ("x.a" 14)
    ("x.a = 2" ("x.a" 2))
    ("x.cvar = 4" (" x.cvar, tclass.cvar" [4 12]))
    ("x.set(10); y = x.get" ("y()" 10))
    ("tclass.sixmore = lambda self: self.a + 6
  y = x.sixmore
  x.a = 2"
     ("y()" 8)))

   ("class one:
   def __init__(self,x):
    self.n = x
   def m(self):
    return self.n + 1
  class two:
   def __init__(self):
    self.other = one(5)
  x = two()"
    ("x.other.n" 5)
    ("x.other.m()" 6)))

  (pyel-create-tests
   special-method-lookup
   ( "class adder:
   def __init__(self, n):
    self.x = n
   def __call__ (self, n):
    return self.x + n
  c = adder(10)
  d = adder(10)
  d.__call__ = lambda : 'hi'"
     ("c(6)" 16)
     ("repr(c.__call__)"
      "<bound method adder.__call__ of adder object at 0x18b071>")
     ("d.__call__" (lambda nil nil "hi"))))
#+END_SRC
** assert
*** transform
;;TODO: have custom option for t/nil value of assert's 2nd parameter

;;TODO: fix this case:
  (pyel "assert (True,1), 'message'")
   -> (assert (vector True 1) t "message")
#+Begin_SRC emacs-lisp :tangle pyel-transforms.el
  (def-transform assert pyel ()
    (lambda (test msg &optional line col)
      (pyel-assert test msg line col)))
  
  (defun pyel-assert (test msg &optional line col)
    `(assert ,(transform test) t ,(transform msg)))
#+END_SRC
*** python ast
#+Begin_SRC python :tangle py-ast.py
  def Assert(test, msg, lineno='nil', col_offset='nil'):
      return ll_str(["assert ", test , msg or "nil", lineno, col_offset])
#+END_SRC
*** tests
#+Begin_SRC emacs-lisp :tangle pyel-tests.el
  (pyel-create-tests assert
                     "assert sldk()"
                     "assert adk,'messsage'")
#+END_SRC
** for loop
*** transform
#+Begin_SRC emacs-lisp :tangle pyel-transforms.el
  (def-transform for pyel ()
    (lambda (target iter body orelse &optional line col)
      (pyel-for target iter body orelse line col)))
  
  ;;TODO: for a,y in thing: ...
  ;;TODO: check if iter is an object, then do the iterator thing
  
  (defun pyel-for (target iter body orelse &optional line col)
    (let ((target (using-context for-loop-target
                                 (if (eq (car target) 'tuple)
                                     (mapcar 'transform (cadr target))
                                   (list (transform target)))))
          (body (using-context for (mapcar 'transform body)))
          (else (mapcar 'transform orelse))) ;;break/continue for else?
      (when else
        (setq body (append body (cons 'else else))))
  
      `(py-for ,@target in ,(transform iter) ,@body)))
  
  ;; (if (eq (car target) 'tuple)
  ;;     "TODO: var unpacking"
  ;;   ;;create a temp target variable
  ;;   ;;in body, unpack that into the provided target variables
  
  ;;   (let* ((continue-for nil)
  ;;          (break-for nil)
  ;;          (code (using-context for (mapcar 'transform body)))
  ;;          (break-code (if break-for '(catch '__break__)
  ;;                        pyel-nothing))
  ;;          (continue-code (if continue-for '(catch '__continue__)
  ;;                           pyel-nothing)))
  ;;     (setq _x break-for)
  ;;     `(,@break-code
  ;;       (loop for ,(using-context for-loop-target
  ;;                                 (transform target))
  ;;             in (py-list ,(transform iter))
  ;;             do (,@continue-code
  ;;                 ,@(mapcar 'transform body)))
  ;;       ,@(mapcar 'transform orelse)))))
  
#+END_SRC
*** python ast
#+Begin_SRC python :tangle py-ast.py
  def For(target, iter, body, orelse, lineno='nil', col_offset='nil'):
      return l_str(["for ", target, iter, ll_str(body), ll_str(orelse), lineno, col_offset])
#+END_SRC
*** python el lib
#+Begin_SRC emacs-lisp :tangle py-lib.el
  (setq pyel-for-loop-code-fns '((cons . pyel-for-loop-list-code)
                                 (vector . pyel-for-loop-vector-code)
                                 (string . pyel-for-loop-string-code)
                                 (object . pyel-for-loop-object-code)))
  
  (defsubst pyel-type-of (obj)
    (if (py-object-p obj)
        'object
      (type-of obj)))
  
  (defmacro py-for (&rest args)
    "(for <targets> in <iter> <body> else <body>)
  else is optional"
    
    ;;TODO: error checking for correct form
    (let* ((targets (pyel-split-list args 'in))
           (args (cdr targets))
           (targets (car targets))
           (iter (pop args)) ;;TODO: must iter be only one form?
           
           (body (pyel-split-list args 'else))
           (else-body (cdr body))
           (body (car body))
           
           (target (cond ((symbolp targets) ;;nil when there are multiple targets
                          targets)
                         ((= (length targets) 1)
                          (car targets))
                         (t nil)))
           
           (unpack-code (unless target
                          (let (ret)
                            (dotimes (i (length targets) (reverse ret))
                              (push `(setq ,(nth i targets)
                                           (nth ,i __target__))
                                    ret)))))
           (unpack-code (cons '(setq __target__ (nth __idx __tmp-list)) unpack-code))
           
           (current-transform-table (get-transform-table 'for-macro))
           __for-continue ;;these are set by the for-macro transforms
           __for-break
           )
      ;;TODO: when multiple targets, check that all lists are the same size
      (setq body (mapcar 'transform body))
      
      ;;TODO: expand to simpler cases when types are known
      
      `(let* ((__iter ,iter)
              (func (cdr (assoc (setq _t (pyel-type-of __iter)) pyel-for-loop-code-fns))))
         (if (null func)
             (error "invalid type")
           (eval (funcall func ',targets __iter ',body ',else-body
                          ,__for-break ,__for-continue) :lexical)))))
  
  
  (defun pyel-for-loop-list-code (targets iter body else-body
                                          &optional break continue)
    (let* ((loop-body `(,@(if (= (length targets) 1)
                              `((setq ,(car targets) (nth __idx __tmp-lst)))
                            ;;unpack-code
                            (cons '(setq __target__ (nth __idx __tmp-lst))
                                  (let (ret)
                                    (dotimes (i (length targets) (reverse ret))
                                      (push `(setq ,(nth i targets)
                                                   (pyel-nth ,i __target__))
                                            ret)))))
                        (setq __idx (1+ __idx))
                        
                        ,@body))
           (loop-body (if continue
                          `((catch '__continue__ ,@loop-body))
                        loop-body))
           
           (while-loop `(while (< __idx __len)
                          ,@loop-body))
           
           (while-loop (if break
                           `(catch '__break__ ,while-loop)
                         while-loop)))
      
      `(let* ((__tmp-lst ',iter)
              ;;      ,@iter-lets
              ;;      ,@next-function-lets
              (__len (length __tmp-lst))
              (__idx 0))
         ,while-loop
         ,@else-body)))
  
  
  (defun pyel-for-loop-string-code (target iter body else-body
                                           &optional break continue)
    (let* ((loop-body `(,@(if (= (length target) 1)
                              `((setq ,(car target)
                                      (pyel-string-nth __tmp-str __idx)))
                            (error "ValueError: need more than 1 value to unpack"))
                        (setq __idx (1+ __idx))
                        ,@body))
           (loop-body (if continue
                          `((catch '__continue__ ,@loop-body))
                        loop-body))
           
           (while-loop `(while (< __idx __len)
                          ,@loop-body))
           
           (while-loop (if break
                           `(catch '__break__ ,while-loop)
                         while-loop)))
      
      `(let* ((__tmp-str ',iter)
              (__len (length __tmp-str))
              (__idx 0))
         ,while-loop
         ,@else-body)))
  
  ;;yes, I'm aware how repetitive it's getting
  
  (defun pyel-for-loop-vector-code (targets iter body else-body
                                            &optional break continue)
    (let* ((loop-body `(,@(if (= (length targets) 1)
                              `((setq ,(car targets) (aref __tmp-lst __idx )))
                            ;;unpack-code
                            (cons '(setq __target__ (aref __tmp-lst __idx))
                                  (let (ret)
                                    (dotimes (i (length targets) (reverse ret))
                                      (push `(setq ,(nth i targets)
                                                   (pyel-nth ,i __target__))
                                            ret)))))
                        (setq __idx (1+ __idx))
  
                        ,@body))
           (loop-body (if continue
                          `((catch '__continue__ ,@loop-body))
                        loop-body))
  
           (while-loop `(while (< __idx __len)
                          ,@loop-body))
  
           (while-loop (if break
                           `(catch '__break__ ,while-loop)
                         while-loop)))
  
      `(let* ((__tmp-lst ',iter)
              ;;      ,@iter-lets
              ;;      ,@next-function-lets
              (__len (length __tmp-lst))
              (__idx 0))
         ,while-loop
         ,@else-body)))
  
  
  (defun pyel-for-loop-object-code (targets object body else-body
                                            &optional break continue)
    (let* ((loop-body `(,@(if (= (length targets) 1)
                              `((setq ,(car targets) (call-method __iter__ --next--)))
                            ;;unpack-code
                            (cons '(setq __target__ (call-method __iter__ --next--))
                                  (let (ret)
                                    (dotimes (i (length targets) (reverse ret))
                                      (push `(setq ,(nth i targets)
                                                   (pyel-nth ,i __target__))
                                            ret)))))
                        ,@body))
           (loop-body (if continue
                          `((catch '__continue__ ,@loop-body))
                        loop-body))
  
           (while-loop `(condition-case nil
                            (while t
                              ,@loop-body)
                          (StopIteration nil)))
  
           (while-loop (if break
                           `(catch '__break__ ,while-loop)
                         while-loop)))
  
      ;;variable __iter is set by calling function
      `(let* (;;(__iter ,object)
              (__iter__ (condition-case nil
                            (call-method __iter --iter--)
                          (AttributeError
                           (py-raise (TypeError (format
                                                 "'%s' object is not iterable"
                                                 (getattr __iter --name--))))))))
         ,while-loop
         ,@else-body)))
  
  
  
  (make-transform-table 'for-macro)
  
  (def-transform break for-macro ()
    (lambda () (setq __for-break t)
      '(throw '__break__ nil)))
  
  (def-transform continue for-macro ()
    (lambda () (setq __for-continue t)
      '(throw '__continue__ nil)))
#+END_SRC
