pyel-tests.el
  ("tclass.__name__" "tclass")
  ("tclass.get" (lambda (self) (getattr self a)))
  ("tclass.set" (lambda (self n) (setattr self a n)))
  ("tclass.cvar" 12)
  ("tclass.v = 'hi'" ("tclass.v" "hi"))
  ("tclass.set(tclass, 23)" ("tclass.a" 23))
  ("tclass.set(tclass, 19)" ("tclass.get(tclass)" 19))
  ("tclass.add5 = lambda self: self.cvar + 5" ("tclass.add5" (lambda (self) nil (pyel-+ (getattr self cvar) 5))))
  ("repr(x)" "<class 'object'>")
  ("x.__class__ == tclass" t)
  ("x.__class__.__name__" "tclass")
  ("x.a" 14)
  ("x.a = 2" ("x.a" 2))
  ("x.cvar = 4" (" x.cvar, tclass.cvar" [4 12]))
  ("x.set(10); y = x.get" ("y()" 10))
  ("tclass.sixmore = lambda self: self.a + 6
y = x.sixmore
x.a = 2"
   ("y()" 8)))

 ("class one:
 def __init__(self,x):
  self.n = x
 def m(self):
  return self.n + 1
class two:
 def __init__(self):
  self.other = one(5)
x = two()"
  ("x.other.n" 5)
  ("x.other.m()" 6)))

(pyel-create-tests
 special-method-lookup
 ( "class adder:
 def __init__(self, n):
  self.x = n
 def __call__ (self, n):
  return self.x + n
c = adder(10)
d = adder(10)
d.__call__ = lambda : 'hi'"
   ("c(6)" 16)
   ("repr(c.__call__)"
    "<bound method adder.__call__ of adder object at 0x18b071>")
   ("d.__call__" (lambda nil nil "hi"))))

(pyel-create-tests assert
                   "assert sldk()"
                   "assert adk,'messsage'")

(pyel-create-tests
 for-loop

 ("x = []
for a in range(5):
 x.append(a)"
  ("x" '(0 1 2 3 4)))

 ;;lists
 ("x = []
for a,b in [[1,2],'34',(5,6)]:
 x.append([a,b])"
  ("x" '((1 2) ("3" "4") (5 6))))

 ("x = []
