pyel-transforms.el
  (lambda (test msg &optional line col)
    (pyel-assert test msg line col)))

(defun pyel-assert (test msg &optional line col)
  `(assert ,(transform test) t ,(transform msg)))

(def-transform for pyel ()
  (lambda (target iter body orelse &optional line col)
    (pyel-for target iter body orelse line col)))

;;TODO: for a,y in thing: ...
;;TODO: check if iter is an object, then do the iterator thing

(defun pyel-for (target iter body orelse &optional line col)
  (let ((target (using-context for-loop-target
                               (if (eq (car target) 'tuple)
                                   (mapcar 'transform (cadr target))
                                 (list (transform target)))))
        (body (using-context for (mapcar 'transform body)))
        (else (mapcar 'transform orelse))) ;;break/continue for else?
    (when else
      (setq body (append body (cons 'else else))))

    `(py-for ,@target in ,(transform iter) ,@body)))

;; (if (eq (car target) 'tuple)
;;     "TODO: var unpacking"
;;   ;;create a temp target variable
;;   ;;in body, unpack that into the provided target variables

;;   (let* ((continue-for nil)
;;          (break-for nil)
;;          (code (using-context for (mapcar 'transform body)))
;;          (break-code (if break-for '(catch '__break__)
;;                        pyel-nothing))
;;          (continue-code (if continue-for '(catch '__continue__)
;;                           pyel-nothing)))
;;     (setq _x break-for)
;;     `(,@break-code
;;       (loop for ,(using-context for-loop-target
;;                                 (transform target))
;;             in (py-list ,(transform iter))
;;             do (,@continue-code
;;                 ,@(mapcar 'transform body)))
;;       ,@(mapcar 'transform orelse)))))
