pyel.org
*** tests
#+Begin_SRC emacs-lisp :tangle pyel-tests.el
  (pyel-create-tests
   for-loop
  
   ("x = []
  for a in range(5):
   x.append(a)"
    ("x" '(0 1 2 3 4)))
  
   ;;lists
   ("x = []
  for a,b in [[1,2],'34',(5,6)]:
   x.append([a,b])"
    ("x" '((1 2) ("3" "4") (5 6))))
  
   ("x = []
  for a,b,c,d in [[1,2,1,1],'34xa',(5,6,'a',1)]:
   x.append([a,b,c,d,a])"
    ("x" '((1 2 1 1 1) ("3" "4" "x" "a" "3") (5 6 "a" 1 5)))) 
  
   ("n = 0
  for a in range(5):
   for b in range(5):
    n = n + a + b"
    ("n" 100))
   
   ("x = []
  for a in range(100):
   if (a % 2 == 0):
    continue
   if a > 10:
    break
   x.append(a)"
    ("x" '(1 3 5 7 9)))
  
   ;;vectors
   ("x = []
  for a in (1,2,3,4):
   x.append(2*a)"
    ("x" '(2 4 6 8)))
  
   ("x = []
  for a,b in ([1,2],'34',(5,6)):
   x.append([a,b])"
    ("x" '((1 2) ("3" "4") (5 6))))
   ("tup = make_vector(20,0)
  for i in range(10):
   tup[i] = i
  x = []
  tup = make_vector(20,0)
  for i in range(20):
   tup[i] = i;
  for a in tup:
   if (a % 2 == 0):
    continue
   if a > 10:
    break
   x.append(a)"
    ("x" '(1 3 5 7 9)))
  
   ("x = []
  for a in 'string':
   x.append(a)"
    ("x" '("s" "t" "r" "i" "n" "g")))
  
   ;;strings
   ("x = []
  c = 0
  def getstr():
   global c
   c+=1
   return 'qwerty'
  for a in getstr():
   x.append(a)"
    ("x" '("q" "w" "e" "r" "t" "y"))
    ("c" 1))
  
   ;;objects
   ("class a:
   x = 5
   def __iter__(self):
    return self
   def __next__(self):
    if self.x > 0:
     ret = str(self.x)
     self.x -= 1
     return ret
    raise StopIteration
  obj = a()
  x = []
  for n in obj:
   x.append(n)"
    ("x" '("5" "4" "3" "2" "1"))))
  
#+END_SRC
** global
*** transform
#+Begin_SRC emacs-lisp :tangle pyel-transforms.el
  (def-transform global pyel ()
    (lambda (names &optional line col)
      (if (context-p 'function-def)
          (progn (mapc (lambda (x) (add-to-list 'global-vars (_to- x))) names)
                 pyel-nothing)
        (pyel-not-implemented "'global' calls outside of function definitions"))))
#+END_SRC
*** python ast
#+Begin_SRC python :tangle py-ast.py
  def Global(names, lineno='nil', col_offset='nil'):
    return l_str(['global', l_str(names), lineno, col_offset])
#+END_SRC
*** tests
#+Begin_SRC emacs-lisp :tangle pyel-tests.el
  (pyel-create-tests global

                     "def a():
   global x
   x = 3
   y = 1"

                     "x = 1
  y = 1
  def func():
   global x
   x = 7
   y = 7
  func()
  assert x == 7
  assert y == 1
  "
                     )
#+END_SRC
** nonlocal
DOC: 'nonlocal' is currently equivalent to 'global'
     It seems to be working fine...
*** transform
#+Begin_SRC emacs-lisp :tangle pyel-transforms.el

 #+END_SRC
*** python ast
#+Begin_SRC python :tangle py-ast.py
  def Nonlocal(names, lineno='nil', col_offset='nil'):
    return l_str(['global', l_str(names), lineno, col_offset])
#+END_SRC
*** tests
#+Begin_SRC emacs-lisp :tangle pyel-tests.el
;;
#+END_SRC
** lambda
*** transform
#+Begin_SRC emacs-lisp :tangle pyel-transforms.el
  (def-transform lambda pyel ()
    (lambda (args body &optional line col)
      (using-context lambda-def
                     (pyel-def "dkl" args body nil nil line col))))
#+END_SRC
*** python ast
#+Begin_SRC python :tangle py-ast.py
  def Lambda(args, body, lineno='nil', col_offset='nil'):
      return ll_str(["lambda", ll_str(args),'('+ll_str(body)+')', lineno, col_offset])
#+END_SRC
*** tests
#+Begin_SRC emacs-lisp :tangle pyel-tests.el
  (pyel-create-tests
   lambda
   ("f = lambda x,y: x+y
  f2 = lambda x,*rest: [x,rest]
  f3 = lambda x, *rest, **k : [x, rest, k]"
    ("f(1,2.3)" 3.3)
    ("f2(1,2,3,4,'asd')" '(1 (2 3 4 "asd")))
    ("repr(f3(1,2,3,4,5,a__=1,b__=2))"
     "[1, [2, 3, 4, 5], {b--: 2, a--: 1}]"))
   ("reduce(lambda a,b:a+b, range(2, 9))" 35))
  
#+END_SRC
** unary op, not, usub
TODO: tests!
*** transform
#+Begin_SRC emacs-lisp :tangle pyel-transforms.el
  (def-transform unary-op pyel ()
    (lambda (op operand &optional line col)
      (call-transform op operand)))
  
  (pyel-dispatch-func not (x)
                      (object) -> (--not-- x) ;;?
                      (_) -> (not x))
  
  (pyel-dispatch-func usub (x)
                      (number) -> (- x)
                      (object) -> (--usub-- x) ;;?
                      )
#+END_SRC
*** python ast
#+Begin_SRC python :tangle py-ast.py
  def UnaryOp(op, operand, lineno='nil', col_offset='nil'):
      return l_str(["unary-op ", op, operand, lineno, col_offset])

  def Not():
      return "not"

  def USub():
      return "usub"
#+END_SRC
*** python el lib
#+Begin_SRC emacs-lisp :tangle py-lib.el

#+END_SRC
*** tests
#+Begin_SRC emacs-lisp :tangle pyel-tests.el
;;
#+END_SRC
** augmented assignment
*** transform
#+Begin_SRC emacs-lisp :tangle pyel-transforms.el
  (def-transform aug-assign pyel (target op value)
    (lambda (target op value &optional line col)
      (call-transform 'assign
                      `(,target)
                      (call-transform  op
                                       ;;TODO: what if this is something else
                                       ;;other then a simple name?
                                       ;;=> ok as long as nothing acknowledges
                                       ;;   the  force-load context
                                       (using-context force-load
                                                      (transform target))
                                       value))))
#+END_SRC
*** python ast
#+Begin_SRC python :tangle py-ast.py
  def AugAssign(target, op, value, lineno='nil', col_offset='nil'):
      return l_str(['aug-assign', target, op, value, lineno, col_offset])
#+END_SRC
*** python el lib
#+Begin_SRC emacs-lisp :tangle py-lib.el

#+END_SRC
*** tests
#+Begin_SRC emacs-lisp :tangle pyel-tests.el
  (pyel-create-tests
   aug-assign
   ("x = 2"
    ("x += 3" ("x" 5))
    ("x *= 3" ("x" 6))
    ("x -= 1" ("x" 1))
    ("x /= 4" ("x" 0.5)))
  
   ("x = [2]"
    ("x[0] += 3" ("x[0]" 5))
    ("x[0] *= 3" ("x[0]" 6))
    ("x[0] -= 1" ("x[0]" 1))
    ("x[0] /= 4" ("x[0]" 0.5)))
  
   ("class a:
   x = 2"
    ("a.x += 3" ("a.x" 5))
    ("a.x *= 3" ("a.x" 6))
    ("a.x -= 1" ("a.x" 1))
    ("a.x /= 4" ("a.x" 0.5)))
   )  
#+END_SRC
** return
*** transform
#+Begin_SRC emacs-lisp :tangle pyel-transforms.el
  (def-transform return pyel ()
    (lambda (value &optional line col)
  
      (if (context-p 'tail-context)
          (transform value)
        (setq return-middle t)
        `(throw '__return__ ,(transform value)))))
#+END_SRC
*** python ast
#+Begin_SRC python :tangle py-ast.py
  def Return(value, lineno='nil', col_offset='nil'):
      return "(return " + str(value) + " " + str(lineno) + " " + str(col_offset)+ ")"
#+END_SRC
*** tests
#+Begin_SRC emacs-lisp :tangle pyel-tests.el
;;
#+END_SRC
** break and continue
*** transform
#+Begin_SRC emacs-lisp :tangle pyel-transforms.el
  (def-transform break pyel ()
    (lambda (&optional line col)
      ;;TODO verify that it is ok to just use one inter-template var for this
      (context-switch
       (while (setq break-while t)
         '(throw '__break__ nil))
       (for (setq break-for t)
            '(break)))))
  
  (def-transform continue pyel ()
    (lambda (&optional line col)
      ;;TODO verify that it is ok to just use one inter-template var for this
      (context-switch
       (while (setq continue-while t)
         '(throw '__continue__ nil))
       (for (setq continue-for t)
            '(continue)))))
#+END_SRC
*** python ast
#+Begin_SRC python :tangle py-ast.py
  def Break(lineno=None, col_offset=None):
      return l_str(["break", lineno, col_offset])

  def Continue(lineno=None, col_offset=None):
      return l_str(["continue", lineno, col_offset])
#+END_SRC
*** tests
#+Begin_SRC emacs-lisp :tangle pyel-tests.el
  (pyel-create-tests
   break
   ("x = 0
  while x < 10:
   x = x + 1
   if x == 3:
    break"
    ("x" 3))
  
   ("x = [0]
  c = 0
  while c < 3:
   c = c + 1
   y = 0
   while y < 10:
    y = y + 1
    x.append(y)
    if y == 3:
     x.append('b')
     break"
    ("x" '(0 1 2 3 "b" 1 2 3 "b" 1 2 3 "b"))))
  
  (pyel-create-tests 
   continue
   ("l = [0]
  y = 8;
  while y > 0:
   y = y -1
   if y % 2 == 0:
    continue
   l.append(y)"
    ("l"  '(0 7 5 3 1)))
  
   ("x = [0]
  c = 0
  while c < 3:
   c = c + 1
   y = 0
   while y < 5:
    y = y + 1
    if y % 2 == 0:
     x.append('c')
     continue
    x.append(y)"
    ("x" '(0 1 "c" 3 "c" 5 1 "c" 3 "c" 5 1 "c" 3 "c" 5))))
#+END_SRC
** exception handler
*** transform
#+Begin_SRC emacs-lisp :tangle pyel-transforms.el
  (def-transform except-handler pyel (type name body)
    ;;TODO: name?
    (lambda (type name body &optional line col)
      `(,(or (transform type) 'error)
        ,@(mapcar 'transform body))))
#+END_SRC
*** python ast
#+Begin_SRC python :tangle py-ast.py
  def ExceptHandler(type, name, body, lineno='nil', col_offset='nil'):
      return l_str(["except-handler", type or 'nil', name or 'nil', l_str(body), lineno, col_offset])
#+END_SRC

*** tests
#+Begin_SRC emacs-lisp :tangle pyel-tests.el
;;
#+END_SRC

** try except
*** transform
#+Begin_SRC emacs-lisp :tangle pyel-transforms.el
  (def-transform try pyel (body handlers orelse)
    ;;TODO: orelse
    (lambda (body handlers orelse &optional line col)
      (let ((body (mapcar 'transform body)))
        (if (> (length body) 1)
            (setq body (cons 'progn body))
          (setq body (car body)))
        `(condition-case nil
             ,body
             ,@(mapcar 'transform handlers)))))
#+END_SRC
*** python ast
#+Begin_SRC python :tangle py-ast.py
  def TryExcept(body, handlers, orelse, lineno='nil', col_offset='nil'):
      return l_str(["try", l_str(body), l_str(handlers), l_str(orelse), lineno, col_offset])
#+END_SRC
*** python el lib
#+Begin_SRC emacs-lisp :tangle py-lib.el

#+END_SRC
