pyel-tests.el
for a,b,c,d in [[1,2,1,1],'34xa',(5,6,'a',1)]:
 x.append([a,b,c,d,a])"
  ("x" '((1 2 1 1 1) ("3" "4" "x" "a" "3") (5 6 "a" 1 5)))) 

 ("n = 0
for a in range(5):
 for b in range(5):
  n = n + a + b"
  ("n" 100))
 
 ("x = []
for a in range(100):
 if (a % 2 == 0):
  continue
 if a > 10:
  break
 x.append(a)"
  ("x" '(1 3 5 7 9)))

 ;;vectors
 ("x = []
for a in (1,2,3,4):
 x.append(2*a)"
  ("x" '(2 4 6 8)))

 ("x = []
for a,b in ([1,2],'34',(5,6)):
 x.append([a,b])"
  ("x" '((1 2) ("3" "4") (5 6))))
 ("tup = make_vector(20,0)
for i in range(10):
 tup[i] = i
x = []
tup = make_vector(20,0)
for i in range(20):
 tup[i] = i;
for a in tup:
 if (a % 2 == 0):
  continue
 if a > 10:
  break
 x.append(a)"
  ("x" '(1 3 5 7 9)))

 ("x = []
for a in 'string':
 x.append(a)"
  ("x" '("s" "t" "r" "i" "n" "g")))

 ;;strings
 ("x = []
c = 0
def getstr():
 global c
 c+=1
 return 'qwerty'
for a in getstr():
 x.append(a)"
  ("x" '("q" "w" "e" "r" "t" "y"))
  ("c" 1))

 ;;objects
 ("class a:
 x = 5
 def __iter__(self):
  return self
 def __next__(self):
  if self.x > 0:
   ret = str(self.x)
   self.x -= 1
   return ret
  raise StopIteration
obj = a()
x = []
for n in obj:
 x.append(n)"
  ("x" '("5" "4" "3" "2" "1"))))

(pyel-create-tests global

                   "def a():
 global x
 x = 3
 y = 1"

                   "x = 1
y = 1
def func():
 global x
 x = 7
 y = 7
func()
assert x == 7
assert y == 1
"
                   )

;;

(pyel-create-tests
 lambda
 ("f = lambda x,y: x+y
f2 = lambda x,*rest: [x,rest]
f3 = lambda x, *rest, **k : [x, rest, k]"
  ("f(1,2.3)" 3.3)
  ("f2(1,2,3,4,'asd')" '(1 (2 3 4 "asd")))
  ("repr(f3(1,2,3,4,5,a__=1,b__=2))"
   "[1, [2, 3, 4, 5], {b--: 2, a--: 1}]"))
 ("reduce(lambda a,b:a+b, range(2, 9))" 35))

;;

(pyel-create-tests
 aug-assign
 ("x = 2"
  ("x += 3" ("x" 5))
  ("x *= 3" ("x" 6))
  ("x -= 1" ("x" 1))
  ("x /= 4" ("x" 0.5)))

 ("x = [2]"
  ("x[0] += 3" ("x[0]" 5))
  ("x[0] *= 3" ("x[0]" 6))
  ("x[0] -= 1" ("x[0]" 1))
  ("x[0] /= 4" ("x[0]" 0.5)))

 ("class a:
 x = 2"
  ("a.x += 3" ("a.x" 5))
  ("a.x *= 3" ("a.x" 6))
  ("a.x -= 1" ("a.x" 1))
  ("a.x /= 4" ("a.x" 0.5)))
 )

;;

(pyel-create-tests
 break
 ("x = 0
while x < 10:
 x = x + 1
 if x == 3:
  break"
  ("x" 3))

 ("x = [0]
c = 0
while c < 3:
 c = c + 1
 y = 0
 while y < 10:
  y = y + 1
  x.append(y)
  if y == 3:
   x.append('b')
   break"
  ("x" '(0 1 2 3 "b" 1 2 3 "b" 1 2 3 "b"))))

(pyel-create-tests 
 continue
 ("l = [0]
y = 8;
while y > 0:
 y = y -1
 if y % 2 == 0:
  continue
 l.append(y)"
  ("l"  '(0 7 5 3 1)))

 ("x = [0]
c = 0
while c < 3:
 c = c + 1
 y = 0
 while y < 5:
  y = y + 1
  if y % 2 == 0:
   x.append('c')
   continue
  x.append(y)"
  ("x" '(0 1 "c" 3 "c" 5 1 "c" 3 "c" 5 1 "c" 3 "c" 5))))

;;
