pyel-transforms.el

(def-transform global pyel ()
  (lambda (names &optional line col)
    (if (context-p 'function-def)
        (progn (mapc (lambda (x) (add-to-list 'global-vars (_to- x))) names)
               pyel-nothing)
      (pyel-not-implemented "'global' calls outside of function definitions"))))



(def-transform lambda pyel ()
  (lambda (args body &optional line col)
    (using-context lambda-def
                   (pyel-def "dkl" args body nil nil line col))))

(def-transform unary-op pyel ()
  (lambda (op operand &optional line col)
    (call-transform op operand)))

(pyel-dispatch-func not (x)
                    (object) -> (--not-- x) ;;?
                    (_) -> (not x))

(pyel-dispatch-func usub (x)
                    (number) -> (- x)
                    (object) -> (--usub-- x) ;;?
                    )

(def-transform aug-assign pyel (target op value)
  (lambda (target op value &optional line col)
    (call-transform 'assign
                    `(,target)
                    (call-transform  op
                                     ;;TODO: what if this is something else
                                     ;;other then a simple name?
                                     ;;=> ok as long as nothing acknowledges
                                     ;;   the  force-load context
                                     (using-context force-load
                                                    (transform target))
                                     value))))

(def-transform return pyel ()
  (lambda (value &optional line col)

    (if (context-p 'tail-context)
        (transform value)
      (setq return-middle t)
      `(throw '__return__ ,(transform value)))))

(def-transform break pyel ()
  (lambda (&optional line col)
    ;;TODO verify that it is ok to just use one inter-template var for this
    (context-switch
     (while (setq break-while t)
       '(throw '__break__ nil))
     (for (setq break-for t)
          '(break)))))

(def-transform continue pyel ()
  (lambda (&optional line col)
    ;;TODO verify that it is ok to just use one inter-template var for this
    (context-switch
     (while (setq continue-while t)
       '(throw '__continue__ nil))
     (for (setq continue-for t)
          '(continue)))))

(def-transform except-handler pyel (type name body)
  ;;TODO: name?
  (lambda (type name body &optional line col)
    `(,(or (transform type) 'error)
      ,@(mapcar 'transform body))))

(def-transform try pyel (body handlers orelse)
  ;;TODO: orelse
  (lambda (body handlers orelse &optional line col)
    (let ((body (mapcar 'transform body)))
      (if (> (length body) 1)
          (setq body (cons 'progn body))
        (setq body (car body)))
      `(condition-case nil
           ,body
           ,@(mapcar 'transform handlers)))))

;;a not in b
