pyel.org
*** tests
#+Begin_SRC emacs-lisp :tangle pyel-tests.el
  (pyel-create-tests
   try
   ("a = ''
  try:
   1 / 0
   a = 'yes'
  except:
   a = 'no'
  
  b = ''
  try:
   b = 'a'
   [1,3][23]
  except:
   try:
    1/0
   except:
    b = 'ok'
  
  c = ''
  try:
   c = 'y'
  except:
   c = 'n'
  
  try:
   raise IndexError
   d = 2
  except IndexError:
   d = 2233
  except:
   d = 'no'
  
  "
    ("a" "no")
    ("b" "ok")
    ("c" "y")
    ("d" 2233)))
#+END_SRC
** in, not in
*** transform
#+Begin_SRC emacs-lisp :tangle pyel-transforms.el
  ;;a not in b
  ;; function:    is_not(a, b)  (in the operator module)
  (pyel-dispatch-func not-in (l r)
                      (_ list) -> (not (py-list-member l r))
                      (_ string) -> (not (py-string-member l r))
                      (_ object) -> (not (py-object-member l r))
                      (_ vector) -> (not (py-vector-member l r)))
  
  ;;a in b
  ;; function:    is_(a, b)
  (pyel-dispatch-func in (l r)
                      (_ list) -> (py-list-member l r)
                      (_ string) -> (py-string-member l r)
                      (_ object) -> (py-object-member l r)
                      (_ vector) -> (py-vector-member l r))
#+END_SRC
*** python el lib
#+Begin_SRC emacs-lisp :tangle py-lib.el
  (defun py-vector-member (elt vector)
    "Return non-nil if ELT is an element of VECTOR. Comparison done with `equal'."
    (let ((i 0)
          (len (length vector))
          found)
      (while (and (not found)
                  (< i len))
        (if (equal (elt vector i) elt)
            (setq found t)
          (setq i (1+ i))))
      found))
  
  (defsubst py-list-member (elt list)
    (if (member elt list) t nil))
  
  (defun py-string-member (s string)
    "Return non-nil if S is a substring of STRING"
    (and (stringp s) (if (string-match (regexp-quote s) string) t nil)))
  
  (defun py-object-member (elt obj)
    ;;https://docs.python.org/3/reference/expressions.html#membership-test-details
    (if (py-object-p obj)
        (if (obj-hasattr obj --contains--)
            (call-method obj --contains-- elt)
  
          ;;else: try iteration via __iter__
          (let ((iter (condition-case nil
                          (call-method obj --iter--)
                        (AttributeError nil)))
                (not-found t)
                (i -1) val)
            (if iter
                (condition-case nil
                    (while not-found
                      (setq val (call-method iter --next--))
                      (if (or (eq val elt) (equal val elt))
                          (setq not-found nil)))
                  (StopIteration nil))
              ;;else: try old-style iteration protocol if __getitem__ is defined
              (if (obj-hasattr obj --getitem--)
                  (condition-case nil
                      (while not-found
                        (setq val (call-method obj --getitem-- (setq i (1+ i))))
                        (if (or (eq val elt) (equal val elt))
                            (setq not-found nil))
  
                        )
                    (IndexError nil))
                ;;else: not iterable
                (py-raise (TypeError
                           (format "argument of type '%s' is not iterable" (py-type obj))))))
            (not not-found)))
      ;;else: not an object
      (error (format "py-object-member: invalid type for OBJ parameter (%s)"
                     (type-of obj)))))
#+END_SRC
*** tests
#+Begin_SRC emacs-lisp :tangle pyel-tests.el
  (pyel-create-tests
   in
   ;;lists
   ("3 in range(3)" t)
   ("'s' in range(3)" nil)
   ("'s' in [1,2,'s',3]" t)
   ;;vectors
   ("1 in [3,1,2]" t)
   ("'s' in (4,2,'s','x')" t)
   ("'s' in (4,2,'ss','x')" nil)
   ("[1,2,3][1] in [1,3,[3,2,1]][2]" t)
   ;;strings
   ("'s' in 'string'" t)
   ("'q' in 'string'" nil)
   ("'tri' in 'string'" t)
   ;;objects
   ;;with __contains__
   ("class tst():
   x = [1,2,3,4]
   def __contains__(self,e):
    return e in self.x
  x = tst()"
    ("3 in x" t)
    ("3 not in x" nil)
    ("2 in [x][0]" t))
   ;;with __iter__
   ("class tst2:
   x = [1,2,3,4]
   def __iter__(self):
    self.i = 0
    self.max = len(self.x)
    return self
   def __next__(self):
    i = self.i
    __i = i
    __m = self.max
    if i < self.max:
      ret = self.x[i]
      self.i = i+1
      return ret
    else:
     raise StopIteration
  o = tst2()"
    ("3 in o" t)
    ("33 not in o" t)
    ("3 not in o" nil)
    ("33 in o" nil))
   ;;with __getitem__
   ("class tst3:
   x = [5,6,7,8]
   def __getitem__(self, index):
    if type(index) == int and index >= 0 and index < len(self.x):
     return self.x[index];
    else:
     raise IndexError
  o = tst3()
  x = []
  for i in range(10):
   if i in o:
    x.append(i)"
    ("3 in o" nil)
    ("7 in o" t)
    ("7 not in o" nil)
    ("12 not in o" t)
    ("x" '(5 6 7 8)))
   )
  
  (pyel-create-tests
   not-in
   ;;lists
   ("3 not in range(3)" nil)
   ("'s' not in range(3)" t)
   ("'s' not in [1,2,'s',3]" nil)
   ;;vectors
   ("1 not in [3,1,2]" nil)
   ("'s' not in (4,2,'s','x')" nil)
   ("'s' not in (4,2,'ss','x')" t)
   ("[1,2,3][1] in [1,3,[3,2,1]][2]" nil)
   ;;strings
   ("'s' not in 'string'" nil)
   ("'q' not in 'string'" t)
   ("'tri' not in 'string'" nil)
   ;;objects tests are part of the 'in' tests
   )
  
#+END_SRC
** comprehensions
DOC: generator expressions are translated to list comprehensions
*** transform
#+Begin_SRC emacs-lisp :tangle pyel-transforms.el
  (def-transform comprehension pyel (target iter ifs)
    (lambda (target iter ifs) (pyel-comprehension target iter ifs)))
  
  (defun pyel-comprehension (target iter ifs)
    ;;this uses the inter-transform var 'comprehension-body'
    (assert (boundp 'comprehension-body)
            "`comprehension-body' must be defined for this transform")
    ;;TODO: ifs
    `(loop for ,(using-context for-loop-target
                               (transform target))
           in (py-list ,(transform iter))
           ,(if ifs
                (list '@ 'if
                         (cons (if (> (length ifs) 1)
                                   'and
                                 '@)
                               (mapcar 'transform ifs)))
              pyel-nothing)
           do ,comprehension-body))
  
  (def-transform list-comp pyel (elt generators)
    (lambda (elt generators &optional line col)
      (pyel-list-comp elt generators line col)))
  
  (defun pyel-list-comp (elt generators &optional line col)
    (let* ((list-var '__list__)
           (comprehension-body `(setq ,list-var (cons ,(transform elt) ,list-var)))
           (i (length generators))
           code)
      ;;`comprehension-body' is an inter-transform var
      (while (> i 0)
        (setq i (1- i))
        ;;'comprehension-body' holds the inner code, and each transform
        ;; is the inner code for the preceding generator in 'generators'
        ;; (loop ... collect ...) produces a list, so no additional work is needed
        (setq comprehension-body (transform (nth i generators))))
  
      `(let ((,list-var nil))
         ,comprehension-body
         (reverse ,list-var))))
  
  (def-transform dict-comp pyel (key value generators)
    (lambda (key value generators &optional line col)
      (pyel-dict-comp key value generators line col)))
  
  (defun pyel-dict-comp (key value generators &optional line col)
    (let* ((hash-var '__dict__)
           (comprehension-body (list 'puthash (transform key)
                                     (transform value)
                                     hash-var))
           (i (length generators))
           code)
      (while (> i 0)
        (setq i (1- i))
        (setq comprehension-body (transform (nth i generators))))
  
      `(let ((,hash-var (make-hash-table :test 'equal)))
         ,comprehension-body
         ,hash-var)))
#+END_SRC
*** python ast
#+Begin_SRC python :tangle py-ast.py
  def comprehension(target, iter, ifs):
      return l_str(["comprehension", target, iter, l_str(ifs)])

  def GeneratorExp(elt, generators, lineno='nil', col_offset='nil'):
      return l_str(["list-comp", elt, l_str(generators), lineno, col_offset])

  def ListComp(elt, generators, lineno='nil', col_offset='nil'):
      return l_str(["list-comp", elt, l_str(generators), lineno, col_offset])

  def DictComp(key, value, generators, lineno='nil', col_offset='nil'):
      return l_str(["dict-comp", key, value, l_str(generators), lineno, col_offset])

  def SetComp(elt, generators, lineno='nil', col_offset='nil'):
      return "(unimplemented \"set comprehension\")"
#+END_SRC
*** python el lib
#+Begin_SRC emacs-lisp :tangle py-lib.el

#+END_SRC
*** tests
#+Begin_SRC emacs-lisp :tangle pyel-tests.el
  (pyel-create-tests
   list-comprehensions
   ("[x*x for x in range(10)]" '(0 1 4 9 16 25 36 49 64 81))
   ("[x*x for x in range(10) if x > 5]" '(36 49 64 81))
   ("[x*x for x in range(10) if x > 5 if x < 8]" '(36 49))
  
   ("[(x, y) for x in [1,2,3] for y in [3,1,4] if x != y]" '([1 3] [1 4] [2 3] [2 1] [2 4] [3 1] [3 4]))
  
   ("matrix = [[1, 2, 3, 4],[5, 6, 7, 8],[9, 10, 11, 12],]
  transposed = []
  for i in range(4):
   transposed.append([row[i] for row in matrix])"
    
    ("[[row[i] for row in matrix] for i in range(4)]"
     '((1 5 9) (2 6 10) (3 7 11) (4 8 12)))
    ("transposed" '((1 5 9) (2 6 10) (3 7 11) (4 8 12)))))

  
  (pyel-create-tests
   dict-comprehensions
   ("str({x:x*x for x in range(5)})" "{0: 0, 1: 1, 2: 4, 3: 9, 4: 16}")
   ("x = {x: [y*y for y in range(x)] for x in range(20)}"
    ("hash_table_count(x)" 20)
    ("x[3],x[5],x[10]" [(0 1 4) (0 1 4 9 16) (0 1 4 9 16 25 36 49 64 81)])))
#+END_SRC

** boolop, and, or
*** transform
#+Begin_SRC emacs-lisp :tangle pyel-transforms.el
  (def-transform boolop pyel (op values)
    (lambda (op values &optional line col)
      (cons op (mapcar 'transform values))))
#+END_SRC
*** python ast
#+Begin_SRC python :tangle py-ast.py
  def BoolOp(op, values, lineno='nil', col_offset='nil'):
      return l_str(["boolop", op, l_str(values), lineno, col_offset])
  def Or():
      return "or"
  def And():
      return "and"
#+END_SRC
*** tests
#+Begin_SRC emacs-lisp :tangle pyel-tests.el
  (pyel-create-tests boolop
                     "a or b"
                     "a or b or c"
                     "a.c or b.c() or a[2]"
                     "a and b"
                     "a and b or c"
                     "a[2] and b.f() or c.e"
                     "a.e and b[2] or c.e() and 2 ")
#+END_SRC
** pass
*** transform
#+Begin_SRC emacs-lisp :tangle pyel-transforms.el
  (def-transform pass pyel ()
    (lambda (&optional line col) nil))
#+END_SRC
*** python ast
#+Begin_SRC python :tangle py-ast.py
  def Pass(lineno=None, col_offset=None):
      return l_str(["pass", lineno, col_offset])
#+END_SRC
*** tests
#+Begin_SRC emacs-lisp :tangle pyel-tests.el
;;
#+END_SRC
** unimplemented
This will help notify the user when some syntax has not been implemented
*** transform
#+Begin_SRC emacs-lisp :tangle pyel-transforms.el
  (def-transform unimplemented pyel (name)
    (lambda (name)
      (pyel-notify-error "Set comprehensions have not been implemented")
      pyel-error-string))
#+END_SRC
*** python el lib
#+Begin_SRC emacs-lisp :tangle py-lib.el

#+END_SRC
