pyel-tests.el

(pyel-create-tests try
                   "x = ''
try:
 1 / 0
 x = 'yes'
except:
 x = 'no'
assert x == 'no'"

                   "try:
 _a()
except:
 try:
  _x()
 except:
  _b()"
                   )

;;

(pyel-create-tests
 list-comprehensions
 ("[x*x for x in range(10)]" '(0 1 4 9 16 25 36 49 64 81))
 ("[x*x for x in range(10) if x > 5]" '(36 49 64 81))
 ("[x*x for x in range(10) if x > 5 if x < 8]" '(36 49))

 ("[(x, y) for x in [1,2,3] for y in [3,1,4] if x != y]" '([1 3] [1 4] [2 3] [2 1] [2 4] [3 1] [3 4]))

 ("matrix = [[1, 2, 3, 4],[5, 6, 7, 8],[9, 10, 11, 12],]
transposed = []
for i in range(4):
 transposed.append([row[i] for row in matrix])"
  
  ("[[row[i] for row in matrix] for i in range(4)]"
   '((1 5 9) (2 6 10) (3 7 11) (4 8 12)))
  ("transposed" '((1 5 9) (2 6 10) (3 7 11) (4 8 12)))))


(pyel-create-tests
 dict-comprehensions
 ("str({x:x*x for x in range(5)})" "{0: 0, 1: 1, 2: 4, 3: 9, 4: 16}")
 ("x = {x: [y*y for y in range(x)] for x in range(20)}"
  ("hash_table_count(x)" 20)
  ("x[3],x[5],x[10]" [(0 1 4) (0 1 4 9 16) (0 1 4 9 16 25 36 49 64 81)])))

(pyel-create-tests boolop
                   "a or b"
                   "a or b or c"
                   "a.c or b.c() or a[2]"
                   "a and b"
                   "a and b or c"
                   "a[2] and b.f() or c.e"
                   "a.e and b[2] or c.e() and 2 ")

;;

;;

(pyel-create-tests conditional-expressions
                   "1 if True else 0"
