pyel-transforms.el
;; function:    is_not(a, b)  (in the operator module)
(pyel-dispatch-func not-in (l r)
                    (_ list) -> (not (py-list-member l r))
                    (_ string) -> (not (py-string-member l r))
                    (_ object) -> (not (py-object-member l r))
                    (_ vector) -> (not (py-vector-member l r)))

;;a in b
;; function:    is_(a, b)
(pyel-dispatch-func in (l r)
                    (_ list) -> (py-list-member l r)
                    (_ string) -> (py-string-member l r)
                    (_ object) -> (py-object-member l r)
                    (_ vector) -> (py-vector-member l r))

(def-transform comprehension pyel (target iter ifs)
  (lambda (target iter ifs) (pyel-comprehension target iter ifs)))

(defun pyel-comprehension (target iter ifs)
  ;;this uses the inter-transform var 'comprehension-body'
  (assert (boundp 'comprehension-body)
          "`comprehension-body' must be defined for this transform")
  ;;TODO: ifs
  `(loop for ,(using-context for-loop-target
                             (transform target))
         in (py-list ,(transform iter))
         ,(if ifs
              (list '@ 'if
                       (cons (if (> (length ifs) 1)
                                 'and
                               '@)
                             (mapcar 'transform ifs)))
            pyel-nothing)
         do ,comprehension-body))

(def-transform list-comp pyel (elt generators)
  (lambda (elt generators &optional line col)
    (pyel-list-comp elt generators line col)))

(defun pyel-list-comp (elt generators &optional line col)
  (let* ((list-var '__list__)
         (comprehension-body `(setq ,list-var (cons ,(transform elt) ,list-var)))
         (i (length generators))
         code)
    ;;`comprehension-body' is an inter-transform var
    (while (> i 0)
      (setq i (1- i))
      ;;'comprehension-body' holds the inner code, and each transform
      ;; is the inner code for the preceding generator in 'generators'
      ;; (loop ... collect ...) produces a list, so no additional work is needed
      (setq comprehension-body (transform (nth i generators))))

    `(let ((,list-var nil))
       ,comprehension-body
       (reverse ,list-var))))

(def-transform dict-comp pyel (key value generators)
  (lambda (key value generators &optional line col)
    (pyel-dict-comp key value generators line col)))

(defun pyel-dict-comp (key value generators &optional line col)
  (let* ((hash-var '__dict__)
         (comprehension-body (list 'puthash (transform key)
                                   (transform value)
                                   hash-var))
         (i (length generators))
         code)
    (while (> i 0)
      (setq i (1- i))
      (setq comprehension-body (transform (nth i generators))))

    `(let ((,hash-var (make-hash-table :test 'equal)))
       ,comprehension-body
       ,hash-var)))

(def-transform boolop pyel (op values)
  (lambda (op values &optional line col)
    (cons op (mapcar 'transform values))))

(def-transform pass pyel ()
  (lambda (&optional line col) nil))

(def-transform unimplemented pyel (name)
  (lambda (name)
    (pyel-notify-error "Set comprehensions have not been implemented")
    pyel-error-string))
