pyel.org
*** tests
#+Begin_SRC emacs-lisp :tangle pyel-tests.el
;;
#+END_SRC
** conditional expressions
*** transform
#+Begin_SRC emacs-lisp :tangle pyel-transforms.el
  (def-transform if-exp pyel ()
    (lambda (test body orelse &optional line col)
      (let ((tst (transform test)))
        `(if ,(if (equal tst []) nil tst)
             ,(transform body)
           ,(transform orelse)))))
#+END_SRC
*** python ast
#+Begin_SRC python :tangle py-ast.py
  def IfExp (test, body, orelse, lineno='nil', col_offset='nil'):
      return l_str(["if-exp", test, body, orelse, lineno, col_offset])
#+END_SRC
*** tests
#+Begin_SRC emacs-lisp :tangle pyel-tests.el
  (pyel-create-tests conditional-expressions
                     "1 if True else 0"
                     "true() if tst() else false()"
                     "a[1] if a[2:2] else a[2]"
                     )
#+END_SRC
** raise
*** transform
#+Begin_SRC emacs-lisp :tangle pyel-transforms.el
  (def-transform raise pyel ()
    (lambda (exc cause &optional line col)
      `(py-raise ,(transform exc)))) ;;TODO: ignoring cause
#+END_SRC
*** python ast
#+Begin_SRC python :tangle py-ast.py
  def Raise(exc, cause, lineno='nil', col_offset='nil'):
      return l_str(["raise", exc, cause or "nil", lineno, col_offset])
#+END_SRC
*** python el lib
#+Begin_SRC emacs-lisp :tangle py-lib.el
  (defun py-raise (exc &optional cause)
    "signal an error with the name of EXC, an class/object
  EXC must be derived from BaseException"
    (if (py-object-p exc)
           ;;;;TODO: after `issubclass' is implemented
        ;; (or (and (py-class-p exc)
        ;;          (issubclass exc BaseException))
        ;;     (and (py-instance-p exc)
        ;;          (issubclass (py-type exc) BaseException)))
        (signal (intern (getattr exc --name--)) exc)
      (signal 'TypeError "TypeError: exceptions must derive from BaseException")))
#+END_SRC
*** tests
#+Begin_SRC emacs-lisp :tangle pyel-tests.el
;;
#+END_SRC
** transform template
*** transform
#+Begin_SRC emacs-lisp :tangle pyel-transforms.el
;;
#+END_SRC
*** python ast
#+Begin_SRC python :tangle py-ast.py

#+END_SRC
*** python el lib
#+Begin_SRC emacs-lisp :tangle py-lib.el

#+END_SRC
*** tests
#+Begin_SRC emacs-lisp :tangle pyel-tests.el
;;
#+END_SRC

* function transforms
** simple name changes
*** transform
#+Begin_SRC emacs-lisp :tangle pyel-transforms.el
  (pyel-translate-function-name 'map 'mapcar)
#+END_SRC
*** tests
#+Begin_SRC emacs-lisp :tangle pyel-tests.el
;;
#+END_SRC

** len
*** transform
#+Begin_SRC emacs-lisp :tangle pyel-transforms.el
  (pyel-func-transform len (thing)
                       (hash)   -> (hash-table-count thing)
                       (object) -> (call-method thing --len--)
                       (_)      -> (length thing))
#+END_SRC
*** tests
#+Begin_SRC emacs-lisp :tangle pyel-tests.el
  (pyel-create-tests
   len-function
   ("a = [1,2,3,'5']
  b = []
  c = 'str'
  d = (1,2,3,4)"
    ("len(a)" 4)
    ("len(b)" 0)
    ("len(c)" 3)
    ("len(d)" 4))
   ("len('')" 0)
   ("len([3,4])" 2)
   ("len({1:'one', 2:'two'})" 2)
   )
#+END_SRC
** range
*** transform
#+Begin_SRC emacs-lisp :tangle pyel-transforms.el
  (push '(range py-range) pyel-function-name-translations)
#+END_SRC
*** python el lib
#+Begin_SRC emacs-lisp :tangle py-lib.el
  (defun py-range (start &optional end step)
   (unless end
    (setq end start
     start 0))
   (number-sequence start (1- end) step))
#+END_SRC
*** tests
#+Begin_SRC emacs-lisp :tangle pyel-tests.el
  (pyel-create-tests
   range-function
   ("range(5)" '(0 1 2 3 4))
   ("range(2,7)" '(2 3 4 5 6))
   ("range(2,20,3)" '(2 5 8 11 14 17)))
#+END_SRC
** input
*** transform
#+Begin_SRC emacs-lisp :tangle pyel-transforms.el
(pyel-translate-function-name 'input 'read-string)
#+END_SRC
** list
*** transform
#+Begin_SRC emacs-lisp :tangle pyel-transforms.el
  (defalias 'py-list 'pyel-list-function)
  (pyel-func-transform list (object)
                       (string) -> (py-string-to-list object)
                       (object) -> (py-object-to-list object)
                       (vector) -> (py-vector-to-list object)
                       (hash)   -> (py-hash-to-list object)
                       (list)   -> (py-copy-list object))
#+END_SRC
*** python el lib
#+Begin_SRC emacs-lisp :tangle py-lib.el
  (defsubst py-string-to-list (string)
    (mapcar 'byte-to-string string))
  
  (defsubst py-vector-to-list (vector)
    (mapcar 'identity vector))
  
  (defsubst py-copy-list (list)
    (copy-list list))
  
  (defun py-object-to-list (object)
    "assumes that py-object(OBJECT) == t"
    (let ((iter (condition-case nil
                    (call-method object --iter--)
                  (AttributeError
                   (py-raise (TypeError (format
                                         "'%s' object is not iterable"
                                         (getattr object --name--)))))))
          list)
      (condition-case nil
          (while t
            (setq list (cons (call-method iter --next--) list)))
        (StopIteration (reverse list)))))
  
  (defun py-hash-to-list (hash)
    (let (keys)
      (maphash (lambda (key value)
                 (setq keys (cons key keys))) hash)
      keys))
#+END_SRC
*** tests
#+Begin_SRC emacs-lisp :tangle pyel-tests.el
  (pyel-create-tests
   list-function
   ("list('string')" '("s" "t" "r" "i" "n" "g"))
   ("list([1,2,'3',(2,)])" '(1 2 "3" [2]))
   ("a = [1]
  b = [a,1]
  c = list(b)"
    ("c is b" nil)
    ("c == b" t)
    ("c[0] is a" t))
  
   ("a = [1]
  b = (a, 1)
  c = list(b)"
    ("c" '((1) 1))
    ("c[0] is a" t))
  
   ("list({1:'one', 2:'two', 3:'three'})" '(3 2 1))
  
   ("list((1,2,3))" '(1 2 3))
   
   ("s = '123'
  l = [1,2,3]
  tu = (1,2,3,)
  d = {1:'1',2:'2',3:'3'}"
    ("list(s)" '("1" "2" "3"))
    ("list(l)" '(1 2 3))
    ("list(tu)" '(1 2 3))
    ("list(d)" '(3 2 1)))
   
   ("class a:
   x = 5
   def __iter__(self):
    return self
   def __next__(self):
    if self.x > 0:
     ret = str(self.x)
     self.x -= 1
     return ret
    raise StopIteration
  obj = a()"
    ("list(obj)" '("5" "4" "3" "2" "1"))))
#+END_SRC
** tuple
*** transform
#+Begin_SRC emacs-lisp :tangle pyel-transforms.el
  (pyel-func-transform tuple (object)
                       (string) -> (py-string-to-vector object)
                       (list)   -> (py-list-to-vector object)
                       (vector) -> (py-copy-vector object)
                       (hash)   -> (py-hash-to-vector object)
                       (object) -> (py-object-to-vector object))
#+END_SRC
*** python el lib
#+Begin_SRC emacs-lisp :tangle py-lib.el
  ;; (defun py-string-to-vector (string)
  ;;   "Return a vector of characters in STRING."
  ;;   (vconcat (mapcar 'byte-to-string string)))
  (defun py-string-to-vector (string)
    "Return a vector of characters in STRING."
    (let* ((v (make-vector (length string) 0))
           (i -1))
      (mapc (lambda (x)
              (aset v (setq i (1+ i)) (byte-to-string x)))
            string)))
  
  (defsubst py-list-to-vector (list)
    "return a vector v such that (aref v i) = (nth i LIST)"
    (vconcat list))
  
  (defsubst py-copy-vector (vec)
    (vconcat vec))
  
  (defun py-hash-to-vector (ht)
    (let ((v (make-vector (hash-table-count ht) 0))
          (i -1))
      (maphash (lambda (key value)
                 (aset v (setq i (1+ i)) key))
               ht)
      v))
  
  (defsubst py-object-to-vector (object)
    (vconcat (py-object-to-list (object))))
#+END_SRC
*** tests
#+Begin_SRC emacs-lisp :tangle pyel-tests.el
  (pyel-create-tests
   tuple-function
   ("tuple('string')" ["s" "t" "r" "i" "n" "g"])
   ("tuple([1,2,'3',(2,)])" [1 2 "3" [2]])
   ("a = [1]
  b = [a,1]
  c = list(b)"
    ("c is b" nil)
    ("c == b" nil)
    ("c[0] is a" t))
   
   ("a = [1]
  b = (a, 1)
  c = tuple(b)"
    ("c" '((1) 1))
    ("c[0] is a" t))
  
   ("a = (1,)
  b = [a, 1]
  c = tuple(b)"
    ("c" '[[1] 1])
    ("c[0] is a" t))
   
   ("tuple({1:'one', 2:'two', 3:'three'})" '[3 2 1])
   
   ("tuple((1,2,3))" [1 2 3])
   
   ("s = '123'
  l = [1,2,3]
  tu = (1,2,3,)
  d = {1:'1',2:'2',3:'3'}"
    ("tuple(s)" ["1" "2" "3"])
    ("tuple(l)" [1 2 3])
    ("tuple(tu)" [1 2 3])
    ("tuple(d)" [3 2 1]))
   
   ("class a:
   x = 5
   def __iter__(self):
    return self
   def __next__(self):
    if self.x > 0:
     ret = str(self.x)
     self.x -= 1
     return ret
    raise StopIteration
  obj = a()"
    ("list(obj)" '["5" "4" "3" "2" "1"])))
#+END_SRC
** hasattr
*** transform
#+Begin_SRC emacs-lisp :tangle pyel-transforms.el
(pyel-translate-function-name 'hasattr 'obj-hasattr)
#+END_SRC
*** tests
#+Begin_SRC emacs-lisp :tangle pyel-tests.el
;;
#+END_SRC
** isinstance
*** transform
#+Begin_SRC emacs-lisp :tangle pyel-transforms.el
(pyel-translate-function-name 'isinstance 'obj-isinstance)
#+END_SRC
*** tests
#+Begin_SRC emacs-lisp :tangle pyel-tests.el
;;
#+END_SRC
** str
*** transform
#+Begin_SRC emacs-lisp :tangle pyel-transforms.el
  (pyel-func-transform str (thing)
                       (number) -> (number-to-string thing)
                       (string) -> (format "\"%s\"" thing)
                       (function) -> (py-function-str thing)
                       (list) -> (py-list-str thing)
                       (object) -> (call-method thing --str--)
                       (vector) -> (py-vector-str thing)
                       (hash) -> (py-hash-str thing)
                       (symbol) -> (symbol-name thing))

  (pyel-translate-function-name 'str 'pyel-str)
#+END_SRC
*** python el lib
#+Begin_SRC emacs-lisp :tangle py-lib.el
  (defun _py-str-sequence (seq)
    "convert SEQ to a string of its python representation
      does not include starting/ending parens or brackets"
    (if (vectorp seq)
        (setq seq (mapcar 'identity seq)))
    (if (listp seq)
        (if (listp (cdr seq))
            (mapconcat (lambda (x) (pyel-str-function x)) seq ", ")
          ;;cons cell
          ;;this should not happend from normal python
          ;;but maybe when interacting with lisp code from python
          (concat (pyel-str-function (car seq))
                  " . "
                  (pyel-str-function (cdr seq))))
      (error "invalid type")))
  
  (defun py-list-str (thing)
    (concat "[" (_py-str-sequence thing) "]"))
  (defun py-vector-str (thing)
    (concat "(" (_py-str-sequence thing) ")"))
  
  (defun py-function-str (func)
    "return a string representation of function FUNC"
    (let* ((obj (bound-method-p func))
           (obj-name (if obj (-to_ (getattr obj --name--)) nil)))
      (if obj
          (format "<bound method %s.%s of %s object at 0x18b071>"
                  obj-name
                  (-to_ (bound-method-name func))
                  obj-name)
        (format "<function %s at 0x18b071>" (if (and (listp func)
                                                     (or (eq (car func) 'lambda)))
                                                "<lambda>"
                                              (symbol-name func))))))
  
  (defun py-hash-str (ht)
    (let (str)
      (maphash (lambda (key value)
                 (push (concat (pyel-str-function key)
                               ": "
                               (pyel-str-function value))
                       str))
               ht)
  
      (concat "{" (mapconcat 'identity (reverse str) ", ") "}")))
  
  ;;temp fix for 'str' transform
  ;;The problem:
  ;; cannot pass a function name to the str transform because the tranform
  ;; treats it like a variable and it may not be bound as a variable
  ;;*This should be temporary because the 'str' transform cannot
  ;;expand this way to take advantage of known types
  (defmacro pyel-str (thing)
    (if (symbolp thing)
        (if (boundp thing)
            (list 'pyel-str-function thing)
          (if (functionp thing)
              `(py-function-str (quote ,thing))
            thing;;error
            ))
      (list 'pyel-str-function thing)))
  
  ;;Currently, the repr and str transforms are not not called directly
  ;;so they never have the change to expand.
  ;;The expanded functions are used so we force expansion here.
  ;;required functions are `pyel-str-function' and `pyel-repr-function'
  ;;;NOTE: this is also done in `pyel-run-tests'
  (let ((current-transform-table (get-transform-table 'pyel)))
    (call-transform (pyel-func-transform-name 'repr) nil)
    (call-transform (pyel-func-transform-name 'str) nil))
#+END_SRC
