pyel-tests.el
                   "true() if tst() else false()"
                   "a[1] if a[2:2] else a[2]"
                   )

;;

;;

;;

(pyel-create-tests
 len-function
 ("a = [1,2,3,'5']
b = []
c = 'str'
d = (1,2,3,4)"
  ("len(a)" 4)
  ("len(b)" 0)
  ("len(c)" 3)
  ("len(d)" 4))
 ("len('')" 0)
 ("len([3,4])" 2)
 ("len({1:'one', 2:'two'})" 2)
 )

(pyel-create-tests
 range-function
 ("range(5)" '(0 1 2 3 4))
 ("range(2,7)" '(2 3 4 5 6))
 ("range(2,20,3)" '(2 5 8 11 14 17)))

(pyel-create-tests
 list-function
 ("list('string')" '("s" "t" "r" "i" "n" "g"))
 ("list([1,2,'3',(2,)])" '(1 2 "3" [2]))
 ("a = [1]
b = [a,1]
c = list(b)"
  ("c is b" nil)
  ("c == b" t)
  ("c[0] is a" t))

 ("a = [1]
b = (a, 1)
c = list(b)"
  ("c" '((1) 1))
  ("c[0] is a" t))

 ("list({1:'one', 2:'two', 3:'three'})" '(3 2 1))

 ("list((1,2,3))" [1, 2, 3])
 
 ("s = '123'
l = [1,2,3]
tu = (1,2,3,)
d = {1:'1',2:'2',3:'3'}"
  ("list(s)" ["1", "2", "3"])
  ("list(l)" [1, 2, 3])
  ("list(tu)" [1, 2, 3])
  ("list(d)" [3, 2, 1]))
 
 ("class a:
 x = 5
 def __iter__(self):
  return self
 def __next__(self):
  if self.x > 0:
   ret = str(self.x)
   self.x -= 1
   return ret
  raise StopIteration
obj = a()"
  ("list(obj)" '("5" "4" "3" "2" "1"))))

;;

;;

(pyel-create-tests
 str
