pyel-transforms.el

(def-transform if-exp pyel ()
  (lambda (test body orelse &optional line col)
    (let ((tst (transform test)))
      `(if ,(if (equal tst []) nil tst)
           ,(transform body)
         ,(transform orelse)))))

(def-transform raise pyel ()
  (lambda (exc cause &optional line col)
    `(py-raise ,(transform exc)))) ;;TODO: ignoring cause

;;

(pyel-translate-function-name 'map 'mapcar)

(pyel-func-transform len (thing)
                     (hash)   -> (hash-table-count thing)
                     (object) -> (call-method thing --len--)
                     (_)      -> (length thing))

(push '(range py-range) pyel-function-name-translations)

(pyel-translate-function-name 'input 'read-string)

(defalias 'py-list 'pyel-list-function)
(pyel-func-transform list (object)
                     (string) -> (py-string-to-list object)
                     (object) -> (py-object-to-list object)
                     (vector) -> (py-vector-to-list object)
                     (hash)   -> (py-hash-to-list object)
                     (list)   -> (py-copy-list object))

(pyel-func-transform tuple (object)
                     (string) -> (py-string-to-vector object)
                     (list)   -> (py-list-to-vector object)
                     (vector) -> (py-copy-vector object)
                     (hash)   -> (py-hash-to-vector object)
                     (object) -> (py-object-to-vector object))

(pyel-translate-function-name 'hasattr 'obj-hasattr)

(pyel-translate-function-name 'isinstance 'obj-isinstance)

(pyel-func-transform str (thing)
                     (number) -> (number-to-string thing)
                     (string) -> (format "\"%s\"" thing)
                     (function) -> (py-function-str thing)
                     (list) -> (py-list-str thing)
                     (object) -> (call-method thing --str--)
                     (vector) -> (py-vector-str thing)
                     (hash) -> (py-hash-str thing)
                     (symbol) -> (symbol-name thing))

(pyel-translate-function-name 'str 'pyel-str)
