pyel.org
*** tests
#+Begin_SRC emacs-lisp :tangle pyel-tests.el
  (pyel-create-tests
   str
   ("str('somestring')" "\"somestring\"")
   ("str(\"'dstring'\")" "\"'dstring'\"")
   ("str(342)" "342")
   ("x = [1,2,'hi']
  str(x)"
    "[1, 2, \"hi\"]")
   ("x = (1,'two',3)
  str(x)"
    "(1, \"two\", 3)")
   ("x = {1: 'one', 5: 'five', 12: 'telve'};
  str(x)"
    "{1: \"one\", 5: \"five\", 12: \"telve\"}")
   ("f = lambda : False
  str(f)"
    "<function <lambda> at 0x18b071>")
   ("def __ff_(): pass
  str(__ff_)"
    "<function --ff- at 0x18b071>")
  
   ("class strtest:
   def __init__ (self, n):
    self.x = n
   def __str__(self):
    return 'str' + str(self.x)
  obj = strtest(4)"
   ("str(obj)" "str4")))
#+END_SRC
** repr
*** transform
#+Begin_SRC emacs-lisp :tangle pyel-transforms.el
  (pyel-func-transform repr (thing)
                       (number) -> (number-to-string thing)
                       (string) -> (py-repr-string thing)
                       (function) -> (py-function-str thing)
                       (symbol) -> (pyel-symbol-str thing)
                       (list) -> (py-list-repr thing)
                       (object) -> (call-method thing --repr--)
                       (vector) -> (py-vector-str thing)
                       (hash) -> (py-hash-str thing))

  (pyel-translate-function-name 'repr 'pyel-repr)
#+END_SRC
*** python el lib
#+Begin_SRC emacs-lisp :tangle py-lib.el
  ;;temp function. see `pyel-str' for details
  (defmacro pyel-repr (thing)
    (if (stringp thing)
        (py-repr-string (py-repr-string thing))
      (if (symbolp thing)
          (if (boundp thing)
              (list 'pyel-repr-function thing)
            (if (functionp thing)
                `(py-function-str (quote ,thing))
              thing;;error
              ))
        (list 'pyel-repr-function thing))))
  
  (defsubst py-repr-string (thing)
    (prin1-to-string thing))
  
  (defun _py-repr-sequence (seq)
    (mapconcat (lambda (x) (pyel-repr-function x)) seq ", "))
  
  (defun py-list-repr (thing)
    (concat "[" (_py-repr-sequence thing) "]"))
  
  (defun py-vector-repr (thing)
    (concat "(" (_py-repr-sequence thing) ")"))
  
  (defun pyel-symbol-str (sym)
    (if (eq sym t)
        "True"
      (case sym
        (nil "False")
        (integer "<class 'int'>")
        (float "<class 'float'>")
        (string "<class 'str'>")
        (cons "<class 'list'>")
        (vector "<class 'tuple'>")
        (hash-table "<class 'dict'>")
        (t (symbol-name sym)))))
#+END_SRC

*** tests
#+Begin_SRC emacs-lisp :tangle pyel-tests.el
  (pyel-create-tests
   repr
   ("repr('somestring')" "\"\\\"somestring\\\"\"")
   ("repr(342)" "342")
   ("x = [1,2,'hi']
  repr(x)"
    "[1, 2, \"hi\"]")
   ("x = (1,'two',3)
  repr(x)"
    "(1, \"two\", 3)")
   ("x = {1: 'one', 5: 'five', 12: 'telve'}
  repr(x)"
    "{1: \"one\", 5: \"five\", 12: \"telve\"}")
   ("f = lambda : False
  repr(f)"
    "<function <lambda> at 0x18b071>")
   ("def __ff_(): pass
  repr(__ff_)"
    "<function --ff- at 0x18b071>"))
#+END_SRC
** hex
*** transform
#+Begin_SRC emacs-lisp :tangle pyel-transforms.el
(pyel-translate-function-name 'hex 'py-hex)
#+END_SRC
*** python el lib
#+Begin_SRC emacs-lisp :tangle py-lib.el
  (defun py-hex (n)
    (format "0x%x" n))
#+END_SRC
*** tests
#+Begin_SRC emacs-lisp :tangle pyel-tests.el
  (pyel-create-tests
   hex-function
   ("hex(23)" "0x17")
   ("hex(123232332)" "0x758604c"))
#+END_SRC
** bin
*** transform
#+Begin_SRC emacs-lisp :tangle pyel-transforms.el
(pyel-translate-function-name 'bin 'py-bin)
#+END_SRC
*** python el lib
#+Begin_SRC emacs-lisp :tangle py-lib.el
  (defun py-bin (n) ;;Is there really no built in way to do this???
    (let (bin)
      (while (not (= n 0))
        (push (number-to-string (% n 2)) bin)
        (setq n (/ n 2)))
      (mapconcat 'identity (cons "0b" bin) "")))
#+END_SRC
*** tests
#+Begin_SRC emacs-lisp :tangle pyel-tests.el
  (pyel-create-tests
   bin-function
   ("bin(123)" "0b1111011")
   ("bin(3456312)" "0b1101001011110100111000"))
#+END_SRC
** print
*** transform
#+Begin_SRC emacs-lisp :tangle pyel-transforms.el
  ;;(pyel-translate-function-name 'print 'py-print)
  (pyel-define-function-translation
   print
   `(py-print ,(cadr (assoc 'sep kwargs))
              ,(cadr (assoc 'end kwargs))
              nil ;;TODO: file=sys.stdout
              ,@args))
#+END_SRC
*** python el lib
#+Begin_SRC emacs-lisp :tangle py-lib.el
  (defvar pyel-print-function 'prin1
    "function that is used for printing by `py-print'")

  (defun py-print (sep end file &rest args)
    (let ((sep (or sep " "))
          (end (or end "\n")))
      (progn (mapc (lambda (x)
                     (funcall pyel-print-function x)
                     (funcall pyel-print-function sep))
                   (butlast args))
             (funcall pyel-print-function (car (last args)))
             (funcall pyel-print-function end)
             nil)))
#+END_SRC
*** python ast
#+Begin_SRC python :tangle py-ast.py
  def Print(dest, values, nl, lineno='nil', col_offset='nil'):
      print("Error: using python2, upgrade to python3")
      exit()
        
#+END_SRC  
*** tests
#+Begin_SRC emacs-lisp :tangle pyel-tests.el
;;
#+END_SRC

** pow
*** transform
#+Begin_SRC emacs-lisp :tangle pyel-transforms.el
  (pyel-define-function-translation
   pow
   (case (length args)
     (3 (list 'mod (list 'expt (car args) (cadr args)) (caddr args)))
     (2 (list 'expt (car args) (cadr args)))
     (t "ERROR") ;;TODO
     ))
  
#+END_SRC
*** tests
#+Begin_SRC emacs-lisp :tangle pyel-tests.el
  (pyel-create-tests
   pow
   ("pow(2,5,5)" 2)
   ("pow(3,7,20)" 7)
   ("pow(3,7)" 2187)
   ("pow(2,2)" 4))
#+END_SRC
** eval
*** transform
#+Begin_SRC emacs-lisp :tangle pyel-transforms.el
(pyel-translate-function-name 'eval 'py-eval)
#+END_SRC
*** python el lib
#+Begin_SRC emacs-lisp :tangle py-lib.el
  (defun py-eval (source &rest others)
    (if others
        (error "Only the first arg in `py-eval' is implemented"))
    (if (stringp source)
        (eval (pyel source))
      (py-raise (TypeError "eval() arg 1 must be a string, bytes or code object)"))))
#+END_SRC
*** tests
#+Begin_SRC emacs-lisp :tangle pyel-tests.el
  (pyel-create-tests 
   eval
   ("x = 23
  a = 1
  b = 4
  s = 'a+b'"
    ("eval('x')" 23)
    ("eval(s)" 5)))
#+END_SRC
** type
*** transform
#+Begin_SRC emacs-lisp :tangle pyel-transforms.el
  (pyel-translate-function-name 'type 'py-type)
  
  (pyel-translate-variable-name 'int 'py-int)
  (pyel-translate-variable-name 'float 'py-float)
  (pyel-translate-variable-name 'tuple 'py-tuple)
  (pyel-translate-variable-name 'dict 'py-dict)
  (pyel-translate-variable-name 'list 'py-list)
  (pyel-translate-variable-name 'string 'py-string)
  (pyel-translate-variable-name 'bool 'py-bool)
  (pyel-translate-variable-name 'type 'py-type)
#+END_SRC
*** python el lib
#+Begin_SRC emacs-lisp :tangle py-lib.el
  ;;TODO: when the built in type classes are finished and `py-type'
  ;;      returns them, the special cases for the types in
  ;;      `pyel-symbol-str' should be removed
  
  (defun py-type (object)
    (cond ((integerp object)
           py-int)
          ((floatp object)
           py-float)
          ((listp object)
           py-list)
          ((stringp object)
           py-string)
          ((py-instance-p object)
           (aref object obj-class-index)) ;;?
          ((py-class-p object)
           py-type)
          ((vectorp object)
           py-tuple)
          ((hash-table-p object)
           py-dict)
          ((or (eq object t)
               (eq object nil))
           py-bool)
          (t (type-of object))))
  
  ;;symbols that represent built in python types
  (defconst py-int 'int)
  (defconst py-float 'int)
  (defconst py-tuple 'tuple)
  (defconst py-dict 'dict)
  (defconst py-list 'list)
  (defconst py-str  'string)
  (defconst py-string 'string)
  (defconst py-bool 'bool)
  (defconst py-type 'type)
#+END_SRC
*** tests
#+Begin_SRC emacs-lisp :tangle pyel-tests.el
  (pyel-create-tests
   type
   ("type(t)" "<class 'bool'>")
   ("type(3)" py-int)
   ("type(3.3)" py-float)
   ("type('3')" py-string)
   ("type([3])" py-list)
   ("type((3,))" py-tuple)
   ("type({3:'3'})" py-list)
   ("type('s') == str" t)
   ("type((3,)) == list" nil)
   ("class testc: pass
  x = testc()
  y = type(x)"
    ("repr(type(x))" "<class 'testc'>")
    ("y is testc" t)))
#+END_SRC
** abs
*** transform
#+Begin_SRC emacs-lisp :tangle pyel-transforms.el
  (pyel-func-transform abs (object)
                       (number) -> (abs object)
                       (object) -> (call-method object --abs--))
#+END_SRC
*** tests
#+Begin_SRC emacs-lisp :tangle pyel-tests.el
  (pyel-create-tests
   abs-function
   ("abs(3)" 3)
   ("abs(-3)" 3)
   ("class C:
   def __abs__(self):
    'doc'
    return 'hi'
  obj = C()"
    ("abs(obj)" "hi")))
#+END_SRC  
** chr
*** transform
#+Begin_SRC emacs-lisp :tangle pyel-transforms.el
  (pyel-translate-function-name 'chr 'py-chr)
#+END_SRC
*** python el lib
#+Begin_SRC emacs-lisp :tangle py-lib.el
  (defsubst py-chr (i)
    (byte-to-string i))
#+END_SRC

*** tests
#+Begin_SRC emacs-lisp :tangle pyel-tests.el
  (pyel-create-tests
   chr-function
   ("chr(70)" "F")
   ("chr(50)" "2"))
#+END_SRC

** ord
*** transform
#+Begin_SRC emacs-lisp :tangle pyel-transforms.el
  (pyel-translate-function-name 'ord 'py-ord)
#+END_SRC
*** python el lib
#+Begin_SRC emacs-lisp :tangle py-lib.el
  (defsubst py-ord (i)
    (string-to-char i))
#+END_SRC

*** tests
#+Begin_SRC emacs-lisp :tangle pyel-tests.el
  (pyel-create-tests
   ord-function
   ("ord('F')" 70)
   ("ord('2')" 50))
#+END_SRC
** exit
*** transform
#+Begin_SRC emacs-lisp :tangle pyel-transforms.el
(pyel-translate-function-name 'exit 'pyel-exit)
#+END_SRC
*** python el lib
#+Begin_SRC emacs-lisp :tangle py-lib.el
(defun pyel-exit ()
  (if pyel-interactive
      (progn (kill-buffer)
	     (message "you killed ipyel")
	     (throw 'ipyel-quit nil))
    ;;(kill-emacs)
    (save-buffers-kill-terminal)))
#+END_SRC
** int
*** transform
#+Begin_SRC emacs-lisp :tangle pyel-transforms.el
  (pyel-func-transform int (object)
                       (string) -> (py-str-to-int object)
                       (number) -> (py-number-to-int object)
                       (object) -> (call-method object --int--))
#+END_SRC
*** python el lib
#+Begin_SRC emacs-lisp :tangle py-lib.el
  (defmacro py-number-to-int (num)
    (if (numberp num)
        (floor num)
      (list 'floor num)))
  
  (defmacro py-str-to-int (str)
    (if (stringp str)
        (floor (string-to-int str))
      `(floor (string-to-int ,str))))
#+END_SRC
*** tests
#+Begin_SRC emacs-lisp :tangle pyel-tests.el
  (pyel-create-tests
   int-function
   ("int('34')" 34)
   ("int('3.3')" 3)
   ("int(2)" 2)
   ("int(23.2)" 23)
   ("x = '3'
  y = ['4']
  z = 2
  a = 3.3"
    ("int(x)" 3)
    ("int(y[0])" 4)
    ("int(z)" 2)
    ("int(a)" 3))
   ("class test:
   def __int__(self):
    return 342
  o = test()"
    ("int(o)" 342)))
#+END_SRC

** float
