pyel-transforms.el

(pyel-func-transform repr (thing)
                     (number) -> (number-to-string thing)
                     (string) -> (py-repr-string thing)
                     (function) -> (py-function-str thing)
                     (symbol) -> (pyel-symbol-str thing)
                     (list) -> (py-list-repr thing)
                     (object) -> (call-method thing --repr--)
                     (vector) -> (py-vector-str thing)
                     (hash) -> (py-hash-str thing))

(pyel-translate-function-name 'repr 'pyel-repr)

(pyel-translate-function-name 'hex 'py-hex)

(pyel-translate-function-name 'bin 'py-bin)

;;(pyel-translate-function-name 'print 'py-print)
(pyel-define-function-translation
 print
 `(py-print ,(cadr (assoc 'sep kwargs))
            ,(cadr (assoc 'end kwargs))
            nil ;;TODO: file=sys.stdout
            ,@args))

(pyel-define-function-translation
 pow
 (case (length args)
   (3 (list 'mod (list 'expt (car args) (cadr args)) (caddr args)))
   (2 (list 'expt (car args) (cadr args)))
   (t "ERROR") ;;TODO
   ))

(pyel-translate-function-name 'eval 'py-eval)

(pyel-translate-function-name 'type 'py-type)

(pyel-translate-variable-name 'int 'py-int)
(pyel-translate-variable-name 'float 'py-float)
(pyel-translate-variable-name 'tuple 'py-tuple)
(pyel-translate-variable-name 'dict 'py-dict)
(pyel-translate-variable-name 'list 'py-list)
(pyel-translate-variable-name 'string 'py-string)
(pyel-translate-variable-name 'bool 'py-bool)
(pyel-translate-variable-name 'type 'py-type)

(pyel-func-transform abs (object)
                     (number) -> (abs object)
                     (object) -> (call-method object --abs--))

(pyel-translate-function-name 'chr 'py-chr)

(pyel-translate-function-name 'ord 'py-ord)

(pyel-translate-function-name 'exit 'pyel-exit)

(pyel-func-transform int (object)
                     (string) -> (py-str-to-int object)
                     (number) -> (py-number-to-int object)
                     (object) -> (call-method object --int--))
