pyel.org
*** transform
#+Begin_SRC emacs-lisp :tangle pyel-transforms.el
  (pyel-func-transform float (object)
                       (string) -> (py-str-to-float object)
                       (number) -> (py-number-to-float object)
                       (object) -> (call-method object --float--))
#+END_SRC
*** python el lib
#+Begin_SRC emacs-lisp :tangle py-lib.el
  (defmacro py-number-to-float (num)
    (if (numberp num)
        (* 1.0 num)
      (list '* 1.0 num)))
  
  (defmacro py-str-to-float (str)
    (if (stringp str)
        (* 1.0 (string-to-int str))
      (list '* 1.0 (list 'string-to-int str))))
#+END_SRC
*** tests
#+Begin_SRC emacs-lisp :tangle pyel-tests.el
  (pyel-create-tests
   float-function
   ("float('34')" 34.0)
   ("float('3.3')" 3.3)
   ("float(2)" 2.0)
   ("float(23.2)" 23.2)
   ("x = '3.1'
  y = ['4']
  z = 2
  a = 3.3"
    ("float(x)" 3.1)
    ("float(y[0])" 4.0)
    ("float(z)" 2.0)
    ("float(a)" 3.3))
   ("class test:
   def __float__(self):
    return 342.1
  o = test()"
    ("float(o)" 342.1)))
#+END_SRC

** dict
*** transform
#+Begin_SRC emacs-lisp :tangle pyel-transforms.el
  (pyel-func-kwarg-transform dict (kwargs)
                             (_)-> (pyel-alist-to-hash2 'kwargs))
  
  (pyel-func-transform dict (&optional object)
                       (list)   -> (pyel-list-to-dict object)
                       (object) -> (pyel-object-to-dict object)
                       (vector) -> (pyel-vector-to-dict object)
                       (hash)   -> (copy-hash-table object))
  
#+END_SRC
*** python el lib
#+Begin_SRC emacs-lisp :tangle py-lib.el
  (defun pyel-alist-to-hash2 (alist)
    "like `pyel-alist-to-hash' but elements have the form (a b)"
    (let ((ht (make-hash-table
               :test 'equal
               :size (length alist))))
      (mapc (lambda (x)
              (puthash (car x) (cadr x) ht))
            alist)
      ht))
  
  (defun pyel-list-to-dict (list)
    (let ((h (make-hash-table :test pyel-dict-test)) ;;default length??
          key-val)
      (mapcar (lambda (elem)
                (setq key-val (pyel-get-key-val elem))
                (puthash (car key-val) (cdr key-val) h))
              list)
      h))
  
  (defun pyel-vector-to-dict (vec)
    (let ((h (make-hash-table :test pyel-dict-test)) ;;default length??
          key-val)
      (dotimes (i (length vec))
        (setq key-val (pyel-get-key-val (aref vec i)))
        (puthash (car key-val) (cdr key-val) h))
      h))
  
  (defun pyel-object-to-dict (object)
    (let ((iter (condition-case nil
                    (call-method object --iter--)
                  (AttributeError
                   (py-raise (TypeError (format
                                         "'%s' object is not iterable"
                                         (getattr object --name--)))))))
          (ht (make-hash-table :test pyel-dict-test))
          key-val)
      (condition-case nil
          (while t
            (setq key-val (pyel-get-key-val (call-method iter --next--)))
            (puthash (car key-val) (cdr key-val) ht))
        (StopIteration ht))))
  
  (defun pyel-get-key-val (obj)
    "(k . v) -> (k . v)
  \(k v) -> (k . v)
  \[k v] -> (k . v)
  'kv' -> ('k' . 'v')"
    (cond ((listp obj)
           (if (listp (cdr obj))
               (if (= (length obj) 2)
                   (cons (car obj) (cadr obj))
                 (error "invalid length"))
             obj))
          ((vectorp obj)
           (if (= (length obj) 2)
               (cons (aref obj 0) (aref obj 1))
             (error "invalid length")))
          ((stringp obj)
           (if (= (length obj) 2)
               (cons (subseq obj 0 1) (subseq obj 1 2))
             (error "invalid length")))
          (t (error "invalid type"))))
#+END_SRC
*** tests
#+Begin_SRC emacs-lisp :tangle pyel-tests.el
  (pyel-create-tests
   dict-function
   ("repr(dict())" "{}")
   ("repr(dict(__a = 1,__b = 2,__c = 4))" "{--a: 1, --b: 2, --c: 4}")
   ("repr(dict([('a',3),('b', 5),('c',8)]))" "{\"a\": 3, \"b\": 5, \"c\": 8}")
   ("repr(dict((('a',3),('b', 5),('c',8))))" "{\"a\": 3, \"b\": 5, \"c\": 8}")
   ("a = [('ab'),['b', 5],('c',8)]
  x = dict(a)"
    ("repr(x)" "{\"a\": \"b\", \"b\": 5, \"c\": 8}"))
   ("class a:
   x = 5
   def __iter__(self):
    return self
   def __next__(self):
    if self.x > 0:
     ret = self.x
     self.x -= 1
     return ret, ret**2
    raise StopIteration
  o = a()
  x = dict(o)"
    ("repr((x))" "{5: 25, 4: 16, 3: 9, 2: 4, 1: 1}")))
#+END_SRC

** round
*** transform
#+Begin_SRC emacs-lisp :tangle pyel-transforms.el
  (pyel-translate-function-name 'round 'py-round)
#+END_SRC
*** python el lib
#+Begin_SRC emacs-lisp :tangle py-lib.el
  (defun py-round (number &optional ndigits)
    (if ndigits
        (round-float number ndigits)
      (round number)))
#+END_SRC
*** tests
#+Begin_SRC emacs-lisp :tangle pyel-tests.el
  (pyel-create-tests
   round-function
   ("round(342.234)" 342)
   ("round(342.834)" 343)
   ("round(342.834,1)" 342.8)
   ("round(342.834,2)" 342.83))
#+END_SRC
** enumerate
*** transform
#+Begin_SRC emacs-lisp :tangle pyel-transforms.el
  (pyel-func-transform enumerate (obj &optional start)
                       (list)   -> (pyel-enumerate-list obj start)
                       (string) -> (pyel-enumerate-string obj start)
                       (object) -> (pyel-enumerate-object obj start)
                       (vector) -> (pyel-enumerate-vector obj start)
                       (hash)   -> (copy-enumerate-hash obj start))
#+END_SRC
*** python el lib
#+Begin_SRC emacs-lisp :tangle py-lib.el
  (defun pyel-enumerate-list (list &optional start)
    (let ((ret nil)
          (c (or start 0)))
      (while list
        (setq ret (cons (list c (car list)) ret)
              list (cdr list)
              c (1+ c)))
      (reverse ret)))
  
  (defsubst pyel-enumerate-vector (vec &optional start)
    (pyel-enumerate-list (mapcar 'identity vec) start))
  
  (defsubst pyel-enumerate-hash (hash &optional start)
    (pyel-enumerate-list (py-hash-to-list hash) start))
  
  (defsubst pyel-enumerate-string (str &optional start)
    (pyel-enumerate-list (split-string str "" :omit-nulls) start))

  (defsubst pyel-enumerate-object (obj &optional start)
    (pyel-enumerate-list (py-object-to-list obj) start))
#+END_SRC
*** tests
#+Begin_SRC emacs-lisp :tangle pyel-tests.el
  (pyel-create-tests
   enumerate-function
   ("enumerate(['a','b','c'])" '((0 "a") (1 "b") (2 "c")))
   ("enumerate(('a','b','c'))" '((0 "a") (1 "b") (2 "c")))
   ("enumerate('abc')" '((0 "a") (1 "b") (2 "c")))
   ("enumerate(['a','b','c'],10)" '((10 "a") (11 "b") (12 "c")))
   ("enumerate(('a','b','c'),10)" '((10 "a") (11 "b") (12 "c")))
   ("enumerate('abc',10)" '((10 "a") (11 "b") (12 "c")))
   ("class a:
   x = 5
   def __iter__(self):
    return self
   def __next__(self):
    if self.x > 0:
     ret = str(self.x)
     self.x -= 1
     return ret
    raise StopIteration
  obj = a()"
    ("enumerate(obj)" '((0 "5") (1 "4") (2 "3") (3 "2") (4 "1")))))
#+END_SRC

** interactive
*** transform
#+Begin_SRC emacs-lisp :tangle pyel-transforms.el
  (pyel-define-function-translation
   interactive
   (setq interactive t))
#+END_SRC
** divmod
*** transform
#+Begin_SRC emacs-lisp :tangle pyel-transforms.el
  (pyel-func-transform divmod (x y)
                       (_ float)
                       (_ float) -> (py-divmod-f x y)
                       (int int) -> (py-divmod-i x y)
                       (_ _)     -> (py-divmod x y))
#+END_SRC
*** python el lib
#+Begin_SRC emacs-lisp :tangle py-lib.el
  (defmacro py-divmod (x y)
    "(divmod X Y) -> [div mod]
  
  Return the vector [(X-X%Y)/Y, X%Y].  Invariant: div*Y + mod == X."
    (cond ((and (numberp x)
                (numberp y))
           (vector (if (or (floatp x)
                           (floatp y))
                       (ffloor (/ x y)) (floor (/ x y)))
                   (mod x y)))
          ((or (floatp x) (floatp y))
           `(vector (ffloor (/ ,x ,y)) (mod ,x ,y)))
          (t `(vector (if (or (floatp ,x)
                              (floatp ,y))
                          (ffloor (/ ,x ,y))
                        (floor (/ ,x ,y)))
                      (mod ,x ,y)))))
  
  (defsubst py-divmod-f (x y)
    (vector (ffloor (/ x y)) (mod x y)))
  
  (defsubst py-divmod-i (x y)
    (vector (floor (/ x y)) (mod x y)))
#+END_SRC

*** tests
#+Begin_SRC emacs-lisp :tangle pyel-tests.el
  (pyel-create-tests
   divmod-function
   ("divmod(6, 2)" [3 0])
   ("divmod(6, 4)" [1 2])
   ("divmod(6.7, 4)" [1.0 2.7])
   ("divmod(6.712, 4.1)" [1.0 2.612])
   ("divmod(4.2, 2.1)" [2.0 0.0])
   ("divmod(4, 2.1)" [1.0 1.9])
   ("a = 412
  b = 13"
    ("divmod(a, b)" [31 9])))
#+END_SRC

** bool
*** transform
#+Begin_SRC emacs-lisp :tangle pyel-transforms.el
  (pyel-func-transform bool (object)
                       (object) -> (py-object-bool object)
                       (_) -> (py-bool object))
  
#+END_SRC
*** python el lib
#+Begin_SRC emacs-lisp :tangle py-lib.el
  (defsubst py-bool (thing)
    "convert a non-object THING into a boolean value.
  For objects, use `py-object-bool'"
    ;;TODO: this should handled in the type dispatch
    (if (and thing (not (or (eq thing 0) (eq thing []) (eq thing "")))) t))
  
  (defun py-object-bool (object)
    "return t if an object is considered true, else nil.
  If the object defines the --bool-- method, that is called.
  Otherwise the --len-- method is tried, the result is true
  if the length is greator then one.
  If neither the --bool-- or the --len-- methods are defined,
  all instances are considered true"
    (condition-case nil
        (call-method object --bool--)
      (AttributeError
       (condition-case nil
           (> (call-method object --len--) 0)
         (AttributeError
          t)))))
#+END_SRC
*** tests
#+Begin_SRC emacs-lisp :tangle pyel-tests.el
;;
#+END_SRC

** transform template
*** transform
#+Begin_SRC emacs-lisp :tangle pyel-transforms.el
;;
#+END_SRC
*** python ast
#+Begin_SRC python :tangle py-ast.py

#+END_SRC
*** python el lib
#+Begin_SRC emacs-lisp :tangle py-lib.el

#+END_SRC

*** tests
#+Begin_SRC emacs-lisp :tangle pyel-tests.el
;;
#+END_SRC

* method transforms
** doc  TODO: move or tangle
*Defining method transforms for build in types*
In python, primitive types such as the list and string are objects. We need to
define the way in which these method calls will be transformed to function
calls in Emacs Lisp. The macro `pyel-method-transform' is used for this.

Definition form is just like normal type transforms, with a few extra requirement
- The first argument is the potential object
- these transforms are responsible for creating the normal
  method call if obj is actually an object and not a primative type
  this must always be last with the type selector (_ _ ... _ ) ->
Example:
#+Begin_SRC emacs-lisp
  (pyel-method-transform append (obj thing)
                         (list _) -> (py-list-append obj thing)
                         (_ _)    -> (call-method obj append thing))
#+End_Src
** append
*** transform
#+Begin_SRC emacs-lisp :tangle pyel-transforms.el
  (pyel-method-transform append (obj thing)
                         (list _) -> (py-append $obj thing)
                         (_ _)    -> (call-method obj append thing))
#+END_SRC
*** python el lib
#+Begin_SRC emacs-lisp :tangle py-lib.el
  (defun py-list-append (list thing)
    "add THING to the end of LIST"
    (while (not (null (cdr list)))
      (setq list (cdr list)))
    (setcdr list (list thing)))
  
  (defmacro py-append (list thing)
    "add THING to the end of LIST"
    `(cond ((null ,list) (setq ,list (list ,thing)))
           (t (py-list-append ,list ,thing))))
  
#+END_SRC
*** tests
#+Begin_SRC emacs-lisp :tangle pyel-tests.el
  (pyel-create-tests
   append
   ("a = [1,2,3]
  c = ['a','a']
  b = a
  a.append('hi')
  e = []
  e.append(3)"
    ("a" '(1 2 3 "hi"))
    ("a is b" t)
    ("a.append(c)" ("a is b" t))
    ("a.append(c)" ("a[3] is c" t))
    ("e" '(3))))
#+END_SRC
** insert
