pyel-tests.el
 ("repr(dict(__a = 1,__b = 2,__c = 4))" "{--a: 1, --b: 2, --c: 4}")
 ("repr(dict([('a',3),('b', 5),('c',8)]))" "{\"a\": 3, \"b\": 5, \"c\": 8}")
 ("repr(dict((('a',3),('b', 5),('c',8))))" "{\"a\": 3, \"b\": 5, \"c\": 8}")
 ("a = [('ab'),['b', 5],('c',8)]
x = dict(a)"
  ("repr(x)" "{\"a\": \"b\", \"b\": 5, \"c\": 8}"))
 ("class a:
 x = 5
 def __iter__(self):
  return self
 def __next__(self):
  if self.x > 0:
   ret = self.x
   self.x -= 1
   return ret, ret**2
  raise StopIteration
o = a()
x = dict(o)"
  ("repr((x))" "{5: 25, 4: 16, 3: 9, 2: 4, 1: 1}")))

(pyel-create-tests
 round-function
 ("round(342.234)" 342)
 ("round(342.834)" 343)
 ("round(342.834,1)" 342.8)
 ("round(342.834,2)" 342.83))

(pyel-create-tests
 enumerate-function
 ("enumerate(['a','b','c'])" '((0 "a") (1 "b") (2 "c")))
 ("enumerate(('a','b','c'))" '((0 "a") (1 "b") (2 "c")))
 ("enumerate('abc')" '((0 "a") (1 "b") (2 "c")))
 ("enumerate(['a','b','c'],10)" '((10 "a") (11 "b") (12 "c")))
 ("enumerate(('a','b','c'),10)" '((10 "a") (11 "b") (12 "c")))
 ("enumerate('abc',10)" '((10 "a") (11 "b") (12 "c")))
 ("class a:
 x = 5
 def __iter__(self):
  return self
 def __next__(self):
  if self.x > 0:
   ret = str(self.x)
   self.x -= 1
   return ret
  raise StopIteration
obj = a()"
  ("enumerate(obj)" '((0 "5") (1 "4") (2 "3") (3 "2") (4 "1")))))

;;

(pyel-create-tests
 append
 ("a = [1,2,3]
c = ['a','a']
b = a
a.append('hi')
e = []
e.append(3)"
  ("a" '(1 2 3 "hi"))
  ("a is b" t)
  ("a.append(c)" ("a is b" t))
  ("a.append(c)" ("a[3] is c" t))
  ("e" '(3))))

(pyel-create-tests
 insert
 ("x = [1,2,3]
y = x
x.insert(1,'hi')"
  ("x" '(1 "hi" 2 3))
  ("x is y" t)))

(pyel-create-tests
 find-method
