pyel-transforms.el

(pyel-func-transform float (object)
                     (string) -> (py-str-to-float object)
                     (number) -> (py-number-to-float object)
                     (object) -> (call-method object --float--))

(pyel-func-kwarg-transform dict (kwargs)
                           (_)-> (pyel-alist-to-hash2 'kwargs))

(pyel-func-transform dict (&optional object)
                     (list)   -> (pyel-list-to-dict object)
                     (object) -> (pyel-object-to-dict object)
                     (vector) -> (pyel-vector-to-dict object)
                     (hash)   -> (copy-hash-table object))

(pyel-translate-function-name 'round 'py-round)

(pyel-func-transform enumerate (obj &optional start)
                     (list)   -> (pyel-enumerate-list obj start)
                     (string) -> (pyel-enumerate-string obj start)
                     (object) -> (pyel-enumerate-object obj start)
                     (vector) -> (pyel-enumerate-vector obj start)
                     (hash)   -> (copy-enumerate-hash obj start))

(pyel-define-function-translation
 interactive
 (setq interactive t))

(pyel-func-transform divmod (x y)
                     (_ float)
                     (_ float) -> (py-divmod-f x y)
                     (int int) -> (py-divmod-i x y)
                     (_ _)     -> (py-divmod x y))

(pyel-func-transform bool (object)
                     (object) -> (py-object-bool object)
                     (_) -> (py-bool object))

(pyel-func-transform iter (obj)
                     (list)   -> (py-list-iter obj)
                     (string) -> (py-string-iter obj)
                     (object) -> (py-object-iter obj)
                     (vector) -> (py-vector-iter obj)
                     (hash)   -> (py-hash-iter obj))

;;

(pyel-method-transform append (obj thing)
                       (list _) -> (py-append $obj thing)
                       (_ _)    -> (call-method obj append thing))
