pyel.org
*** transform
#+Begin_SRC emacs-lisp :tangle pyel-transforms.el
  (pyel-method-transform insert (obj i x)
                         (list _) -> (py-insert obj i x)
                         (_ _) -> (call-method obj insert i x))
#+END_SRC
*** python el lib
#+Begin_SRC emacs-lisp :tangle py-lib.el
(defun py-insert (list index object)
  "insert OBJECT into LIST at INDEX"
  (let ((i 0)
	(rest list)
	first)
    (while (< i index)
      (setq first rest)
      (setq rest (cdr rest))
      (setq i (1+ i)))
    (setcdr first (cons object rest)))
  nil)
#+END_SRC
*** tests
#+Begin_SRC emacs-lisp :tangle pyel-tests.el
(pyel-create-tests
 insert
 ("x = [1,2,3]
y = x
x.insert(1,'hi')"
  ("x" '(1 "hi" 2 3))
  ("x is y" t)))
#+END_SRC
** find
*** transform
#+Begin_SRC emacs-lisp :tangle pyel-transforms.el
  (pyel-method-transform find (obj sub &optional start end)
                         (string _ _ _) -> (py-find obj sub start end)
                         (_ _ _ _)      -> (call-method obj find sub start end))
#+END_SRC
*** python el lib
#+Begin_SRC emacs-lisp :tangle py-lib.el
  (defun py-find (str sub &optional start end)
    "Return the lowest index in S where substring sub is found,
  such that sub is contained within S[start:end].  Optional
  arguments start and end are interpreted as in slice notation.
  
  Return -1 on failure."
    (let* ((start (or start 0))
          (index (string-match (regexp-quote sub) (substring str start end))))
      (if index
          (+ index start)
        -1)))
#+END_SRC
*** tests
#+Begin_SRC emacs-lisp :tangle pyel-tests.el
  (pyel-create-tests
   find-method
   ("'aaaxaaa'.find('x',3)"  3)
   ("'aaaxaaa'.find('x',4)"  -1)
   ("'aaaxaaa'.find('x',2, 4)"  3)
   ("'aaaxaaa'.find('x',1, 3)"  -1)
   ("x = 'asdf'"
    ("x.find('sd')" 1)))
#+END_SRC
** index
*** transform
#+Begin_SRC emacs-lisp :tangle pyel-transforms.el
  (pyel-method-transform index (obj elem)
                         (list _) -> (list-index elem obj)
                         (string _) -> (py-string-index obj elem)
                         (object _) -> (call-method obj index elem)
                         (vector _) -> (vector-index elem obj))
#+END_SRC
*** python el lib
#+Begin_SRC emacs-lisp :tangle py-lib.el
  (defun list-index (elem list)
    "return the index of ELEM in LIST"
    (let ((m (member elem list)))
      (when m
        (- (length list) (length m)))))
  
  (defun vector-index (elem vector)
    "return the index of ELEM in VECTOR"
    (let ((i 0)
          (len (length vector))
          found)
  
      (while (and (< i len)
                  (not found))
        (if (equal (aref vector i) elem)
            (setq found i)
          (setq i (1+ i))))
      found))
  
  (defun py-string-index (str sub)
    "Like STR.find() but raise ValueError when the substring SUB is not found."
    (let ((ret (py-find str sub)))
      (if (= ret -1)
          (py-raise (ValueError "substring not found"))
        ret)))
#+END_SRC
*** tests
#+Begin_SRC emacs-lisp :tangle pyel-tests.el
  (pyel-create-tests
   index-method
   ;;lists
   ("x = [1,(1,2),'5']"
    ("x.index(1)" 0 )
    ("x.index((1,2))" 1)
    ("x.index('5')" 2))
   ;;strings
   ("x = 'importantstring'"
    ("x.index('t')" 5)
    ("x.index('or')" 3)
    ("x.index('g')" 14)
    ("x.index(x)" 0))
    ("x = 'str.ing'"
     ("x.index('.')" 3))
   ;;arrays
   ("x = (1,2,'tree',(3,))"
    ("x.index(1)" 0)
    ("x.index('tree')" 2)
    ("x.index((3,))" 3)))
#+END_SRC
** remove
*** transform
#+Begin_SRC emacs-lisp :tangle pyel-transforms.el
  (pyel-method-transform remove (obj x)
                         (list _) -> (py-list-remove obj x)
                         (_ _) -> (call-method obj remove x))
#+END_SRC
*** python el lib
#+Begin_SRC emacs-lisp :tangle py-lib.el
  (defun py-list-remove (list item)
    "remove ITEM from LIST"
    (when (equal (car list) item)
      (setcar list (cadr list))
      (setcdr list (cddr list)))
    (let ((rest list)
          first)
      (while rest
        (if (equal (car rest) item)
            (progn (setcdr first (cdr rest))
                   (setq rest nil))
          (setq first rest
                rest (cdr rest))))
      nil))
#+END_SRC
*** tests
#+Begin_SRC emacs-lisp :tangle pyel-tests.el
  (pyel-create-tests
   remove-method
   ("x = [1,'2','2',(1,)]
  y = x
  x.remove('2')"
    ("x is y" t))
   
   ("x = [1,'2','2',(1,)]
  x.remove('2')"
    ("x" '(1 "2" [1])))
   
   ("x = [1,'2','2',(1,)]
  x.remove(1)"
    ("x" '("2" "2" [1])))
   
   ("x = [1,'2','2',(1,)]
  x.remove((1,))"
    ("x" '(1 "2" "2"))))
#+END_SRC
** count
*** transform
#+Begin_SRC emacs-lisp :tangle pyel-transforms.el
  (pyel-method-transform count (obj elem)
                         (string _) -> (count-str-matches obj elem)
                         (list _) -> (count-elems-list obj elem)
                         (object _)  -> (call-method obj count elem)
                         (vector _) -> (count-elems-vector obj elem))
#+END_SRC
*** python el lib
#+Begin_SRC emacs-lisp :tangle py-lib.el
  ;;;; this one is slower
  ;;;; maybe faster with a non-regexp search function?
  ;; (defun count-str-matches (string substr)
  ;;   "count number of occurrences of SUBSTR in STRING"
  ;;   (let ((quoted (regexp-quote substr))
  ;;      (start 0)
  ;;      (strlen (length string))
  ;;      (sublen (length substr))
  ;;      (count 0))
  ;;     (while (< start strlen)
  ;;       (setq start (string-match quoted string start))
  ;;       (if start (setq count (1+ count)
  ;;                    start (+ start sublen))
  ;;      (setq start strlen)))
  ;;     count))
  
  (defun count-str-matches (string substr)
    "count number of occurrences of SUBSTR in STRING"
    (with-temp-buffer
      (insert string)
      (goto-char 1)
      (how-many (regexp-quote substr))))
  
  (defun count-elems-list (list elem)
    "return how many times ELEM occurs in LIST"
    (let ((c 0))
      (dolist (x list)
        (if (equal x elem)
            (setq c (1+ c))))
      c))
  
  (defun count-elems-vector (vector elem)
    "return how many times ELEM occurs in VECTOR"
    (let ((c 0)
          (i 0)
          (len (length vector)))
      (while (< i len)
        (if (equal (aref vector i) elem)
            (setq c (1+ c)))
        (setq i (1+ i)))
      c))
#+END_SRC
*** tests
#+Begin_SRC emacs-lisp :tangle pyel-tests.el
(pyel-create-tests
 count-method
 ;;strings
 ("'xxxxx'.count('x')" 5)
 ("'xxxx'.count('xx')" 2)
 ("'xxxx'.count('xxxx')" 1)
 ("'x.xx'.count('.')" 1)
 ;;lists
 ("x = [1,2,3,3,[2],'s']"
  ("x.count(3)" 2)
  ("x.count(2)" 1)
  ("x.count([3,4])" 1)
  ("x.count('s')" 1))
 ;;vector
 ("x = (1,2,3,3,[2],'s')"
  ("x.count(3)" 2)
  ("x.count(2)" 1)
  ("x.count([3,4])" 1)
  ("x.count('s')" 1))
 ("(1,1,1).count(1)" 3))
#+END_SRC
** join
*** transform
#+Begin_SRC emacs-lisp :tangle pyel-transforms.el
  (pyel-method-transform join (obj elem)
                         (string _) ->  (mapconcat 'identity elem obj)
                         (_ _)      -> (call-method obj join thing))
#+END_SRC
*** tests
#+Begin_SRC emacs-lisp :tangle pyel-tests.el
    (pyel-create-tests
     join-method
     ("'X'.join(('f','g'))" "fXg")
     ("' '.join([str(x) for x in range(3)])" "0 1 2")
     ("''.join(['a','b']))" "ab"))
#+END_SRC
** extend
*** transform
#+Begin_SRC emacs-lisp :tangle pyel-transforms.el
  (pyel-method-transform extend (obj elem)
                         (list _) ->  (py-list-extend obj elem)
                         (_ _)    ->  (call-method obj extend elem))
#+END_SRC
*** python el lib
#+Begin_SRC emacs-lisp :tangle py-lib.el
  (defun py-list-extend (list iterable)
    "Extend LIST by appending elements from the ITERABLE"
    (let ((rest list)
          prev)
  
      (while rest
        (setq prev rest
              rest (cdr rest)))
      
      (cond ((py-object-p iterable)
             (_py-list-extend-with-object prev iterable))
            ((listp iterable)
             (_py-list-extend-with-list prev iterable))
            ((stringp iterable)
             (_py-list-extend-with-string prev iterable))
            ((vectorp iterable)
             (_py-list-extend-with-vector prev iterable))
            (t (py-raise (TypeError (format "TypeError: '%s' object is not iterable"
                                            (type-of iterable))))))))
  
  (defun _py-list-extend-with-list (list extendlist)
    (while extendlist
      (setcdr list (list (car extendlist)))
      (setq list (cdr list)
            extendlist (cdr extendlist))))
  
  (defun _py-list-extend-with-vector (list vector)
    (let ((len (length vector))
          (index 0))
      (while (< index len)
        (setcdr list (list (aref vector index)))
        (setq list (cdr list)
              index (1+ index)))
      nil))
  
  (defun _py-list-extend-with-string (list string)
    (let ((len (length string))
          (index 0))
      (while (< index len)
        (setcdr list (list (char-to-string (aref string index))))
        (setq list (cdr list)
              index (1+ index)))
      nil))
  
  (defun _py-list-extend-with-object (list object)
    "assumes that py-object(OBJECT) == t"
    (let ((iter (condition-case nil
                    (call-method object --iter--)
                  (AttributeError
                   (py-raise (TypeError (format
                                         "'%s' object is not iterable"
                                         (getattr object --name--))))))))
      (condition-case nil
          (while t
            (setcdr list (list (call-method iter --next--)))
            (setq list (cdr list)))
        (StopIteration nil))))
#+END_SRC
*** tests
#+Begin_SRC emacs-lisp :tangle pyel-tests.el
  (pyel-create-tests
   extend-method
   ;;extend with list
   ("x = [1]
  y = x
  x.extend([1,'2',(3,)])"
    ("x is y" t)
    ("x" '(1 1 "2" [3])))
   ;;extend with vector
   ("x = [1]
  y = x
  x.extend((1,'2',(3,)))"
    ("x is y" t)
    ("x" '(1 1 "2" [3])))
   ;;extend with string
   ("x = [1]
  y = x
  x.extend('extended')"
    ("x is y" t)
    ("x" '(1 "e" "x" "t" "e" "n" "d" "e" "d")))
   ;;extend with object
   ("class a:
   x = 5
   def __iter__(self):
    return self
   def __next__(self):
    if self.x > 0:
     ret = str(self.x)
     self.x -= 1
     return ret
    raise StopIteration
  obj = a()
  x = [1]
  y = x
  x.extend(obj)"
    ("y is x" t)
    ("x" '(1 "5" "4" "3" "2" "1"))))
#+END_SRC
** pop
*** transform
#+Begin_SRC emacs-lisp :tangle pyel-transforms.el
  (pyel-method-transform pop (obj &optional a)
                         (list _) -> (py-list-pop obj a)
                         (hash _) -> (py-hash-pop obj a)
                         (_ _)    -> (call-method obj pop a))
#+END_SRC
*** python el lib
#+Begin_SRC emacs-lisp :tangle py-lib.el
  (defun py-list-pop (list &optional index)
    "remove and return item at INDEX from LIST (default last)"
    (let ((rest list)
          (i 0)
          last ret)
      (if index
          (if (= index 0)
              (progn
                (setq ret (car list))
                (setcar list (cadr list))
                (setcdr list (cddr list))
                ret)
            ;; 0 < index < len(list)
            (while (< i index)
              (setq last rest
                    rest (cdr rest)
                    i (1+ i)))
            (setq ret (car rest))
            (setcdr last (cdr rest))
            ret)
        ;;pop last element
        (while (cdr rest)
          (setq prev rest
                rest (cdr rest)))
        (setq ret (car rest))
        (setcdr prev nil))
      ret))
  
  (defun py-hash-pop (ht key)
    (let ((ret (gethash key ht)))
      (remhash key ht)
      ret))
#+END_SRC
