pyel-tests.el
 ("'aaaxaaa'.find('x',3)"  3)
 ("'aaaxaaa'.find('x',4)"  -1)
 ("'aaaxaaa'.find('x',2, 4)"  3)
 ("'aaaxaaa'.find('x',1, 3)"  -1)
 ("x = 'asdf'"
  ("x.find('sd')" 1)))

(pyel-create-tests
 index-method
 ;;lists
 ("x = [1,(1,2),'5']"
  ("x.index(1)" 0 )
  ("x.index((1,2))" 1)
  ("x.index('5')" 2))
 ;;strings
 ("x = 'importantstring'"
  ("x.index('t')" 5)
  ("x.index('or')" 3)
  ("x.index('g')" 14)
  ("x.index(x)" 0))
  ("x = 'str.ing'"
   ("x.index('.')" 3))
 ;;arrays
 ("x = (1,2,'tree',(3,))"
  ("x.index(1)" 0)
  ("x.index('tree')" 2)
  ("x.index((3,))" 3)))

(pyel-create-tests
 remove-method
 ("x = [1,'2','2',(1,)]
y = x
x.remove('2')"
  ("x is y" t))
 
 ("x = [1,'2','2',(1,)]
x.remove('2')"
  ("x" '(1 "2" [1])))
 
 ("x = [1,'2','2',(1,)]
x.remove(1)"
  ("x" '("2" "2" [1])))
 
 ("x = [1,'2','2',(1,)]
x.remove((1,))"
  ("x" '(1 "2" "2"))))

(pyel-create-tests
 count-method
 ;;strings
 ("'xxxxx'.count('x')" 5)
 ("'xxxx'.count('xx')" 2)
 ("'xxxx'.count('xxxx')" 1)
 ("'x.xx'.count('.')" 1)
 ;;lists
 ("x = [1,2,3,3,[2],'s']"
  ("x.count(3)" 2)
  ("x.count(2)" 1)
  ("x.count([3,4])" 1)
  ("x.count('s')" 1))
 ;;vector
 ("x = (1,2,3,3,[2],'s')"
  ("x.count(3)" 2)
  ("x.count(2)" 1)
  ("x.count([3,4])" 1)
  ("x.count('s')" 1))
 ("(1,1,1).count(1)" 3))

(pyel-create-tests
 join-method
 ("'X'.join(('f','g'))" "fXg")
 ("' '.join([str(x) for x in range(3)])" "0 1 2")
 ("''.join(['a','b']))" "ab"))

(pyel-create-tests
 extend-method
 ;;extend with list
 ("x = [1]
y = x
x.extend([1,'2',(3,)])"
  ("x is y" t)
  ("x" '(1 1 "2" [3])))
 ;;extend with vector
 ("x = [1]
y = x
x.extend((1,'2',(3,)))"
  ("x is y" t)
  ("x" '(1 1 "2" [3])))
 ;;extend with string
 ("x = [1]
y = x
x.extend('extended')"
  ("x is y" t)
  ("x" '(1 "e" "x" "t" "e" "n" "d" "e" "d")))
 ;;extend with object
 ("class a:
 x = 5
 def __iter__(self):
  return self
 def __next__(self):
  if self.x > 0:
   ret = str(self.x)
   self.x -= 1
   return ret
  raise StopIteration
obj = a()
x = [1]
y = x
x.extend(obj)"
  ("y is x" t)
  ("x" '(1 "5" "4" "3" "2" "1"))))

(pyel-create-tests
 pop-method
 ("x = [[1],'s',(2,), 1, 4]
y = x
a = x.pop()
b = x.pop(0)
c = x.pop(2)
 "
  ("a" 4)
  ("b" '(1))
  ("c" 1)
  ("x is y" t))

 ("x = {1:'one',2:'two',3:'three'}
y = x.pop(2)"
  ("y" "two") 
