pyel-transforms.el

(pyel-method-transform insert (obj i x)
                       (list _) -> (py-insert obj i x)
                       (_ _) -> (call-method obj insert i x))

(pyel-method-transform find (obj sub &optional start end)
                       (string _ _ _) -> (py-find obj sub start end)
                       (_ _ _ _)      -> (call-method obj find sub start end))

(pyel-method-transform index (obj elem)
                       (list _) -> (list-index elem obj)
                       (string _) -> (py-string-index obj elem)
                       (object _) -> (call-method obj index elem)
                       (vector _) -> (vector-index elem obj))

(pyel-method-transform remove (obj x)
                       (list _) -> (py-list-remove obj x)
                       (_ _) -> (call-method obj remove x))

(pyel-method-transform count (obj elem)
                       (string _) -> (count-str-matches obj elem)
                       (list _) -> (count-elems-list obj elem)
                       (object _)  -> (call-method obj count elem)
                       (vector _) -> (count-elems-vector obj elem))

(pyel-method-transform join (obj elem)
                       (string _) ->  (mapconcat 'identity elem obj)
                       (_ _)      -> (call-method obj join thing))

(pyel-method-transform extend (obj elem)
                       (list _) ->  (py-list-extend obj elem)
                       (_ _)    ->  (call-method obj extend elem))

(pyel-method-transform pop (obj &optional a)
                       (list _) -> (py-list-pop obj a)
                       (hash _) -> (py-hash-pop obj a)
                       (_ _)    -> (call-method obj pop a))
