pyel.org
*** tests
#+Begin_SRC emacs-lisp :tangle pyel-tests.el
  (pyel-create-tests
   pop-method
   ("x = [[1],'s',(2,), 1, 4]
  y = x
  a = x.pop()
  b = x.pop(0)
  c = x.pop(2)
   "
    ("a" 4)
    ("b" '(1))
    ("c" 1)
    ("x is y" t))
  
   ("x = {1:'one',2:'two',3:'three'}
  y = x.pop(2)"
    ("y" "two") 
    ("repr(x)" "{1: \"one\", 3: \"three\"}"))
   )
#+END_SRC
** reverse
*** transform
#+Begin_SRC emacs-lisp :tangle pyel-transforms.el
  (pyel-method-transform reverse (obj)
                         (list) ->  (pyel-list-reverse obj)
                         (_)    ->  (call-method obj reverse))
#+END_SRC
*** python el lib
#+Begin_SRC emacs-lisp :tangle py-lib.el
  (defun pyel-list-reverse (list)
    "reverse LIST *IN PLACE*"
    (let ((reversed (reverse list))
          (rest list))
      (while reversed
        (setcar rest (car reversed))
        (setq reversed (cdr reversed)
              rest (cdr rest)))))
#+END_SRC
*** tests
#+Begin_SRC emacs-lisp :tangle pyel-tests.el
  (pyel-create-tests
   reverse-method
   ("x = [1,2,3]
  y = x
  x.reverse()"
    ("x" '(3 2 1))
    ("x is y" t)))
#+END_SRC
** lower
*** transform
#+Begin_SRC emacs-lisp :tangle pyel-transforms.el
  (pyel-method-transform lower (obj)
                         (string) ->  (downcase obj)
                         (_)    ->  (call-method obj lower))
#+END_SRC
*** tests
#+Begin_SRC emacs-lisp :tangle pyel-tests.el
  (pyel-create-tests
   lower-method
   ("x = 'aB'
  y = x
  y = x.lower()"
    ("y" "ab")
    ("x" "aB")))
#+END_SRC
** upper
*** transform
#+Begin_SRC emacs-lisp :tangle pyel-transforms.el
  (pyel-method-transform upper (obj)
                         (string) ->  (upcase obj)
                         (_)    ->  (call-method obj upper))
#+END_SRC
*** tests
#+Begin_SRC emacs-lisp :tangle pyel-tests.el
  (pyel-create-tests
   upper-method
   ("x = 'aB'
  y = x
  y = x.upper()"
    ("y" "AB")
    ("x" "aB")))
#+END_SRC
** split
*** transform
#+Begin_SRC emacs-lisp :tangle pyel-transforms.el
  (pyel-method-transform split (obj &optional sep maxsplit)
                         (string) ->  (pyel-split obj sep maxsplit)
                         (_)    ->  (call-method obj split sep maxsplit))
#+END_SRC
*** python el lib
#+Begin_SRC emacs-lisp :tangle py-lib.el
  (defun pyel-split (string &optional sep maxsplit)
    
    (let ((sep (or (and sep (regexp-quote sep)) "[ \f\t\n\r\v]+")) ;;correct default?
          (ret (split-string string sep t)))
      (if maxsplit
          ret ;;TODO
        ret)))
#+END_SRC
*** tests
#+Begin_SRC emacs-lisp :tangle pyel-tests.el
  (pyel-create-tests
   split-method
   ("x = 'a b c'
  y = x.split()"
    ("y" '("a" "b" "c")))
   ("'a b c'.split()" '("a" "b" "c"))
   ("y = 'a x b x d x'.split()"
    ("y" '("a" "x" "b" "x" "d" "x"))
    ("len(y)" 6)))
#+END_SRC
** strip
*** transform
#+Begin_SRC emacs-lisp :tangle pyel-transforms.el
  (pyel-method-transform strip (obj &optional chars)
                         (string) ->  (pyel-strip obj chars)
                         (_)    ->  (call-method obj strip chars))
#+END_SRC
*** python el lib
#+Begin_SRC emacs-lisp :tangle py-lib.el
  (defun pyel-strip-left (s &optional chars)
    "Remove whitespace or CHARS at the beginning of S."
    (let ((chars (if chars (format "\\`[%s]+" chars)
                   "\\`[ \t\n\r]+")))
      (if (string-match chars s)
          (replace-match "" t t s)
        s)))
  
  (defun pyel-strip-right (s &optional chars)
    "Remove whitespace or CHARS at the end of S."
    (let ((chars (if chars (format "[%s]+\\'" chars)
                   "[ \t\n\r]+\\'")))
      (if (string-match chars s)
          (replace-match "" t t s)
        s)))
  
  (defun pyel-strip (s &optional chars)
    "Remove whitespace or CHARS at the beginning and end of S."
    (pyel-strip-left (pyel-strip-right s chars) chars))
  
#+END_SRC
*** tests
#+Begin_SRC emacs-lisp :tangle pyel-tests.el
  (pyel-create-tests
   strip-method
   ("'\r\nhello \t'.strip('heo')" "hello")
   ("'hello'.strip('heo')" "ll")
   ("x = 'hello'"
    ("x.strip('hlo')" "e")))
#+END_SRC
** get
*** transform
#+Begin_SRC emacs-lisp :tangle pyel-transforms.el
  (pyel-method-transform get (obj key &optional default)
                         (hash) ->  (gethash key obj default)
                         (_)    ->  (call-method-with-defaults obj get
                                                               (key) (default)))
#+END_SRC
*** tests
#+Begin_SRC emacs-lisp :tangle pyel-tests.el
  (pyel-create-tests
   get-method
   ("x = {1:'one',2:'two',3:'three'}"
    ("x[1]" "one")
    ("x[1] == x.get(1)" t)
    ("x.get(3, 'd')" "three")
    ("x.get(4, 'd')" "d")))
#+END_SRC
** items
*** transform
#+Begin_SRC emacs-lisp :tangle pyel-transforms.el
  (pyel-method-transform items (obj)
                           (hash) -> (pyel-dict-items obj)
                           (_)    -> (call-method obj items))
#+END_SRC
*** python el lib
#+Begin_SRC emacs-lisp :tangle py-lib.el
  (defun pyel-dict-items (dict)
    (let (ret)
      (maphash (lambda (key value)
                 (push (list key value) ret))
               dict)
      ret))
#+END_SRC
*** tests
#+Begin_SRC emacs-lisp :tangle pyel-tests.el
  (pyel-create-tests
   items-method
   ("x = {1:'one',2:'two',3:'three'}
  y = {8 : 88}
  z = {}"
    ("x.items()" '((3 "three") (2 "two") (1 "one")))
    ("y.items()" '((8 88)))
    ("z.items()" nil)))
#+END_SRC
** keys
*** transform
#+Begin_SRC emacs-lisp :tangle pyel-transforms.el
  (pyel-method-transform keys (obj)
                             (hash) -> (pyel-dict-keys obj)
                             (_)    -> (call-method obj key))
#+END_SRC
*** python el lib
#+Begin_SRC emacs-lisp :tangle py-lib.el
  (defun pyel-dict-keys (dict)
    (let (ret)
      (maphash (lambda (key value)
                 (push key ret))
               dict)
      ret))
#+END_SRC
*** tests
#+Begin_SRC emacs-lisp :tangle pyel-tests.el
  (pyel-create-tests
   keys-method
   ("x = {1:'one',2:'two',3:'three'}
  y = {8 : 88}
  z = {}"
    ("x.keys()" '(3 2 1))
    ("y.keys()" '((8)))
    ("z.keys()" nil)))
#+END_SRC
** values
*** transform
#+Begin_SRC emacs-lisp :tangle pyel-transforms.el
  (pyel-method-transform values (obj)
                         (hash) -> (pyel-dict-values obj)
                         (_)    -> (call-method obj values))
#+END_SRC
*** python el lib
#+Begin_SRC emacs-lisp :tangle py-lib.el
  (defun pyel-dict-values (dict)
    (let (ret)
      (maphash (lambda (key value)
                 (push value ret))
               dict)
      ret))
#+END_SRC
*** tests
#+Begin_SRC emacs-lisp :tangle pyel-tests.el
  (pyel-create-tests
   values-method
   ("x = {1:'one',2:'two',3:'three'}
  y = {8 : 88}
  z = {}"
    ("x.values()" '("three" "two" "one"))
    ("y.values()" '(88))
    ("z.values()" nil)))
#+END_SRC
** popitem
*** transform
#+Begin_SRC emacs-lisp :tangle pyel-transforms.el
  (pyel-method-transform popitem (obj)
                         (hash) -> (pyel-hash-popitem obj)
                         (_)    -> (call-method obj popitem))
#+END_SRC
*** python el lib
#+Begin_SRC emacs-lisp :tangle py-lib.el
  (defun pyel-hash-popitem (ht)
    (let* ((key (catch '_pop_
                  (maphash (lambda (k v)
                             (throw '_pop_ k))
                           ht)))
           (ret (list key (gethash key ht))))
      (remhash key ht)
      ret))
#+END_SRC
*** tests
#+Begin_SRC emacs-lisp :tangle pyel-tests.el
  (pyel-create-tests
   popitem-method
   ("x = {1:'one',2:'two',3:'three'}
  y = x.popitem()"
    ("y" '(1 "one"))
    ("repr(x)" "{2: \"two\", 3: \"three\"}")))
#+END_SRC
** copy
*** transform
#+Begin_SRC emacs-lisp :tangle pyel-transforms.el
  (pyel-method-transform copy (obj)
                         (hash) -> (copy-hash-table obj)
                         (_)    -> (call-method obj popitem))
#+END_SRC
*** python el lib
#+Begin_SRC emacs-lisp :tangle py-lib.el

#+END_SRC
*** tests
#+Begin_SRC emacs-lisp :tangle pyel-tests.el
  (pyel-create-tests
   copy-method
   ("x = {1:['one'],2:'two',3:'three'}
  y = x
  z = x.copy()"
    ("x is z" nil)
    ("x[1] is z[1]" t)))
#+END_SRC
** islower
*** transform
#+Begin_SRC emacs-lisp :tangle pyel-transforms.el
  (pyel-method-transform islower (obj)
                         (string) -> (py-islower obj)
                         (_)      -> (call-method obj islower))
#+END_SRC
*** python el lib
#+Begin_SRC emacs-lisp :tangle py-lib.el
  (defun pyel-gen-match-code (regex str)
    "return code that tests if REGEX matches STR
  if STR is constant, return t if it matches, else nil"
    (let ((case-fold-search nil))
      (if (stringp str)
          (numberp (string-match regex str))
        `(let ((case-fold-search nil))
           (numberp (string-match ,regex ,str))))))
  
  
  (defmacro py-islower (s)
    "S.islower() -> bool
  
  Return t if all cased characters in S are lowercase and there is
  at least one cased character in S, False otherwise."
    (pyel-gen-match-code "^[^A-Z]*[a-z]+[^A-Z]*$" s))
#+END_SRC
*** tests
#+Begin_SRC emacs-lisp :tangle pyel-tests.el
  (pyel-create-tests
   islower-method
   ("a = 'A'
  b = 'a'
  c = 'Aa'"
    ("a.islower()" nil)
    ("b.islower()" t)
    ("c.islower()" nil))
   ("'A1'.islower()" nil)
   ("'a1'.islower()" t)
   ("'11'.islower()" nil))
#+END_SRC

** isupper
*** transform
#+Begin_SRC emacs-lisp :tangle pyel-transforms.el
  (pyel-method-transform isupper (obj)
                         (string) -> (py-isupper obj)
                         (_)      -> (call-method obj isupper))
#+END_SRC
*** python el lib
#+Begin_SRC emacs-lisp :tangle py-lib.el
  (defmacro py-isupper (s)
    "S.isupper() -> bool
  
  Return True if all cased characters in S are uppercase and there is
  at least one cased character in S, False otherwise."
  (pyel-gen-match-code "^[^a-z]*[A-Z]+[^a-z]*$" s))
#+END_SRC
*** tests
#+Begin_SRC emacs-lisp :tangle pyel-tests.el
  (pyel-create-tests
   isupper-method
   ("a = 'A'
  b = 'a'
  c = 'Aa'"
    ("a.isupper()" t)
    ("b.isupper()" nil)
    ("c.isupper()" nil))
   ("'A1'.isupper()" t)
   ("'a1'.isupper()" nil)
   ("'11'.isupper()" nil))
#+END_SRC
** istitle
*** transform
#+Begin_SRC emacs-lisp :tangle pyel-transforms.el
  (pyel-method-transform istitle (obj)
                         (string) -> (py-istitle obj)
                         (_)      -> (call-method obj istitle))
#+END_SRC
*** python el lib
#+Begin_SRC emacs-lisp :tangle py-lib.el
  (defmacro py-istitle (s)
  "  S.istitle() -> bool
  
      Return True if S is a titlecased string and there is at least one
      character in S, i.e. upper- and titlecase characters may only
      follow uncased characters and lowercase characters only cased ones.
      Return False otherwise.  "
  
    (pyel-gen-match-code "^[^a-zA-Z]*[A-Z][^A-Z]*$" s))
#+END_SRC
