pyel-transforms.el

(pyel-method-transform reverse (obj)
                       (list) ->  (pyel-list-reverse obj)
                       (_)    ->  (call-method obj reverse))

(pyel-method-transform lower (obj)
                       (string) ->  (downcase obj)
                       (_)    ->  (call-method obj lower))

(pyel-method-transform upper (obj)
                       (string) ->  (upcase obj)
                       (_)    ->  (call-method obj upper))

(pyel-method-transform split (obj &optional sep maxsplit)
                       (string) ->  (pyel-split obj sep maxsplit)
                       (_)    ->  (call-method obj split sep maxsplit))

(pyel-method-transform strip (obj &optional chars)
                       (string) ->  (pyel-strip obj chars)
                       (_)    ->  (call-method obj strip chars))

(pyel-method-transform get (obj key &optional default)
                       (hash) ->  (gethash key obj default)
                       (_)    ->  (call-method-with-defaults obj get
                                                             (key) (default)))

(pyel-method-transform items (obj)
                         (hash) -> (pyel-dict-items obj)
                         (_)    -> (call-method obj items))

(pyel-method-transform keys (obj)
                           (hash) -> (pyel-dict-keys obj)
                           (_)    -> (call-method obj key))

(pyel-method-transform values (obj)
                       (hash) -> (pyel-dict-values obj)
                       (_)    -> (call-method obj values))

(pyel-method-transform popitem (obj)
                       (hash) -> (pyel-hash-popitem obj)
                       (_)    -> (call-method obj popitem))

(pyel-method-transform copy (obj)
                       (hash) -> (copy-hash-table obj)
                       (_)    -> (call-method obj popitem))

(pyel-method-transform islower (obj)
                       (string) -> (py-islower obj)
                       (_)      -> (call-method obj islower))

(pyel-method-transform isupper (obj)
                       (string) -> (py-isupper obj)
                       (_)      -> (call-method obj isupper))

(pyel-method-transform istitle (obj)
                       (string) -> (py-istitle obj)
                       (_)      -> (call-method obj istitle))
