pyel.org
*** tests
#+Begin_SRC emacs-lisp :tangle pyel-tests.el
  (pyel-create-tests
   istitle-method
   ("a = 'sldk'
  b = 'Dsldk'
  c = 'aDsldk'"
    ("a.istitle()" nil)
    ("b.istitle()" t)
    ("c.istitle()" nil))
   ("'2Dsldk'.istitle()" t)
   ("'DDsldk'.istitle()" nil)
   ("'LDKJ'.istitle()" nil)
   ("''.istitle()" nil))
#+END_SRC
** isalpha
*** transform
#+Begin_SRC emacs-lisp :tangle pyel-transforms.el
  (pyel-method-transform isalpha (obj)
                         (string) -> (py-isalpha obj)
                         (_)      -> (call-method obj isalpha))  
#+END_SRC
*** python el lib
#+Begin_SRC emacs-lisp :tangle py-lib.el
  (defmacro py-isalpha (s)
      "S.isalpha() -> bool
    
    Return True if all characters in S are alphabetic
    and there is at least one character in S, False otherwise."
    
      (pyel-gen-match-code "^[a-zA-Z]+$" s))
#+END_SRC
*** tests
#+Begin_SRC emacs-lisp :tangle pyel-tests.el
(pyel-create-tests
 isalpha-method
 ("'a'.isalpha()" t)
 ("'aBc'.isalpha()" t)
 ("'2'.isalpha()" nil)
 ("'a2B'.isalpha()" nil)
 ("''.isalpha()" nil)
 ("x = 'asd'"
  ("x.isalpha()" t)))  
#+END_SRC
** isalnum
*** transform
#+Begin_SRC emacs-lisp :tangle pyel-transforms.el
  (pyel-method-transform isalnum (obj)
                         (string) -> (py-isalnum obj)
                         (_)      -> (call-method obj isalnum))

#+END_SRC
*** python el lib
#+Begin_SRC emacs-lisp :tangle py-lib.el
  (defmacro py-isalnum (s)
    "S.isalnum() -> bool
  
      Return True if all characters in S are alphanumeric
      and there is at least one character in S, False otherwise."
  
    (pyel-gen-match-code "^[0-9]+$" s))
#+END_SRC
*** tests
#+Begin_SRC emacs-lisp :tangle pyel-tests.el
  (pyel-create-tests
   isalnum-method
   ("'0'isalnum()" t)
   ("'0'isalnum()"  t)
   ("'0s'.isalnum()" nil)
   ("''.isalnum()" nil)
   ("'0.1'.isalnum()" nil)
   ("x = '23'"
    ("x.isalnum()" t)))
  
#+END_SRC
** zfill
*** transform
#+Begin_SRC emacs-lisp :tangle pyel-transforms.el
  (pyel-method-transform zfill (obj width)
                         (string) -> (py-zfill obj width)
                         (_)      -> (call-method obj zfill width))
#+END_SRC
*** python el lib
#+Begin_SRC emacs-lisp :tangle py-lib.el
  (defun py-zfill (str width)
    " S.zfill(width) -> str
  
  Pad a numeric string S with zeros on the left, to fill a field
  of the specified width. The string S is never truncated."
    (let ((diff (- width (length str))))
      (if (> diff 0)
          (concat (make-string diff ?0) str)
        str)))
#+END_SRC
*** tests
#+Begin_SRC emacs-lisp :tangle pyel-tests.el
  (pyel-create-tests
   zfill-method
   ("a = 'asdf'"
    ("a.zfill(10)" "000000asdf"))
   ("'34'.zfill(5)" "00034")
   ("'234789'.zfill(5)" "234789")
   ("''.zfill(5)" "00000"))  
#+END_SRC
** title
*** transform
#+Begin_SRC emacs-lisp :tangle pyel-transforms.el
  (pyel-method-transform title (obj)
                         (string) -> (py-title obj)
                         (_)      -> (call-method obj title))  
#+END_SRC
*** python el lib
#+Begin_SRC emacs-lisp :tangle py-lib.el
  (defun py-title (s)
    "Return a titlecased version of S, i.e. words start with title case
  characters, all remaining cased characters have lower case."
    (let ((case-fold-search nil))
      (if (eq s "")
          ""
        (if (string-match "^\\([^A-Za-z]*\\)\\([A-Za-z]\\)\\(.*\\)$" s)
            (concat (match-string 1 s)
                    (upcase (match-string 2 s))
                    (downcase (match-string 3 s)))
          s))))
#+END_SRC
*** tests
#+Begin_SRC emacs-lisp :tangle pyel-tests.el
  (pyel-create-tests
   title-method
   ("'sldk'.title()" "Sldk")
   ("'s'.title()" "S")
   ("''.title()" "")
   ("'2dd'.title()" "2Dd")
   ("'2ddlkDd'.title()" "2Ddlkdd")
   ("'23(23aaaaa'.title()" "23(23Aaaaa")
   ("'343'.title()" "343")
   ("x = '2dd'"
    ("x.title()" "2dd")))
#+END_SRC
** swapcase
*** transform
#+Begin_SRC emacs-lisp :tangle pyel-transforms.el
  (pyel-method-transform swapcase (obj)
                         (string) -> (py-swapcase obj)
                         (_)      -> (call-method obj swapcase))
#+END_SRC
*** python el lib
#+Begin_SRC emacs-lisp :tangle py-lib.el
  (defun py-swapcase (s)
    "swapcase(...)
  S.swapcase() -> str
  
  Return a copy of S with uppercase characters converted to lowercase
  and vice versa."
    (let ((i (length s)))
      (while (> i 0)
        (setq i (1- i))
        (aset s i (let ((char (aref s i)))
                    (if (eq (downcase char) char)
                        (upcase char)
                      (downcase char)))))
      s))
#+END_SRC
*** tests
#+Begin_SRC emacs-lisp :tangle pyel-tests.el
  (pyel-create-tests
   swapcase-method
   ("'ab'.swapcase()"  "AB")
   ("'aB'.swapcase()"  "Ab")
   ("'aB1'.swapcase()"  "Ab1")
   ("'11'.swapcase()" "11")
   ("''.swapcase()"  "")
   ("x = 'aaBB1'"
    ("x.swapcase()" "AAbb1")))  
#+END_SRC
** startswith
*** transform
#+Begin_SRC emacs-lisp :tangle pyel-transforms.el
  (pyel-method-transform startswith (obj prefix &optional start end)
                         (string _ _ _) -> (py-startswith obj prefix start end)
                         (_ _ _ _)            -> (call-method obj startswith prefix start end))
#+END_SRC
*** python el lib
#+Begin_SRC emacs-lisp :tangle py-lib.el
  (defun py-startswith (s prefix &optional start end)
    "S.startswith(prefix[, start[, end]]) -> bool
  
  Return True if S starts with the specified prefix, False otherwise.
  With optional start, test S beginning at that position.
  With optional end, stop comparing S at that position.
  prefix can also be a tuple of strings to try."  
    (setq start (or start 0))
    (cond ((stringp prefix)
           (if (string-match (concat "^" (regexp-quote prefix)) (substring s start end))
               t nil))
          ((vectorp prefix)
           (let ((found nil)
                 (i 0)
                 (len (length prefix)))
             (while (< i len)
               (if (py-startswith s (aref prefix i) start end)
                   (setq found t
                         i len)
                 (setq i (1+ i))))
             found))
          (t (py-raise (TypeError (format "startswith first arg must be str or a tuple of str, not %s" (py-type prefix)))))))
#+END_SRC
*** tests
#+Begin_SRC emacs-lisp :tangle pyel-tests.el
  (pyel-create-tests
   startswith-method
   ("'abcde'.startswith('bcd', 1, 2)" nil)
   ("'abcde'.startswith('bcd', 1, 3)" nil)
   ("'abcde'.startswith('bcd', 1, 4)" t)
   ("'abcde'.startswith('bcd', 1)" t)
   ("'abcde'.startswith('x', 1)" nil)
   ("'abcde'.startswith('abc')" t)
   ("'$abcde'.startswith('$abc')" t)
   ("'abcde'.startswith('.')" nil)
   ("x = 'abcde'"
    ("x.startswith('.')" nil))
   ("'abcde'.startswith(('.', 'b'))" nil)
   ("'abcde'.startswith(('.', 'b','a'))" t))
#+END_SRC
** splitlines
*** transform
#+Begin_SRC emacs-lisp :tangle pyel-transforms.el
  (pyel-method-transform splitlines (obj &optional keepends)
                         (string) -> (py-splitlines obj keepends)
                         (_)      -> (call-method obj splitlines keepends))
#+END_SRC
*** python el lib
#+Begin_SRC emacs-lisp :tangle py-lib.el
  (defun py-splitlines (string &optional keepends)
    ;;based off code from `split-string'
    (let ((start 0)
          notfirst
          (list nil)
          (len (length string))
          str)
  
      (while (and (string-match "\n" string
                                (if (and notfirst
                                         (= start (match-beginning 0))
                                         (< start len))
                                    (1+ start) start))
                  (< start len))
        (setq notfirst t
              str (substring string start (match-beginning 0)))
        (if keepends (setq str (concat str "\n")))
        (setq list (cons str list)
              start (match-end 0)))
  
      (setq str (substring string start))
      (unless (eq str "")
        (if keepends (setq str (concat str "\n")))
        (setq list (cons str list)))
      (nreverse list)))  
#+END_SRC
*** tests
#+Begin_SRC emacs-lisp :tangle pyel-tests.el
  (pyel-create-tests
   splitlines-method
   ("'''a
  b
  c
  
  '''.splitlines()" '("a" "b" "c" ""))
   ("x =  '''a
  
  b
  c
  
  '''.splitlines()" '("a" "" "" "b" "c" ""))
   ("''.splitlines()" nil)
   ("'asdf'.splitlines()" '("asdf")))
#+END_SRC
** rstrip
*** transform
#+Begin_SRC emacs-lisp :tangle pyel-transforms.el
  (pyel-method-transform rstrip (obj &optional chars)
                         (string) -> (py-rstrip obj chars)
                         (_)      -> (call-method obj rstrip chars))
#+END_SRC
*** python el lib
#+Begin_SRC emacs-lisp :tangle py-lib.el
  (defun py-rstrip (s &optional chars)
    "S.rstrip([chars]) -> str
  
  Return a copy of the string S with trailing whitespace removed.
  If chars is given and not None, remove characters in chars instead."
    (pyel-strip-right s chars))
#+END_SRC
*** tests
#+Begin_SRC emacs-lisp :tangle pyel-tests.el
  (pyel-create-tests
   rstrip-method
   ("'hello'.rstrip('heo')" "hell")
   ("'\thello\t  '.rstrip()" "    hello")
   ("x = 'hello'"
    ("x.rstrip('hlo')" "he")))  
#+END_SRC
** lstrip
*** transform
#+Begin_SRC emacs-lisp :tangle pyel-transforms.el
  (pyel-method-transform lstrip (obj &optional chars)
                         (string) -> (py-lstrip obj chars)
                         (_)      -> (call-method obj lstrip chars))
#+END_SRC
*** python el lib
#+Begin_SRC emacs-lisp :tangle py-lib.el
  (defun py-lstrip (s &optional chars)
    "S.lstrip([chars]) -> str
  
  Return a copy of the string S with leading whitespace removed.
  If chars is given and not None, remove characters in chars instead."
    (pyel-strip-left s chars))
#+END_SRC
*** tests
#+Begin_SRC emacs-lisp :tangle pyel-tests.el
  (pyel-create-tests
   lstrip-method
   ("'hello'.lstrip('heo')" "llo")
   ("'\thello\t  '.lstrip()" "hello         ")
   ("x = 'hello'"
    ("x.lstrip('hlo')" "ello")))
#+END_SRC
** rsplit
*** transform
#+Begin_SRC emacs-lisp :tangle pyel-transforms.el
  (pyel-method-transform rsplit (obj &optional sep maxsplit)
                         (string) ->  (pyel-rsplit obj sep maxsplit)
                         (_)    ->  (call-method obj rsplit sep maxsplit))
#+END_SRC
*** python el lib
#+Begin_SRC emacs-lisp :tangle py-lib.el
  (defun pyel-rsplit (string &optional sep maxsplit)
    (pyel-split string sep maxsplit)) ;;TODO: properly implement this
#+END_SRC
*** tests
#+Begin_SRC emacs-lisp :tangle pyel-tests.el
  (pyel-create-tests
   rsplit-method
   ("x = 'a b c'
  y = x.rsplit()"
    ("y" '("a" "b" "c")))
   ("'a b c'.rsplit()" '("a" "b" "c"))
   ("y = 'a x b x d x'.rsplit()"
    ("y" '("a" "x" "b" "x" "d" "x"))
    ("len(y)" 6)))
#+END_SRC
** partition
*** transform
#+Begin_SRC emacs-lisp :tangle pyel-transforms.el
  (pyel-method-transform partition (obj sep)
                         (string) ->  (py-partition obj sep)
                         (_)    ->  (call-method obj partition sep))
#+END_SRC
*** python el lib
#+Begin_SRC emacs-lisp :tangle py-lib.el
  (defun py-partition (s sep)
    "S.partition(sep) -> (head, sep, tail)
  
  Search for the separator sep in S, and return the part before it,
  the separator itself, and the part after it.  If the separator is not
  found, return S and two empty strings."
    (if (string-match (format "^\\(.*\\)%s\\(.*\\)$" (regexp-quote sep))  s)
        (vector (match-string 1 s) sep (match-string 2 s))
      (vector s "" "")))
#+END_SRC
