pyel-tests.el
 ("'2Dsldk'.istitle()" t)
 ("'DDsldk'.istitle()" nil)
 ("'LDKJ'.istitle()" nil)
 ("''.istitle()" nil))

(pyel-create-tests
 isalpha-method
 ("'a'.isalpha()" t)
 ("'aBc'.isalpha()" t)
 ("'2'.isalpha()" nil)
 ("'a2B'.isalpha()" nil)
 ("''.isalpha()" nil)
 ("x = 'asd'"
  ("x.isalpha()" t)))

(pyel-create-tests
 isalnum-method
 ("'0'isalnum()" t)
 ("'0'isalnum()"  t)
 ("'0s'.isalnum()" nil)
 ("''.isalnum()" nil)
 ("'0.1'.isalnum()" nil)
 ("x = '23'"
  ("x.isalnum()" t)))

(pyel-create-tests
 zfill-method
 ("a = 'asdf'"
  ("a.zfill(10)" "000000asdf"))
 ("'34'.zfill(5)" "00034")
 ("'234789'.zfill(5)" "234789")
 ("''.zfill(5)" "00000"))

(pyel-create-tests
 title-method
 ("'sldk'.title()" "Sldk")
 ("'s'.title()" "S")
 ("''.title()" "")
 ("'2dd'.title()" "2Dd")
 ("'2ddlkDd'.title()" "2Ddlkdd")
 ("'23(23aaaaa'.title()" "23(23Aaaaa")
 ("'343'.title()" "343")
 ("x = '2dd'"
  ("x.title()" "2dd")))

(pyel-create-tests
 swapcase-method
 ("'ab'.swapcase()"  "AB")
 ("'aB'.swapcase()"  "Ab")
 ("'aB1'.swapcase()"  "Ab1")
 ("'11'.swapcase()" "11")
 ("''.swapcase()"  "")
 ("x = 'aaBB1'"
  ("x.swapcase()" "AAbb1")))

(pyel-create-tests
 startswith-method
 ("'abcde'.startswith('bcd', 1, 2)" nil)
 ("'abcde'.startswith('bcd', 1, 3)" nil)
 ("'abcde'.startswith('bcd', 1, 4)" t)
 ("'abcde'.startswith('bcd', 1)" t)
 ("'abcde'.startswith('x', 1)" nil)
 ("'abcde'.startswith('abc')" t)
 ("'$abcde'.startswith('$abc')" t)
 ("'abcde'.startswith('.')" nil)
 ("x = 'abcde'"
  ("x.startswith('.')" nil))
 ("'abcde'.startswith(('.', 'b'))" nil)
 ("'abcde'.startswith(('.', 'b','a'))" t))

(pyel-create-tests
 splitlines-method
 ("'''a
b
c

'''.splitlines()" '("a" "b" "c" ""))
 ("x =  '''a

b
c

'''.splitlines()" '("a" "" "" "b" "c" ""))
 ("''.splitlines()" nil)
 ("'asdf'.splitlines()" '("asdf")))

(pyel-create-tests
 rstrip-method
 ("'hello'.rstrip('heo')" "hell")
 ("'\thello\t  '.rstrip()" "    hello")
 ("x = 'hello'"
  ("x.rstrip('hlo')" "he")))

(pyel-create-tests
 lstrip-method
 ("'hello'.lstrip('heo')" "llo")
 ("'\thello\t  '.lstrip()" "hello         ")
 ("x = 'hello'"
  ("x.lstrip('hlo')" "ello")))

(pyel-create-tests
 rsplit-method
 ("x = 'a b c'
y = x.rsplit()"
  ("y" '("a" "b" "c")))
 ("'a b c'.rsplit()" '("a" "b" "c"))
 ("y = 'a x b x d x'.rsplit()"
  ("y" '("a" "x" "b" "x" "d" "x"))
  ("len(y)" 6)))

(pyel-create-tests
 partition-method
