pyel-transforms.el

(pyel-method-transform isalpha (obj)
                       (string) -> (py-isalpha obj)
                       (_)      -> (call-method obj isalpha))

(pyel-method-transform isalnum (obj)
                       (string) -> (py-isalnum obj)
                       (_)      -> (call-method obj isalnum))

(pyel-method-transform zfill (obj width)
                       (string) -> (py-zfill obj width)
                       (_)      -> (call-method obj zfill width))

(pyel-method-transform title (obj)
                       (string) -> (py-title obj)
                       (_)      -> (call-method obj title))

(pyel-method-transform swapcase (obj)
                       (string) -> (py-swapcase obj)
                       (_)      -> (call-method obj swapcase))

(pyel-method-transform startswith (obj prefix &optional start end)
                       (string _ _ _) -> (py-startswith obj prefix start end)
                       (_ _ _ _)            -> (call-method obj startswith prefix start end))

(pyel-method-transform splitlines (obj &optional keepends)
                       (string) -> (py-splitlines obj keepends)
                       (_)      -> (call-method obj splitlines keepends))

(pyel-method-transform rstrip (obj &optional chars)
                       (string) -> (py-rstrip obj chars)
                       (_)      -> (call-method obj rstrip chars))

(pyel-method-transform lstrip (obj &optional chars)
                       (string) -> (py-lstrip obj chars)
                       (_)      -> (call-method obj lstrip chars))

(pyel-method-transform rsplit (obj &optional sep maxsplit)
                       (string) ->  (pyel-rsplit obj sep maxsplit)
                       (_)    ->  (call-method obj rsplit sep maxsplit))

(pyel-method-transform partition (obj sep)
                       (string) ->  (py-partition obj sep)
                       (_)    ->  (call-method obj partition sep))

(pyel-method-transform rpartition (obj sep)
