pyel.org
*** tests
#+Begin_SRC emacs-lisp :tangle pyel-tests.el
  (pyel-create-tests
   partition-method
   ("'abcdefghi'.partition('c')" ["ab" "c" "defghi"])
   ("'abcdefghi'.partition('cde')" ["ab" "cde" "fghi"])
   ("'abcdefghi'.partition('x')" ["abcdefghi" "" ""])
   ("'x'.partition('x')" ["" "x" ""])
   ("x = 'abcdefghi'"
    ("x.partition('c')" ["ab" "c" "defghi"])))
#+END_SRC
** rpartition
*** transform
#+Begin_SRC emacs-lisp :tangle pyel-transforms.el
  (pyel-method-transform rpartition (obj sep)
                         (string) ->  (py-rpartition obj sep)
                         (_)      ->  (call-method obj rpartition sep))
#+END_SRC
*** python el lib
#+Begin_SRC emacs-lisp :tangle py-lib.el
  (defalias 'py-rpartition 'py-partition)
#+END_SRC
*** tests
#+Begin_SRC emacs-lisp :tangle pyel-tests.el
  (pyel-create-tests
   rpartition-method
   ("'abcdefghi'.rpartition('c')" ["ab" "c" "defghi"])
   ("'abcdefghi'.rpartition('cde')" ["ab" "cde" "fghi"])
   ("'abcdefghi'.rpartition('x')" ["abcdefghi" "" ""])
   ("'x'.rpartition('x')" ["" "x" ""])
   ("x = 'abcdefghi'"
    ("x.rpartition('c')" ["ab" "c" "defghi"])))
#+END_SRC
** rjust
*** transform
#+Begin_SRC emacs-lisp :tangle pyel-transforms.el
  (pyel-method-transform rjust (obj width &optional fillchar)
                         (string) -> (py-rjust obj width fillchar)
                         (_)      -> (call-method obj rjust width fillchar))
#+END_SRC
*** python el lib
#+Begin_SRC emacs-lisp :tangle py-lib.el
  (defun py-rjust (str width &optional fillchar)
    "S.rjust(width[, fillchar]) -> str
  
  Return S right-justified in a string of length width. Padding is
  done using the specified fill character (default is a space)."
    (if (> (length fillchar) 1)
        (py-raise (TypeError
                   "The fill character must be exactly one character long")))
    (let ((diff (- width (length str)))
          (fillchar (or fillchar " ")))
      (if (> diff 0)
          (concat (make-string diff (string-to-char fillchar)) str)
        str)))
#+END_SRC
*** tests
#+Begin_SRC emacs-lisp :tangle pyel-tests.el
  (pyel-create-tests
   rjust-method
   ("'hi'.rjust(10)"  "        hi")
   ("'hi'.rjust(7, '_')" "_____hi")
   ("'hi'.rjust(10)" "        hi")
   ("'hi'.rjust(3, '_')" "_hi")
   ("'hi'.rjust(7, '_')" "_____hi")
   ("'hisldkjf'.rjust(3, '_')" "hisldkjf")
   ("x = 'ab'"
    ("x.rjust(10)" "        ab")))  
#+END_SRC
** ljust
*** transform
#+Begin_SRC emacs-lisp :tangle pyel-transforms.el
  (pyel-method-transform ljust (obj width &optional fillchar)
                         (string) -> (py-ljust obj width fillchar)
                         (_)      -> (call-method obj ljust width fillchar))
#+END_SRC
*** python el lib
#+Begin_SRC emacs-lisp :tangle py-lib.el
  (defun py-ljust (str width &optional fillchar)
  "S.ljust(width[, fillchar]) -> str
  
  Return S left-justified in a Unicode string of length width. Padding is
  done using the specified fill character (default is a space)."
    (if (> (length fillchar) 1)
        (py-raise (TypeError
                   "The fill character must be exactly one character long")))
    (let ((diff (- width (length str)))
          (fillchar (or fillchar " ")))
      (if (> diff 0)
          (concat str (make-string diff (string-to-char fillchar)))
        str)))
#+END_SRC
*** tests
#+Begin_SRC emacs-lisp :tangle pyel-tests.el
  (pyel-create-tests
   ljust-method
   ("'hi'.ljust(10)"  "hi        ")
   ("'hi'.ljust(7, '_')" "hi_____")
   ("'hi'.ljust(10)" "hi        ")
   ("'hi'.ljust(3, '_')" "hi_")
   ("'hi'.ljust(7, '_')" "hi_____")
   ("'hisldkjf'.ljust(3, '_')" "hisldkjf")
   ("x = 'ab'"
    ("x.ljust(10)" "ab        ")))    
#+END_SRC
** rfind
*** transform
#+Begin_SRC emacs-lisp :tangle pyel-transforms.el
  (pyel-method-transform rfind (obj sub &optional start end)
                         (string) -> (py-rfind obj sub start end)
                         (_)      -> (call-method obj rfind sub start end))
#+END_SRC
*** python el lib
#+Begin_SRC emacs-lisp :tangle py-lib.el
  (defun pyel-reverse-string (string)
    (let ((start 0)
          (end (1- (length string)))
          tmp)
      (while (< start end)
        (setq tmp (aref string start))
        (aset string start (aref string end))
        (aset string end tmp)
        (setq start (1+ start)
              end (1- end)))
      string))
  
  (defun py-rfind(str sub &optional start end)
    "S.rfind(sub[, start[, end]]) -> int
  
  Return the highest index in S where substring sub is found,
  such that sub is contained within S[start:end].  Optional
  arguments start and end are interpreted as in slice notation.
  
  Return -1 on failure."
    (let* ((start (or start 0))
           (index (string-match
                   (pyel-reverse-string (regexp-quote sub))
                   (pyel-reverse-string (substring str start end)))))
      (if index
          ;;(+ index start)
          (- (length str)  index (length sub))
        -1)))
#+END_SRC
*** tests
#+Begin_SRC emacs-lisp :tangle pyel-tests.el
  (pyel-create-tests
   rfind-method
   ("'aaaxaaa'.rfind('x',3)"  3)
   ("'aaaxaaa'.rfind('x',4)"  -1)
   ("'aaaxaaa'.rfind('x',2, 4)"  3)
   ("'aaaxaaa'.rfind('x',1, 3)"  -1)
   ("'abcxebdxebdexed'.rfind('xe')" 12)
   ("x = 'asdf'
  y = 'abxabxab'"
    ("x.rfind('sd')" 1)
    ("y.rfind('ab')" 6)))
#+END_SRC
** rindex
*** transform
#+Begin_SRC emacs-lisp :tangle pyel-transforms.el
  (pyel-method-transform rindex (obj sub &optional start end)
                         (string) -> (py-rindex obj sub start end)
                         (_)      -> (call-method obj rindex sub start end))
#+END_SRC
*** python el lib
#+Begin_SRC emacs-lisp :tangle py-lib.el
  (defun py-rindex (str sub &optional start end)
    "S.rindex(sub[, start[, end]]) -> int
   
   Like S.rfind() but raise ValueError when the substring is not found.  "
    (let ((ret (py-rfind str sub start end)))
      (if (= ret -1)
          (py-raise (ValueError "substring not found"))
        ret)))
#+END_SRC
*** tests
#+Begin_SRC emacs-lisp :tangle pyel-tests.el
    
#+END_SRC
** replace
*** transform
#+Begin_SRC emacs-lisp :tangle pyel-transforms.el
  (pyel-method-transform replace (obj old new &optional count)
                         (string) -> (py-replace obj old new count)
                         (_)      -> (call-method obj replace old new count))
#+END_SRC
*** python el lib
#+Begin_SRC emacs-lisp :tangle py-lib.el
  (defun py-string-replace (string old new &optional count)
    "Return a copy of STRING with all occurrences of substring
  OLD replaced by NEW.  If the optional argument COUNT is
  given, only the first COUNT occurrences are replaced."
    ;;based on `replace-regexp-in-string'
  
    ;; To avoid excessive consing from multiple matches in long strings,
    ;; don't just call `replace-match' continually.  Walk down the
    ;; string looking for matches of REGEXP and building up a (reversed)
    ;; list MATCHES.  This comprises segments of STRING which weren't
    ;; matched interspersed with replacements for segments that were.
    ;; [For a `large' number of replacements it's more efficient to
    ;; operate in a temporary buffer; we can't tell from the function's
    ;; args whether to choose the buffer-based implementation, though it
    ;; might be reasonable to do so for long enough STRING.]
    (let ((case-fold-search nil)
          (replaced 0)
          (l (length string))
          (start 0)
          matches str mb me)
      (save-match-data
        (while (and
                (or (null count) (< replaced count))
                (< start l)
                (string-match old string start))
          (setq replaced (1+ replaced)
                mb (match-beginning 0)
                me (match-end 0))
          ;; If we matched the empty string, make sure we advance by one char
          (when (= me mb) (setq me (min l (1+ mb))))
          ;; Generate a replacement for the matched substring.
          ;; Operate only on the substring to minimize string consing.
          ;; Set up match data for the substring for replacement;
          ;; presumably this is likely to be faster than munging the
          ;; match data directly in Lisp.
          (string-match old (setq str (substring string mb me)))
          (setq matches
                (cons (replace-match new
                                     nil nil str)
                      (cons (substring string start mb) ; unmatched prefix
                            matches)))
          (setq start me))
        ;; Reconstruct a string from the pieces.
        (setq matches (cons (substring string start l) matches)) ; leftover
        (apply #'concat (nreverse matches)))))
#+END_SRC
*** tests
#+Begin_SRC emacs-lisp :tangle pyel-tests.el
    
#+END_SRC
** clear
*** transform
#+Begin_SRC emacs-lisp :tangle pyel-transforms.el
  (pyel-method-transform clear (obj)
                         (hash) -> (py-hash-table-clear obj)
                         (_)      -> (call-method obj clear))
#+END_SRC
*** python el lib
#+Begin_SRC emacs-lisp :tangle py-lib.el
  (defun py-hash-table-clear (ht)
    "Remove all items from hash table HT"
    (maphash (lambda (key value)
               (remhash key ht))
             ht))
#+END_SRC
*** tests
#+Begin_SRC emacs-lisp :tangle pyel-tests.el
    
#+END_SRC
** fromkeys
*** transform
#+Begin_SRC emacs-lisp :tangle pyel-transforms.el
  (pyel-method-transform fromkeys(obj keys &optional value)
                           (hash _ _) -> (py-fromkeys keys value)
                           (_)      -> (call-method obj fromkeys keys value))
#+END_SRC
*** python el lib
#+Begin_SRC emacs-lisp :tangle py-lib.el
  (defun py-fromkeys (keys &optional value)
    (let* ((len (length keys))
           (ht (make-hash-table :size len :test 'equal))
           (type (type-of keys))
           (i 0))
      (cond ((eq type 'cons)
             (while keys
               (puthash (car keys) value ht)
               (setq keys (cdr keys))))
            ((eq type 'string)
             (while (< i len)
               (puthash (substring keys i (1+ i)) value ht)
               (setq i (1+ i))))
            ((eq type 'vector)
             (while (< i len)
               (puthash (aref keys i) value ht)
               (setq i (1+ i)))
             )
            (t (error "py-fromkeys: invalid type for parameter 'keys'")))
      ht))  
#+END_SRC
*** tests
#+Begin_SRC emacs-lisp :tangle pyel-tests.el
    
#+END_SRC
** isprintable
*** transform
#+Begin_SRC emacs-lisp :tangle pyel-transforms.el
  (pyel-method-transform isprintable (obj)
                         (string) -> (py-isprintable obj)
                         (_)      -> (call-method obj isprintable))
#+END_SRC
*** python el lib
#+Begin_SRC emacs-lisp :tangle py-lib.el
  (defconst py-printable "0123456789abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ!\"#$%&\'()*+,-./:;<=>?@[\\]^_`{|}~ \t\n\r\x0b\x0c")
  
  (setq py-printable-ht (make-hash-table :test 'equal
                                         :size (* (length py-printable) 2)))
  (py-for c in py-printable
          (puthash c t py-printable-ht))
  
  ;;TODO: perhaps examining ascii values will be faster
  (defun py-isprintable(s)
    "S.isprintable() -> bool
  
  Return True if all characters in S are considered
  printable in repr() or S is empty, False otherwise."
    (let ((good t)
          (len (length s))
          (i 0))
      (while (and good (< i len))
        (if (not (gethash (pyel-string-nth s i) py-printable-ht))
            (setq good nil))
        (setq i (1+ i)))
      good))
  
#+END_SRC
*** tests
#+Begin_SRC emacs-lisp :tangle pyel-tests.el
    
#+END_SRC
** transform template
*** transform
#+Begin_SRC emacs-lisp :tangle pyel-transforms.el
;;
#+END_SRC
*** python ast
#+Begin_SRC python :tangle py-ast.py

#+END_SRC
*** python el lib
#+Begin_SRC emacs-lisp :tangle py-lib.el

#+END_SRC
*** tests
#+Begin_SRC emacs-lisp :tangle pyel-tests.el
;;
#+END_SRC
* macro transforms
macros and macroish primitives
** cond
*** tests
#+Begin_SRC emacs-lisp :tangle pyel-tests.el
  ;;;;errors with these
  ;; (pyel-create-tests cond
  ;;                    "x = cond([1 > 2, 'first']
  ;;    [2 == 2, 'second']
  ;;    [5 == 7, 'third']
  ;;    [True, error('wtf')])
  ;; assert x == 'second'"
  ;;                    )
#+END_SRC
** lambda
