pyel-tests.el
 ("'abcdefghi'.partition('c')" ["ab" "c" "defghi"])
 ("'abcdefghi'.partition('cde')" ["ab" "cde" "fghi"])
 ("'abcdefghi'.partition('x')" ["abcdefghi" "" ""])
 ("'x'.partition('x')" ["" "x" ""])
 ("x = 'abcdefghi'"
  ("x.partition('c')" ["ab" "c" "defghi"])))

(pyel-create-tests
 rpartition-method
 ("'abcdefghi'.rpartition('c')" ["ab" "c" "defghi"])
 ("'abcdefghi'.rpartition('cde')" ["ab" "cde" "fghi"])
 ("'abcdefghi'.rpartition('x')" ["abcdefghi" "" ""])
 ("'x'.rpartition('x')" ["" "x" ""])
 ("x = 'abcdefghi'"
  ("x.rpartition('c')" ["ab" "c" "defghi"])))

(pyel-create-tests
 rjust-method
 ("'hi'.rjust(10)"  "        hi")
 ("'hi'.rjust(7, '_')" "_____hi")
 ("'hi'.rjust(10)" "        hi")
 ("'hi'.rjust(3, '_')" "_hi")
 ("'hi'.rjust(7, '_')" "_____hi")
 ("'hisldkjf'.rjust(3, '_')" "hisldkjf")
 ("x = 'ab'"
  ("x.rjust(10)" "        ab")))

(pyel-create-tests
 ljust-method
 ("'hi'.ljust(10)"  "hi        ")
 ("'hi'.ljust(7, '_')" "hi_____")
 ("'hi'.ljust(10)" "hi        ")
 ("'hi'.ljust(3, '_')" "hi_")
 ("'hi'.ljust(7, '_')" "hi_____")
 ("'hisldkjf'.ljust(3, '_')" "hisldkjf")
 ("x = 'ab'"
  ("x.ljust(10)" "ab        ")))

(pyel-create-tests
 rfind-method
 ("'aaaxaaa'.rfind('x',3)"  3)
 ("'aaaxaaa'.rfind('x',4)"  -1)
 ("'aaaxaaa'.rfind('x',2, 4)"  3)
 ("'aaaxaaa'.rfind('x',1, 3)"  -1)
 ("'abcxebdxebdexed'.rfind('xe')" 12)
 ("x = 'asdf'
y = 'abxabxab'"
  ("x.rfind('sd')" 1)
  ("y.rfind('ab')" 6)))











;;

;;;;errors with these
;; (pyel-create-tests cond
;;                    "x = cond([1 > 2, 'first']
;;    [2 == 2, 'second']
;;    [5 == 7, 'third']
;;    [True, error('wtf')])
;; assert x == 'second'"
;;                    )

;;;;Errors with these
;; (pyel-create-tests lambda
;;                    "x = [2,3,4]
;; square = lambda([x]
;;  x*x)
