pyel-transforms.el
                       (string) ->  (py-rpartition obj sep)
                       (_)      ->  (call-method obj rpartition sep))

(pyel-method-transform rjust (obj width &optional fillchar)
                       (string) -> (py-rjust obj width fillchar)
                       (_)      -> (call-method obj rjust width fillchar))

(pyel-method-transform ljust (obj width &optional fillchar)
                       (string) -> (py-ljust obj width fillchar)
                       (_)      -> (call-method obj ljust width fillchar))

(pyel-method-transform rfind (obj sub &optional start end)
                       (string) -> (py-rfind obj sub start end)
                       (_)      -> (call-method obj rfind sub start end))

(pyel-method-transform rindex (obj sub &optional start end)
                       (string) -> (py-rindex obj sub start end)
                       (_)      -> (call-method obj rindex sub start end))

(pyel-method-transform replace (obj old new &optional count)
                       (string) -> (py-replace obj old new count)
                       (_)      -> (call-method obj replace old new count))

(pyel-method-transform clear (obj)
                       (hash) -> (py-hash-table-clear obj)
                       (_)      -> (call-method obj clear))

(pyel-method-transform fromkeys(obj keys &optional value)
                         (hash _ _) -> (py-fromkeys keys value)
                         (_)      -> (call-method obj fromkeys keys value))

(pyel-method-transform isprintable (obj)
                       (string) -> (py-isprintable obj)
                       (_)      -> (call-method obj isprintable))

;;

;;
