pyel.org
*** tests
#+Begin_SRC emacs-lisp :tangle pyel-tests.el
  ;;;;Errors with these
  ;; (pyel-create-tests lambda
  ;;                    "x = [2,3,4]
  ;; square = lambda([x]
  ;;  x*x)
  ;; y = mapcar(square,x)
  ;; assert y == [4,9,16]
  ;; "
  ;;                    "f = lambda([x,y]
  ;; if x > y:
  ;;  'x'
  ;; else:
  ;;  'y')
  ;; x=cl_mapcar(f, [1, 2, 3, 4, 5], [4, 2, 1, 6, 3])
  ;; assert x == ['y', 'y', 'x', 'y', 'x']")
#+END_SRC
** transform template
*** transform
#+Begin_SRC emacs-lisp :tangle pyel-transforms.el
;;
#+END_SRC
*** python ast
#+Begin_SRC python :tangle py-ast.py

#+END_SRC
*** python el lib
#+Begin_SRC emacs-lisp:tangle py-lib.el

#+END_SRC

*** tests
#+Begin_SRC emacs-lisp :tangle pyel-tests.el
;;
#+END_SRC


* ---------------------
* misc
#+Begin_SRC emacs-lisp :tangle pyel.el
  
  (defmacro pyel-string-nth (string index)
    (list 'substring string index
          (if (numberp index) (1+ index) (list '1+ index))))
  
  (defsubst pyel-nth (n seq)
    (let ((tp (type-of seq)))
      (cond ((eq tp 'cons)
             (nth n seq))
            ((eq tp 'vector)
             (aref seq n))
            ((eq tp 'string)
             (substring seq n (1+ n))))))
  
  (defun char-split-string (string)
    "split a string into its charaters"
    (cdr (butlast (split-string string ""))))
  
  
  (defun strip-end (string &optional char)
    "if CHAR occurs at the end of STRING, remove it"
    (let ((split (char-split-string string))
          (char (or char " ")))
      
      (while (string= char (car (last split)))
        (setq split (butlast split)))
      (mapconcat 'identity split "")))
  
  (defun strip-start (string &optional char)
    "if CHAR occurs at the beginning of STRING, remove all occurrences"
    (let ((split (char-split-string string))
          (char (or char " ")))
      
      (while (string= char (car split))
        (setq split (cdr split)))
      (mapconcat 'identity split "")))
  
  ;;built-in equivalent?
  (defun file-path-concat (&rest dirs)
    "concatenate strings representing file paths
  prevents multiple/none '/' seporating file names"
    (let* ((first (strip-end (car dirs) "/"))
           (last (strip-start (car (last dirs)) "/"))
           (dirs (append (list first)
                         (mapcar '(lambda (x)  (strip-start (strip-end x "/") "/"))
                                 (cdr (butlast dirs)))
                         (list last))))
      (mapconcat 'identity dirs "/")))
  
#+END_SRC

* EOF
** main
#+Begin_SRC emacs-lisp :tangle pyel.el
  (require 'transformer)
  (require 'pyel-transforms)
  (require 'pyel-tests-generated)
  (require 'pyel-preprocessor)
  
  (require 'py-objects)
  (require 'pyel-mode)
  (require 'py-lib)
  (require 'pyel-testing)
  
  (pyel "this_fixes_a_bug") ;;prevents errors the first time pyel-run-tests is run
  ;;...I'm so sorry
  
  (provide 'pyel)
  ;;pyel.el ends here
#+END_SRC
** transforms
#+Begin_SRC emacs-lisp :tangle pyel-transforms.el
(provide 'pyel-transforms)
;;pyel-transforms.el ends here
#+END_SRC
** tests
#+Begin_SRC emacs-lisp :tangle pyel-tests.el
(provide 'pyel-tests)
;;pyel-tests.el ends here
#+END_SRC
** py-lib
#+Begin_SRC emacs-lisp :tangle py-lib.el
(provide 'py-lib)
;;py-lib.el ends here
#+END_SRC
** python ast
#+Begin_SRC python :tangle py-ast.py
#py-ast.py ends here
#+END_SRC

* ------------------
* transform template
** transform
#+Begin_SRC emacs-lisp :tangle pyel-transforms.el
;;
#+END_SRC
** python ast
#+Begin_SRC python :tangle py-ast.py

#+END_SRC
** python el lib
#+Begin_SRC emacs-lisp :tangle py-lib.el

#+END_SRC

** tests
#+Begin_SRC emacs-lisp :tangle pyel-tests.el
;;
#+END_SRC

* .emacs config (move)
#+Begin_SRC emacs-lisp :tangle pyel.el
(setq pyel-use-list-for-varargs t)
;;(setq pyel-directory "path/to/pyel/directory")
;;(require 'pyel)
#+END_SRC
