pyel-tests.el
;; y = mapcar(square,x)
;; assert y == [4,9,16]
;; "
;;                    "f = lambda([x,y]
;; if x > y:
;;  'x'
;; else:
;;  'y')
;; x=cl_mapcar(f, [1, 2, 3, 4, 5], [4, 2, 1, 6, 3])
;; assert x == ['y', 'y', 'x', 'y', 'x']")

;;

(provide 'pyel-tests)
;;pyel-tests.el ends here

;;
