pyel.el

(defmacro pyel-string-nth (string index)
  (list 'substring string index
        (if (numberp index) (1+ index) (list '1+ index))))

(defsubst pyel-nth (n seq)
  (let ((tp (type-of seq)))
    (cond ((eq tp 'cons)
           (nth n seq))
          ((eq tp 'vector)
           (aref seq n))
          ((eq tp 'string)
           (substring seq n (1+ n))))))

(defun char-split-string (string)
  "split a string into its charaters"
  (cdr (butlast (split-string string ""))))


(defun strip-end (string &optional char)
  "if CHAR occurs at the end of STRING, remove it"
  (let ((split (char-split-string string))
        (char (or char " ")))
    
    (while (string= char (car (last split)))
      (setq split (butlast split)))
    (mapconcat 'identity split "")))

(defun strip-start (string &optional char)
  "if CHAR occurs at the beginning of STRING, remove all occurrences"
  (let ((split (char-split-string string))
        (char (or char " ")))
    
    (while (string= char (car split))
      (setq split (cdr split)))
    (mapconcat 'identity split "")))

;;built-in equivalent?
(defun file-path-concat (&rest dirs)
  "concatenate strings representing file paths
prevents multiple/none '/' seporating file names"
  (let* ((first (strip-end (car dirs) "/"))
         (last (strip-start (car (last dirs)) "/"))
         (dirs (append (list first)
                       (mapcar '(lambda (x)  (strip-start (strip-end x "/") "/"))
                               (cdr (butlast dirs)))
                       (list last))))
    (mapconcat 'identity dirs "/")))

(require 'transformer)
(require 'pyel-transforms)
(require 'pyel-tests-generated)
(require 'pyel-preprocessor)

(require 'py-objects)
(require 'pyel-mode)
(require 'py-lib)
(require 'pyel-testing)

(pyel "this_fixes_a_bug") ;;prevents errors the first time pyel-run-tests is run
;;...I'm so sorry

(provide 'pyel)
;;pyel.el ends here

(setq pyel-use-list-for-varargs t)
;;(setq pyel-directory "path/to/pyel/directory")
;;(require 'pyel)
